{
  "doc-435bdd9d26a21bb6e0962f9964419d8a": {
    "content": "IP多播 多播(也称组播)是让源主机一次发送的单个分组可以抵达用一个组地址标识的若干目的主 机，即一对多的通信。在互联网上进行的多播，称为IP多播。 与单播相比，在一对多的通信中，多播可大大节约网络资源。假设视频服务器向90台主 机传送同样的视频节目。多播时仅发送一份数据，并且只需发送一次，只有在传送路径出现分岔时才将分组复制后继续转发，因此大大减轻了发送者的 负担和网络的负载。多播需要路由器的支持才能实现，能够运行多播协议的路由器称为多播路由器 。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-435bdd9d26a21bb6e0962f9964419d8a"
  },
  "doc-d693d1041a7c71771a82a6eb9d69572e": {
    "content": "TCP的可靠传输机制 TCP 在不可靠的 IP 层之上建立一种可靠数据传输服务。TCP 提供的可靠数据传输服务保证 接收方从缓存区读出的字节流与发送方发出的字节流完全一样。TCP 使用了检验、序号、确认和重传等机制来达到这一目的。其中，TCP 的检验机制与UDP 一样，这里不再赘述。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-d693d1041a7c71771a82a6eb9d69572e"
  },
  "doc-e8fe3bc0c61afa98b433519e51df1934": {
    "content": "13.TCP/IP模型与OSI参考模型的比较 TCP/IP 模型与OSI 参考模型有许多相似之处。 首先，二者都采取分层的体系结构，且分层的功能也大体相似。 其次，二者都是基于独立的协议栈的概念。 最后，二者都可解决异构网络的互联，实现不同厂家生产的计算机之间的通信。 两个模型除了具有这些基本的相似之处，也有很多差别。 第一，OSI 参考模型的最大贡献是精确定义了三个主要概念：服务、协议和接口，这与现代 的面向对象程序设计思想非常吻合。而 TCP/IP 模型在这三个概念上没有明确区分。 第二，OSI 参考模型是7层模型，而TCP/IP 模型是4层结构。 TCP/IP 模型将 OSI 参考模型 的表示层和会话层的功能合并到了应用层，还将数据链路层和物理层合并为网络接口层。 第三，OSI 参考模型先有模型，后有协议规范，通用性良好，适合描述各种网络。TCP/IP 模 型正好相反，即先有协议栈，后建立模型，因此不适合任何其他的非TCP/IP 网络。 第四，OSI 参考模型在网络层支持无连接和面向连接的通信，但在传输层仅有面向连接的通 信。而 TCP/IP 模型认为可靠性是端到端的问题，因此它在网际层仅有一种无连接的通信模式， 但传输层支持无连接和面向连接两种模式。这个不同点容易在考试中出现。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e8fe3bc0c61afa98b433519e51df1934"
  },
  "doc-2f9682e67c13ca61b23bdfa696f033fb": {
    "content": "13.无线传输介质 无线通信已广泛用于蜂窝移动电话领域。便携式计算机的出现，以及军事、野外等特殊场合 对移动联网的需要，促进了移动通信的发展，现在无线局域网的应用已非常普遍。 (1)无线电波 无线电波具有较强的穿透能力，可以传输很长的距离，因此广泛用于通信领域，如无线手机 通信、计算机网络中的无线局域网 (WLAN) 等。因为无线电波使信号向所有方向散播，所以有 效距离范围内的接收设备无须对准某个方向，就可与无线电波发射者进行通信连接，大大简化了 通信连接。这也是无线电波传输的最重要优点之一。 (2)微波、红外线和激光 目前高带宽的无线通信主要使用三种技术：微波、红外线和激光，它们都需要在发送方 和接收方之间有一条视线通路，有很强的指向性。不同的是，红外线通信和激光通信将要传 输的信号分别转换为各自的信号格式，即红外线信号和激光信号，再直接在空间中传播。 微波通信的频率较高，频段范围也很宽，载波频率通常为2～40GHz, 因此通信信道的容量 大。例如，一个带宽为2MHz 的频段可容纳500条语音线路，若用来传输数字信号，则数据率可 达数兆比特/秒。与通常的无线电波不同，微波通信的信号是沿直线传播的，因此在地面上的传播 距离有限，超过一定距离后就要使用中继站来接力。 卫星通信利用地球同步卫星作为中继站来转发微波信号，可以突破地面微波通信距离的限 制。三颗相隔120°的同步卫星几乎就能覆盖整个地球表面，因此基本能实现全球通信。卫星通信 的优点是通信容量大、距离远、覆盖广，缺点是保密性差、端到端传播时延长。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2f9682e67c13ca61b23bdfa696f033fb"
  },
  "doc-90a6889a42d72981da53ed2ad8c557b5": {
    "content": "10. 违规编码法 在物理层进行比特编码时，常采用违规编码法。例如，曼彻斯特编码方法将数据比特“1” 编码成“高-低”电平对，将数据比特“0”编码成“低-高”电平对，而“高-高”电平对和“低 -低”电平对在数据比特中是违规的(没有采用),因此可借用这些违规编码序列来定界帧的起始 和终止。局域网IEEE 802 标准就采用了这种方法。违规编码法不采用任何填充技术便能实现数据 的透明传输，但只适用于采用冗余编码的特殊编码环境。 因为字符计数法中计数字段的脆弱性和字节填充法实现上的复杂性与不兼容性，所以目前较 常用的组帧方法是零比特填充法和违规编码法 。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-90a6889a42d72981da53ed2ad8c557b5"
  },
  "doc-c5fd84bdd36dbfe5f2c13e2df224891b": {
    "content": "18.无分类编址 CIDR 无分类域间路由选择 (Classless Inter-Domain Routing,CIDR)是在变长子网掩码的基础上， 提出的一种消除传统A 、B 、C 类地址及划分子网的概念。例如，若一个单位需要2000个地址， 则给它分配一个2048地址的块，而不是分配一个完全的B 类地址，因此可更有效地分配IPv4 的 地址空间。CIDR 使用网络前缀的概念代替网络的概念，与传统分类IP 地址最大的区别就是，网 络前缀的位数不是固定的，可以任意选取。 CIDR 的记法是IP地址：:={<网络前缀>,<主机号>}。 CIDR 还使用斜线记法(或称CIDR 记法),即记为“IP 地址/网络前缀所占的位数”。其中， 网络前缀所占的位数对应网络号的部分，等效于子网掩码中连续1 的部分。例如，对于 128.14.32.5/20这个地址，它的掩码是20个连续的1和后续12个连续的0,通过逐位“与”的方 法可得该地址的网络前缀(或直接截取前20位): 网络前缀=10000000.00001110.00100000.00000000( 128.14.32.0) 斜线记法不仅能表示其IP 地址，还能表示这个地址块的网络前缀有多少位。采用CIDR 后， 斜线及后面的数字一定不能省略，否则仅从斜线左边的IP 地址无法知道其网络地址。 CIDR 将网络前缀都相同的连续IP 地址组成一个CIDR 地址块。只要知道CIDR 地址块中的 任何一个地址，就能知道这个地址块的最小地址和最大地址，以及地址块中的地址数。上例的地址128.14.32.5/20所在CIDR 地址块中的最小地址和最大地址为 最小地址：10000000.00001110.00100000.00000000( 128.14.32.0) 最大地址：10000000.00001110.00101111.11111111( 128.14.47.255) 主机号全0或全1的地址一般不使用，通常只使用在这两个特殊地址之间的地址。 CIDR 虽然不使用子网，但仍然使用“掩码”一词。“CIDR 不使用子网”是指CIDR 并没有 在32位地址中指明若干位作为子网字段。但分配到一个CIDR 地址块的单位，仍可在本单位内根 据需要划分出一些子网。例如，某单位分配到地址块/20,就可继续划分为8个子网(从主机号中 借用3位来划分子网),这时每个子网的网络前缀就变成了23位。 CIDR 地址块中的地址数一定是2的整数次幂，实际可指派的地址数通常为2N-2，N表示主机号的位数，主机号全0代表网络号，主机号全1为广播地址。网络前缀越短，其地址块包含的地址数就越多。而在三级结构的IP 地址中，划分子网使网络前缀变长。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c5fd84bdd36dbfe5f2c13e2df224891b"
  },
  "doc-33e5d43933775bf940b52ea89a1ddcf7": {
    "content": "1.网络层的功能 网络层提供主机到主机的通信服务，主要任务是将分组从源主机经过多个网络和多段链路传 输到目的主机。该任务可划分为分组转发和路由选择两种重要功能。 OSI 参考模型曾主张在网络层使用面向连接的虚电路服务，认为应由网络自身来保证通信的 可靠性。而 TCP/IP 体系的网络层提供的是无连接的数据报服务，其核心思想是应由用户主机来 保证通信的可靠性。 在互联网采用的 TCP/IP 体系结构中，网络层向上只提供简单灵活的、无连接的、尽最大努力交付的数据报服务。也就是说，所传送的分组可能出错、丢失、重复、失序或超时，这就使得 网络中的路由器可以做得比较简单，而且价格低廉。通信的可靠性可以由更高层的传输层来负责。 采用这种设计思路的好处是：网络的造价大大降低，运行方式灵活，能够适应多种应用。互联网 能够发展到今日的规模，充分证明了当初采用这种设计思想的正确性。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-33e5d43933775bf940b52ea89a1ddcf7"
  },
  "doc-64fefe780381280a30e8fe1364129eb0": {
    "content": "30.CSMA/CA 算法的归纳如下： 1)若站点最初有数据要发送(而非发送不成功再进行重传),且检测到信道空闲，那么在 等待时间DIFS 后，就发送整个数据帧。 2)否则，站点执行 CSMA/CA 退避算法，选取一个随机退避值。一旦检测到信道忙，退避 计时器就保持不变。只要信道空闲，退避计时器就进行倒计时。 3)当退避计时器减至0时(这时信道只可能是空闲的),站点就发送整个帧并等待确认。 4)发送站若收到确认，就知道已发送的帧被目的站正确接收。这时要发送第二帧，就要从 步骤2)开始，执行CSMA/CA 退避算法，随机选定一段退避时间。 若发送站在规定时间(由重传计时器控制)内未收到确认帧 ACK, 就必须重传该帧，再次 使用CSMA/CA 协议争用该信道，直到收到确认，或经过若干次重传失败后放弃发送。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-64fefe780381280a30e8fe1364129eb0"
  },
  "doc-2c39734eccce84bf0d9f02407e80d6ba": {
    "content": "31.轮询访问：令牌传递协议 在轮询访问中，用户不能随机地发送信息，而要通过一个集中控制的监控站，以循环方式轮 询每个节点，再决定信道的分配。典型的轮询访问控制协议是令牌传递协议。 在令牌传递协议中，一个令牌 (Token) 沿着环形总线在各站之间依次传递。令牌是一个特 殊的控制帧，它本身并不包含信息，仅控制信道的使用，确保同一时刻只有一个站独占信道。当 环上的一个站希望发送帧时，必须等待令牌。站点只有取得令牌后才能发送帧，因此令牌环网络 不会发生冲突(因为令牌只有一个)。站点发送完一帧后，应释放令牌，以便让其他站使用。因 为令牌在网环上是按顺序依次传递的，所以对所有联网计算机而言，访问权是公平的。 令牌环网络中令牌和数据的传递过程如下： 1)当网络空闲时，环路中只有令牌帧在循环传递。 2)当令牌传递到有数据要发送的站点时，该站点就修改令牌中的一个标志位，并在令牌中 附加自己需要传输的数据，将令牌变成一个数据帧，然后将这个数据帧发送出去。 3)数据帧沿着环路传输，接收到的站点一边转发数据， 一边查看帧的目的地址。若目的地 址和自己的地址相同，则接收站就复制该数据帧，以便进一步处理。 4)数据帧沿着环路传输，直到到达该帧的源站点，源站点收到自己发出去的帧后便不再转 发。同时，通过检验返回的帧来查看数据传输过程中是否出错，若出错，则重传。 5)源站点传送完数据后，重新产生一个令牌，并传递给下一站点，交出信道控制权。 令牌传递协议非常适合负载很高(多个节点在同一时刻发送数据的概率很大)的广播信道， 若采用随机介质访问控制，则发生冲突的概率很大。令牌传递协议既不共享时间，又不共享空间； 它实际上在随机访问介质访问控制的基础上，限定了有权发送数据的节点只能有一个。 即使是广播信道也可通过介质访问控制机制，使广播信道变为逻辑上的点对点信道，所以说 数据链路层研究的是“点到点”之间的通信。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2c39734eccce84bf0d9f02407e80d6ba"
  },
  "doc-8ec1cc43b53a75d3abceeacc27d01564": {
    "content": "25.IPv6的特点 目前广泛使用的IPv4 是在20世纪70年代设计的，互联网经过几十年的飞速发展，到2011 年 2 月 ，IPv4 地址已经耗尽，为了解决 “IP地址耗尽”问题，有以下三种措施： 1)采用无类别编址CIDR, 使 IP 地址的分配更加合理。 2)采用网络地址转换 (NAT)方法以节省全球 IP 地址。 3)采用具有更大地址空间的新版本的IPv6。 前两种方法只是延长了IPv4 使用寿命，只有第三种方法能从根本上解决IP 地址耗尽问题。 IPv6 的主要特点如下： 1)更大的地址空间。这是最重要的。 IPv6 将地址从IPv4 的32位增大到128位，IPv6 的地 址空间是IPv4 的2¹28/2³²=296倍，从长远来看，这些地址是绝对够用的。 2)扩展的地址层次结构。 IPv6 因为地址空间很大，所以可以划分为更多的层次。 3)灵活的首部格式。IPv6 定义了许多可选的扩展首部，不仅可提供比IPv4 更多的功能，还 能提高路由器的处理效率，这是因为路由器对扩展首部不进行处理。 4)改进的选项。 IPv6 首部长度是固定的，其选项放在有效载荷中，选项是灵活可变的。而 IPv4 所规定的选项是固定不变的，其选项放在首部的可变部分。 5)允许协议继续扩充。 IPv6 允许不断扩充功能，而IPv4 的功能是固定不变的。 6)支持即插即用(自动配置)。因此IPv6 不需要使用DHCP。 7)支持资源的预分配。 IPv6 支持实时音/视频等要求保证一定带宽和时延的应用。 8)IPv6 只有源主机才能分片，是端到端的，不允许类似IPv4 在中间路由器进行分片。 9)IPv6 首部长度是固定的40B,而IPv4 首部长度是可变的(必须是4B 的整数倍)。 10)增大了安全性。身份鉴别和保密功能是IPv6 的扩展首部。 虽然IPv6 与 IPv4 不兼容，但总体而言它与所有其他的互联网协议兼容，包括TCP 、UDP、 ICMP 、IGMP 和 DNS 等，只是在少数地方做了必要的修改(大部分是为了处理长地址)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8ec1cc43b53a75d3abceeacc27d01564"
  },
  "doc-5086a97acf28dfe48979a0861070dab7": {
    "content": "HTTP的特点 HTTP 使用TCP 作为传输层协议，保证了数据的可靠传输。HTTP 不必考虑数据在传输过程 中被丢弃后又怎样被重传。但是，HTTP 本身 是无连接的 (务必注意)。也就是说，虽然HTTP 使 用了TCP 连接，但通信的双方在交换HTTP 报文之前不需要先建立HTTP 连接。 HTTP 是无状态的。也就是说，同一个客户第二次访问同一个服务器上的页面时，服务器的 响应与第一次被访问时的相同，因为服务器并不记得曾经服务过的这个客户。 HTTP 的无状态特性简化了服务器的设计，使之更易支持大量并发的请求。在实际应用中， 通常使用Cookie 加数据库的方式来跟踪用户的活动(如记录用户最近浏览的商品等)。 Cookie 的工作原理：当用户初次浏览某个使用 Cookie 的网站时，该网站服务器就为用户产生一个唯一的 Cookie 识别码，如“12345”,并以此为索引在后端数据库中创建一个项目，用来记录用户访问该 网站的各种信息。接着在给用户的响应报文中添加一个Set-cookie 的首部行“Set cookie:12345”, 用户收到响应后，就在它管理的特定Cookie 文件中添加该服务器的主机名和Cookie 识别码。当 用户再次浏览这个网站时，会取出这个网站的识别码，并在请求报文中添加一个 Cookie 首部行 “Cookie:12345” 。服务器根据Cookie 识别码就能从数据库中查询到该用户的活动记录，进而执行一些个性化的工作，如根据用户的历史浏览记录向其推荐新商品等。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5086a97acf28dfe48979a0861070dab7"
  },
  "doc-e138d554b6cd05839654386c2b499665": {
    "content": "CSMA/CD最短帧长 现在考虑一种情况：某站发送一个很短的帧，但在发送完之前并未检测出冲突。假定这个帧 在继续向前传播到达目的站之前和别的站发送的帧发生了冲突，因此目的站将收到有差错的帧 (当然会把它丢弃)。然而，发送站却不知道发生了冲突，因此不会重传这个帧。为了避免发生 这种情况，以太网规定了一个最短帧长 (争用期内可发送的数据长度)。在争用期内若检测到冲 突，就停止发送，此时已发送出去的数据一定小于最短帧长，因此凡长度小于这个最短帧长的帧， 就都是因为冲突而异常中止的无效帧。最短帧长的计算公式为： 最短帧长=最大单向传播时延×数据传输速率×2 例如，以太网规定51.2 μs 为争用期的长度。对于10Mb/s的以太网，在争用期内可发送512bit, 即64B。当以太网发送数据时，若前64B 未发生冲突，则后续数据也不会发生冲突(表示已成功抢 占信道)。换句话说，若发生冲突，则一定在前64B。因为一旦检测到冲突就立即停止发送，所以 这时发送出去的数据一定小于64B。于是，以太网规定最短帧长为64B, 凡长度小于64B 的帧，就 都是因为冲突而异常中止的无效帧，收到这种无效帧时应立即丢弃。 若只发送小于64B 的帧，如40B的帧，则需要在MAC 子层中于数据字段的后面加一个整数 字节的填充字段，以保证以太网的MAC 帧的长度不小于64B。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e138d554b6cd05839654386c2b499665"
  },
  "doc-8de233eef29df2b5f5780ea3ec012c73": {
    "content": "10.双绞线 双绞线是最常用的传输介质，在局域网和传统电话网中普遍使用。双绞线由两根采用一定规 则并排绞合、相互绝缘的铜导线组成。绞合可减少对相邻导线的电磁干扰。为了进一步提高抗电 磁干扰的能力，还可在双绞线的外面加上一层金属丝编织成的屏蔽层，这就是屏蔽双绞线(STP)。 无屏蔽层的双绞线称为非屏蔽双绞线( UTP)。 双绞线的结构如图2.4所示。 双绞线的价格便宜，模拟传输和数字传输都可使用双绞线，通信距离一般为几千米到数十千 米。双绞线的带宽取决于铜线的粗细和传输的距离。距离太远时，对于模拟传输，要用放大器放 大衰减的信号；对于数字传输，要用中继器来对失真的信号进行整形。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8de233eef29df2b5f5780ea3ec012c73"
  },
  "doc-ded820cc4b9df1e3a9f4c6f9dd3fb3c0": {
    "content": "40.广域网的基本概念 广域网 (Wide Area Network,WAN) 通常是指覆盖范围很广(远超一个城市的范围)的长距 离网络，任务是长距离运送主机所发送的数据。连接广域网各节点交换机的链路都是高速链路， 广域网首要考虑的问题是通信容量必须足够大，以便支持日益增长的通信量。 广域网不等于互联网。互联网可以连接不同类型的网络，通常使用路由器来连接。图3.32 显示了由相距较远的局域网通过路由器与广域网相连而成的一个覆盖范围很广的互联网。因 此，局域网可以通过广域网与另一个相隔很远的局域网通信。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ded820cc4b9df1e3a9f4c6f9dd3fb3c0"
  },
  "doc-9e5c83dc6ab2e9b79de27342e6bcf4f1": {
    "content": "12.光纤 光纤通信是指利用光导纤维(简称光纤)传递光脉冲来进行通信。有光脉冲表示1,无光脉 冲表示0。可见光的频率约为10⁸MHz,因此光纤通信系统的带宽极大。 光纤主要由纤芯和包层构成,纤芯很细，直径仅为8~100 μm, 包层较纤芯有较 低的折射率，光波通过纤芯进行传导。当光线从高折射率的介质射向低折射率的介质时，其折射 角将大于入射角。因此，只要入射角大于某个临界角，就会出现全反射，即光线碰到包层时就会 折射回纤芯，这个过程不断重复，光也就沿着光纤传输下去。 利用光的全反射特性，可让从不同角度入射的多条光线在一根光纤中传输，这种光纤称为多 模光纤。光脉冲在多模光纤中传输的损耗更高，因此较适合近距离传输。 当光纤的直径减小到只有一个光的波长时，光纤就像一根波导那样，可使光线一直向前传播， 而不产生多次反射，这样的光纤就是单模光纤(见图2.8)。单模光纤的纤芯很细，直径只有几微 米，制造成本较高。同时，单模光纤的光源是定向性很好的半导体激光器，因此单模光纤的衰减 较小，可传输数千米甚至数十千米而不必采用中继器，适合远距离传输光纤不仅具有通信容量非常大的优点，还具有如下特点： 1)传输损耗小，中继距离长，对远距离传输特别经济。 2)抗雷电和电磁干扰性能好，在有大电流脉冲干扰的环境下这尤为重要。 3)无串音干扰，保密性好，不易被窃听或截取数据。 4)体积小，重量轻，在现有电缆管道已拥塞不堪的情况下这特别有利。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-9e5c83dc6ab2e9b79de27342e6bcf4f1"
  },
  "doc-b872e6d68299bd1edb20c872667c0401": {
    "content": "12.检错编码 检错编码都采用冗余编码技术，核心思想是在有效数据 (信息位)被发送前，按某种关系附 加一定的冗余位(检验位),构成一个符合某一规则的码字后发送。当要发送的有效数据变化时， 相应的冗余位也随之变化，使得码字遵从不变的规则。接收方根据收到的码字是否仍符合原规则 来判断是否出错。常见的检错编码有奇偶检验码和循环冗余码。 1. 奇偶检验码 奇偶检验码是奇检验码和偶检验码的统称，是一种最基本的检错码。它由n-1 位数据和1位 检验位组成，检验位的取值(0或1)将使整个检验码中“1”的个数为奇数或偶数。 1)奇检验码：附加一个检验位后，n 位的码字中“1”的个数为奇数。 2)偶检验码：附加一个检验位后，n 位的码字中“1”的个数为偶数。 例如，7位数据1001101对应的奇检验码为10011011,对应的偶检验码为10011010。奇偶检 验码只能检测奇数位的出错情况，但不知道哪些位错了，也不能发现偶数位的出错情况。 2. 循环冗余码 数据链路层广泛使用循环冗余码 (Cyclic Redundancy Code,CRC) 检错技术。 循环冗余码 (CRC) 检错的基本思想： 1)收发双方约定一个生成多项式G(x) (要求最低位必须为1)。k 位位串可视为阶数为k-1 的 多项式的系数序列。例如，可用多项式x³+x²+1 表示位串1101。 2)发送方基于待发送的数据和 G(x), 计算出冗余码，将冗余码附加到数据后面一起发送。 3)接收方收到数据和冗余码后，通过G(x) 来计算收到的数据和冗余码是否产生差错。 假设一个待传送m 位的数据，CRC 运算产生一个r 位的冗余码，称为帧检验序列 (FCS) 。 这 样形成的帧将由m+r 位组成。在所要发送的数据后面增加r 位冗余码，虽然增大了传输开销， 但是可以进行差错检测，这种代价往往是值得的。这个带检验码的帧刚好能被预先确定的多项式 G(x)整除。接收方用相同的多项式去除收到的帧，若余数为0,则认为无差错。 假设一段m 位数据，则计算冗余码的步骤如下： 1)加0。假设 G(x)的阶为r, 在数据后面加r 个0,相当于乘以2'。 2)模2除。利用模2除法，用G(x)对应的二进制串去除1)中计算得出的数据串，得到的余 数即为冗余码(共r 位，前面的0不可省略)。 按照模2运算规则，加法不进位，减法不借位，相当于对应位进行逻辑异或运算。 冗余码的计算举例。假设数据M=101001(m=6), 除数G(x)=1101(r=3), 经模2除法运 算后的结果是：商Q=110101 (这个商没什么用),余数R=001。因此，发送出去的数据为101001001(2'M+FCS),共有m+r位。 发送方的FCS 生成和接收方的CRC 检验都是由硬件实现的，处理很迅速，不会影响数据的 传输。若在传输过程中无差错，则经过CRC 检验后得出的余数R 肯定为0。但是，若出现误码， 则余数R 仍为0的概率极低。因此，通过CRC 检错技术，可以做到对帧的无差错接受，即“凡 是接收方数据链路层接受的帧，我们都能以非常接近1的概率认为这些帧在传输过程中未产生差 错\";而接收方丢弃的帧虽然曾经收到，但最终因为有差错而被丢弃，即未被接受。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-b872e6d68299bd1edb20c872667c0401"
  },
  "doc-a383ff24728cd86c12eb3a588a93b781": {
    "content": "TCP连接建立的3次握手过程 第一步：客户机首先向服务器发送连接请求报文段。请求报文段的 SYN 位置1,同时选择一 个初始序号seq=x。TCP规定，SYN报文段 (SYN=1 的报文段)不能携带数据，但要消耗一个序号。这时，客户机进入SYN-SENT (同步已发送)状态。 第二步：服务器收到连接请求报文段后，如同意建立连接，则向客户机发回确认。确认报文 段的 SYN 位和 ACK 位都置1,确认号ack=x+1, 同时选择一个初始序号seq=y 。 确认报文段不 能携带数据，但也要消耗一个序号。这时，服务器进入SYN-RCVD (同步收到)状态。 第三步：客户机收到确认报文段后，还要向服务器给出确认。确认报文段的 ACK 位置1, 确认号 ack=y+1,序号 seq=x+1 。该报文段可以携带数据。若不携带数据，则不消耗序号，下 一个数据报文段的序号仍为x+1 。这时，客户机进入 ESTABLISHED (已建立连接)状态。 当服务器收到来自客户机的确认后，也进入 ESTABLISHED 状态。 成功进行以上三步后，就建立了 TCP 连接，接下来就可以传送应用层数据。TCP 提供的是 全双工通信，因此通信双方的应用进程在任何时候都能发送数据。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a383ff24728cd86c12eb3a588a93b781"
  },
  "doc-91effd7dab51380f256eb6af95d2aaae": {
    "content": "15.可靠传输机制 可靠传输是指发送方发送的数据都能被接收方正确地接收，通常采用确认和超时重传两种机 制来实现。确认是指接收方每收到发送方发来的数据帧，都要向发送方发回一个确认帧，表示已 正确地收到该数据帧。超时重传是指发送方在发送一个数据帧后就启动一个计时器，若在规定时 间内没有收到所发送数据帧的确认帧，则重发该数据帧，直到发送成功为止。 使用这两种机制的可靠传输协议称为自动重传请求( ARQ), 它意味着重传是自动进行的， 接收方不需要对发送方发出重传请求。在 ARQ协议中，数据帧和确认帧都必须编号，以区分确 认帧是对哪个帧的确认，以及哪些帧还未确认。ARQ 协议分为三种：停止-等待 (Stop-and-Wait) 协议、后退N 帧 (Go-Back-N) 协议和选择重传 (Selective Repeat) 协议。值得注意的是，这三 种可靠传输协议的基本原理并不仅限于数据链路层，还可应用到其上各层。 在有线网络中，链路的误码率较低，为了降低开销，并不要求数据链路层向其上层提供可靠 传输服务，即使出现了误码，可靠传输的问题也由其上层处理。而无线网络的链路易受干扰，误 码率较高，因此要求数据链路层必须向其上层提供可靠传输服务。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-91effd7dab51380f256eb6af95d2aaae"
  },
  "doc-6b7c657f1967dce5705d736f3efd0c32": {
    "content": "UDP检验 在计算检验和时，要在 UDP数据报之前增加12B的伪首部，伪首部并不是UDP的真正首部。只是在计算检验和时，临时添加在UDP数据报的前面，得到一个临时的UDP数据报。检验和就是按照这个临时的 UDP数据报来计算的。伪首部既不向下传送，又不向上递交，而只是为了计算检验和。 UDP 计算检验和的方法和计算IP 数据报首部检验和的方法基本相同。不同的是： IP 数据报 的检验和只检验IP 数据报的首部，但 UDP 的检验和要将首部和数据部分一起检验。 UDP 计算检验和的方法： 在发送方，先把全0放入检验和字段，再把伪首部和 UDP 数据报 看成是由许多16位的字串接起来的。若UDP 数据报的数据部分不是偶数个字节，则要在末尾填 入一个全0字节(但此字节不发送)。然后按二进制反码计算出这些16位字的和。将此和的二进制反码写入检验和字段，并发送。 在接收方，把收到的 UDP 数据报连同伪首部(若不是偶数个字节，则还需补上一个全0字节)后，按二进制反码求这些16位字的和。当无差错时其结果应为全1,否则就表明有差错出现，接收方就应丢弃这个 UDP 数据报。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-6b7c657f1967dce5705d736f3efd0c32"
  },
  "doc-9efc7a10d017bd1ef2dc172877b3ee17": {
    "content": "电子邮件的收发过程 ① 发件人调用用户代理来撰写和编辑要发送的邮件。 ② 邮件撰写完后，发件人点击“发送邮件”按钮，把发送邮件的工作全都交给用户代理来 完成，就什么都不用管了。用户代理用SMTP 把邮件传送给发送端邮件服务器。 ③ 发送端邮件服务器将邮件放入邮件缓存队列中，等待发送。 ④ 发送端邮件服务器的 SMTP 客户与接收端邮件服务器的SMTP 服务器建立TCP 连接，然 后就把邮件缓存队列中的邮件依次发送出去。注意，邮件是直接传送给接收端邮件服务 器的，而不会在互联网的某个中间邮件服务器落地。 ⑤ 运行在接收端邮件服务器中的 SMTP 服务器进程收到邮件后，将邮件放入收件人的用户邮箱，等待收件人在方便时进行读取。 ⑥ 收件人打算收信时，调用用户代理，使用POP3 ( 或IMAP) 协议将自己的邮件从接收端 邮件服务器的用户邮箱中取回(如果邮箱中有来信的话)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-9efc7a10d017bd1ef2dc172877b3ee17"
  },
  "doc-d2c6d06a73e0ddce405a5b6e58fdcb93": {
    "content": "6.数字数据编码为数字信号 数字数据编码用于基带传输中，即在基本不改变数字数据信号频率的情况下，直接传输数字 信号。具体用什么样的数字信号表示0及用什么样的数字信号表示1,就是所谓的编码。编码的 规则有多种，只要能有效区分0和1即可。常用的数字数据编码有以下几种， 1)归零 (RZ) 编码。用高电平表示1、低电平表示0(或者相反),每个码元的中间均跳变 到零电平(归零),接收方根据该跳变调整本方的时钟基准，这就为收发双方提供了自同步机制。因为归零需要占用一部分带宽，所以传输效率受到了一定的影响。 2)非归零(NRZ) 编码。与R Z编码的区别是不用归零，一个时钟全部用来传输数据，编码 效率最高。但NRZ 编码的收发双方存在同步问题，为此需要双方都带有时钟线。 3)反向非归零(NRZI) 编码。与NRZ 编码的区别是用电平的跳变表示0、电平保持不变表 示1。跳变信号本身可作为一种通知机制。这种编码方式集成了前两种编码的优点，既能 传输时钟信号，又能尽量不损失系统带宽。USB 2.0的编码方式就是NRZI 编码。 4)曼彻斯特编码。每个码元的中间都发生电平跳变，电平跳变既作为时钟信号(用于同步), 又作为数据信号。可用向下跳变表示1、向上跳变表示0,或者采用相反的规定。 5)差分曼彻斯特编码。每个码元的中间都发生电平跳变，与曼彻斯特编码不同的是，电平 跳变仅表示时钟信号，而不表示数据。数据的表示在于每个码元开始处是否有电平跳变： 无跳变表示1,有跳变表示0。差分曼彻斯特编码拥有更强的抗干扰能力。 标准以太网使用的就是曼彻斯特编码，而差分曼彻斯特编码则被广泛用于宽带高速网中。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-d2c6d06a73e0ddce405a5b6e58fdcb93"
  },
  "doc-062bb13233440998dd19c64c269aecc9": {
    "content": "11.OSI参考模型 国际标准化组织 (ISO)提出的网络体系结构模型称为开放系统互连参考模型 (OSI/RM),简称OSI 参考模型。OSI 参考模型有7层，自下而上(第1~7层)依次为物理层、数据链路层、网络层、传输层、会话层、表示层、应用层。OSI 参 ( 1 ) 物理层 (Physical Layer) 物理层的传输单位是比特，功能是在物理介质上为数据端设备透明地传输原始 比特流。物理层主要研究以下内容 ： ①通信链路与通信节点的连接需要一些电路接口，物理层规定了这些接口的 一些参数，如机械形状和尺寸、引脚的数量和排列等，例如笔记本电脑上的网 线接口。 ②物理层规定了通信链路上所传输的信号的意义和电气特征。例如，若规定信号X代表数字0 ,则当节点传输0时就发出信号X, 而当节点接收到信号X 时就知道收到的是0。 注意，传输信息所用的一些物理介质（如双绞线、光缆、无线信道等)并不在物理层协议之内，而在物理层协议下面。因此，有人将物理介质当作第0层 。 ( 2 ) 数据链路层 (Data Link Layer) 数据链路层的传输单位是帧。两台主机之间的数据传输总是在一段一段的链路上进行的，这就需要使用专门的链路层协议。主要作用是加强物理层传输原始比特流的功能，将物理层提供的 可能出错的物理连接改造为逻辑上无差错的数据链路。数据链路层将网络层交来的IP分组封装成帧，并且可靠地传输到相邻节点的网络层，实现节点之间的差错控制和流量控制的功能。 因为外界噪声的干扰，所以原始的物理连接在传输比特流时可能发生错误。 广播式网络在数据链路层还要处理新的问题，即如何控制对共享信道的访问。 (3)网络层 (Network Layer) 网络层的传输单位是数据报。它关心的是通信子网的运行控制，主要任务是将网络层的协议 数据单元(分组)从源主机传输到目的主机，为分组交换网上的不同主机提供通信服务。关键问 题是对分组进行路由选择，并实现流量控制、拥塞控制、差错控制和网际互联等功能。网络层既 提供有连接可靠的虚电路服务，又提供无连接不可靠的数据报服务。 注意，无论是在哪一层传送的数据单元，都可以笼统地用“分组”来表示。 流量控制与数据链路层的流量控制的含义一样，都是协调A 的发送速率和B 的接收速率。 若图1.11中的节点都来不及接收分组而丢弃大量分组，导致节点间无法正常通信，则网络处于拥塞状态。网络层要采取措施来缓解这种拥塞，这就是拥塞控制。 差错控制是通信节点之间约定的特定检错规则，接收方根据该规则检查接收到的分组是否出 错，若出错，则能纠错就纠错，不能纠错就丢弃，确保向上层提交的数据都是无误的。 (4)传输层 (Transport Layer) 传输层也称运输层，负责主机中两个进程之间的通信，提供端到端的流量控制、差错控制、 连接建立与释放、可靠传输管理等服务，传输层仅提供有连接可靠的服务。 数据链路层提供的是点到点通信，传输层提供的是端到端通信，两者不同。 通俗地说，点到点可理解为主机和主机之间的通信，一个点是指一个硬件地址或 IP 地址，网络中参与通信的主机是通过硬件地址或IP 地址来标识的；端到端通信是指运行在不同主机内的 两个进程之间的通信， 一个进程由一个端口来标识，因此称为端到端通信。 通过传输层的屏蔽，高层用户看不到通信子网的交替和变化。因为一台主机可同时运行多个进程，所以传输层具有复用和分用的功能。复用是指多个应用层进程可同时使用下面传输层的服务，分用是指传输层将收到的信息分别交付给上面应用层中相应的进程。 (5)会话层 (Session Layer) 会话层允许不同主机上的各个进程之间进行会话。这种服务主要为表示层实体或用户进程建 立连接，并在连接上有序地传输数据，这就是会话，也称建立同步(SY N) 。 会话层负责管理主机间的会话进程，包括建立、管理和终止进程间的会话。会话层包含一种称为检查点的机制来维 持可靠会话，使通信会话在通信失效时从检查点继续恢复通信，即断点下载的原理。 (6)表示层 (Presentation Layer) 表示层主要处理在不同主机中交换信息的表示方式。不同机器采用的编码和表示方法不同， 为了使不同表示方法的数据和信息之间能够互相交换，表示层采用抽象的标准方法定义数据结 构，并采用标准的编码形式。此外，数据压缩、加密和解密也是表示层的功能。 (7)应用层 (Application Layer) 应用层是OSI 参考模型的最高层，是用户与网络的接口。应用层为特定类型的网络应用提供 访问OSI 参考模型环境的手段。用户的实际应用多种多样，这就要求应用层采用不同的应用协议 来满足不同类型的应用要求，因此应用层是最复杂的一层，使用的协议也最多。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-062bb13233440998dd19c64c269aecc9"
  },
  "doc-cfbef1aa24796f655483739dd955928a": {
    "content": "20.信道划分介质访问控制 信道划分介质访问控制将使用同一传输介质的多个设备的通信隔离开来，把时域和频域资源 合理地分配给这些设备。信道划分介质访问控制通过复用技术实现。所谓复用，是指在发送端把 多个发送方的信号组合在一条物理信道上进行传输，在接收端把收到的复用信号分离出来，并发 送给对应的接收方，如图3.16所示。当传输介质的带宽超过传输单个信号所需的带宽时，通过在 一条介质上传输多个信号，还能提高传输系统的利用率。 信道划分的实质是通过分时、分频、分码等方法，将原来的一个广播信道，逻辑上分为几个用 于在两个节点之间进行通信的互不干扰的子信道，即将广播信道转变为若干个点对点信道。 信道划分介质访问控制分为以下4种。 1. 时分复用 (TDM) 时分复用 (Time Division Multiplexing,TDM) 是指将信道的传输时间划分为一段段等长的 时间片，称为TDM 帧，每个用户在每个TDM 帧中占用固定序号的时隙，每个用户所占用的时隙 周期性地出现(其周期就是TDM 的长度),所有用户在不同的时间占用同样的信道资源，如 图3.17所示。TDM 帧实际上是一段固定长度的时间，它与数据链路层的帧不是同一个概念。 从某个时刻来看，时分复用信道上传送的仅是某对用户之间的信号；从某段时间来看，传送 的是按时间分割的复用信号。因为时分复用是按固定次序给用户分配时隙的，当用户在某段时间 暂无数据传输时，其他用户也无法使用这个暂时空闲的线路资源，所以时分复用后的信道利用率 不高。统计时分复用(Statistic TDM,STDM)也称异步时分复用，它是对 TDM 的一种改进。STDM帧与 TDM 帧不同，它并不固定分配时隙，而按需动态分配时隙，当用户有数据要传送时，才会 分配到 STDM 帧中的时隙，因此可以提高线路的利用率。例如，假设线路的数据传输速率为 6000b/s，3个用户的平均速率都为2000b/s, 当采用TDM 方式时，每个用户的最高速率为2000b/s, 而在STDM方式下，每个用户的最高速率可达6000b/s。 频分复用 (FDM) 频分复用 (Frequency Division Multiplexing,FDM) 是指将信道的总频带划分为多个子频带， 每个子频带作为一个子信道，每对用户使用一个子信道进行通信，如图3.18所示。所有用户在同 一时间占用不同的频带资源。每个子信道分配的频带可不相同，但它们的总和不能超过信道的总 频带 。 在实际应用中 ， 为了防止子信道之间互相干扰 ， 相邻信道间还要加入 “ 隔离频带 ”。 频分复用的优点在于充分利用了传输介质的带宽，系统效率较高，实现也较容易。 3. 波分复用 (WDM) 波分复用 (Wavelength Division Multiplexing,WDM) 即光的频分复用，它在一根光纤中传输 多种不同波长(频率)的光信号，因为波长不同，各路光信号互不干扰，最后用光分用器将各路波 长分解出来。因为光波处于频谱的高频段，有很大的带宽，所以可以实现多路的波分复用。 4. 码分复用 (CDM) 码分复用 (Code Division Multiplexing,CDM) 是采用不同的编码来区分各路原始信号的一种 复用方式。与FDM 和TDM 不同，它既共享信道的频率，又共享时间。 实际上，更常用的名词是码分多址 (Code Division Multiple Access,CDMA),其原理是将每 个比特时间再划分成m 个短的时间槽，称为码片(Chip), 通常m 的值是64或128,下例中为简 单起见，设m 为8。每个站点被指派一个唯一的m 位码片序列。发送1时，站点发送它的码片序 列；发送0时，站点发送该码片序列的反码。当两个或多个站点同时发送时，各路数据在信道中 线性相加。为了从信道中分离出各路信号，要求各个站点的码片序列相互正交。 简单理解就是，A 站向C 站发出的信号用一个向量来表示，B 站向C 站发出的信号用另一个 向量来表示，两个向量要求相互正交。向量中的分量，就是所谓的码片。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-cfbef1aa24796f655483739dd955928a"
  },
  "doc-2193c45a2f66d8a152ee088f9a81d561": {
    "content": "9.模拟数据调制为模拟信号 为了实现传输的有效性，可能需要较高的频率。这种调制方式还可使用频分复用 (FDM) 技 术，充分利用带宽资源。电话机和本地局交换机采用模拟信号传输模拟数据的编码方式。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2193c45a2f66d8a152ee088f9a81d561"
  },
  "doc-4c7203a984d35ac46171bd77288ec178": {
    "content": "13.IP 地址有以下重要特点： 1)每个IP 地址都由网络号和主机号两部分组成，因此IP地址是一种分等级的地址结构。分 等级的好处是：①IP地址管理机构在分配 IP 地址时只分配网络号，而主机号则由得到该 网络的单位自行分配，方便了 IP 地址的管理；②路由器仅根据目的主机所连接的网络号 来转发分组(而不考虑目标主机号),从而减小了路由表所占的存储空间。 2)IP 地址是标志一台主机(或路由器)和一条链路的接口。当一台主机同时连接到两个网 络时，该主机就必须同时具有两个相应的IP 地址，其网络号必须是不同的。因此路由器 至少应具有两个或两个以上的IP 地址，每个端口都有一个不同网络号的 IP 地址。 3)用转发器或桥接器(网桥等)连接的若干 LAN 仍然是同一个网络(同一个广播域),因 此该LAN 中所有主机的IP 地址的网络号必须相同，但主机号必须不同。 4 )在IP 地址中，所有分配到网络号的网络(无论是LAN 还是 WAN) 都是平等的。 5)在同一个局域网上的主机或路由器接口的IP 地址中的网络号必须是相同的。 近年来，因为广泛使用无分类IP 地址进行路由选择，这种传统分类的IP 地址已成为历史。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4c7203a984d35ac46171bd77288ec178"
  },
  "doc-ef8a9f4c0c5c999299e0206e5631634d": {
    "content": "路由器的组成与功能 路由器是一种具有多个输入/输出端口的专用计算机，其任务是连接不同的网络(连接异构网 络)并完成分组转发。在多个逻辑网络(多个广播域)互连时必须使用路由器。 当源主机向目标主机发送数据报时，路由器先检查源主机与目标主机是否连接在同一个网络 上。若源主机和目标主机在同一个网络上，则直接交付而无须通过路由器。若源主机和目标主机 不在同一个网络上，则路由器按照转发表(由路由表得出)指出的路由将分组转发给下一个路由 器，这称为间接交付。可见，在同一个网络中传递数据无须路由器的参与，而跨网络通信必须通 过路由器进行转发。例如，路由器可以连接不同的LAN, 连接不同的VLAN, 连接不同的WAN, 或者把LAN 和 WAN 互连起来。路由器隔离了广播域。 从结构上看，路由器由路由选择和分组转发两部分构成，如图4.25所示。而从模型的角度看， 路由器是网络层设备，它实现了网络模型的下三层，即物理层、数据链路层和网络层。 路由选择部分也称控制部分，核心构件是路由选择处理机，其任务是根据所选定的路由选择 协议构造出路由表，同时经常或定期地和相邻路由器交换路由信息而不断更新和维护路由表。 分组转发部分由三部分组成：交换结构、一组输入端口和一组输出端口。 交换结构也称交换组织，其作用是根据转发表对分组进行处理，将某个输入端口进入的分组 从一个合适的输出端口转发出去。交换结构本身就是一个“在路由器中的网络”。 路由器的端口中都有物理层、数据链路层和网络层的处理模块。输入端口在物理层接收比特 流，在数据链路层提取出帧，剥去帧的首部和尾部后，分组就被送入网络层的处理模块。输出端 口执行相反的操作。端口在网络层的处理模块中都设有一个缓冲队列，用来暂存等待处理或已处 理完毕待发送的分组，还可用来进行必要的差错检测。若分组处理的速率赶不上分组进入队列的 速率，就会使后面进入队列的分组因缓冲区满而只能被丢弃。需要说明的是，路由器的端口一般 都具有输入和输出的功能。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ef8a9f4c0c5c999299e0206e5631634d"
  },
  "doc-38ae3431155a02f16cd5bc37c2fc48e5": {
    "content": "38.边际网关协议（BGP） 边界网关协议 (Border Gateway Protocol,BGP) 是不同自治系统的路由器之间交换路由信息 的协议，是一种外部网关协议。BGP 常用于互联网的网关之间。而 RIP 和 OSPF 都只能在一个 AS 内工作，若没有BGP, 则全世界数以万计的AS 都是一个个没有联系的孤岛。 内部网关协议主要是设法使分组在一个 AS 中尽可能有效地从源站传送到目的站。在一个AS 内部也不需要考虑其他方面的策略。然而BGP 使用的环境却不同，主要原因如下： 1)互联网的规模太大，使得 AS 之间路由选择非常困难，每个主干网路由器表中的项目数都 非常庞大。对于AS 之间的路由选择，要寻找最佳路由是很不现实的。 2)AS 之间的路由选择必须考虑政治、安全或经济等有关因素。 BGP 只能是力求寻找一条能够到达目的网络且比较好的路由(不能兜圈子),而并非要寻找一条最佳路由。BGP 采用了路径向量路由选择协议，它与距离向量协议(如RIP) 和链路状态协议 ( 如OSPF)都有很大的区别。BGP 是应用层协议，它是基于 TCP 的。 BGP-4 共使用四种报文： Open (打开)报文 。用来与相邻的另一个BGP 对等方建立关系，使通信初始化。 Update (更新)报文 。用来通知某一路由的信息，以及列出要撤销的多条路由。 Keepalive (保活)报文。 用来周期性地证实邻站的连通性。 Notification (通知)报文 。用来发送检测到的差错。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-38ae3431155a02f16cd5bc37c2fc48e5"
  },
  "doc-d26e454e0cafa7054b8b83a7872f944d": {
    "content": "端口的作用 端口能让应用层的各种进程将其数据通过端口向下交付给传输层，以及让传输层知道应当将 其报文段中的数据向上通过端口交付给应用层相应的进程。端口在传输层的作用类似于IP 地址在 网络层的作用，只不过IP 地址标识的是主机，而端口标识的是主机中的应用进程。 数据链路层的服务访问点为帧的“类型”字段，网络层的服务访问点为IP 数据报的“协议” 字段，传输层的服务访问点为“端口号”字段 ，应用层的服务访问点为“用户界面”。 在协议栈层间的抽象的协议端口是软件端口，它与路由器或交换机上的硬件端口是完全不同 的概念。硬件端口是不同硬件设备进行交互的接口，而软件端口是应用层的各种协议进程与传输 实体进行层间交互的一种地址。传输层使用的是软件端口。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-d26e454e0cafa7054b8b83a7872f944d"
  },
  "doc-7e83948c6bd846ef184f0946894f3d3d": {
    "content": "POP协议和IMAP协议 邮局协议 (Post Office Protocol,POP) 是一个非常简单但功能有限的邮件读取协议，现在使 用的版本是POP3 。POP 也采用客户/服务器模式，在传输层使用TCP, 端口号为110。 接收方的用户代理必须运行 POP 客户程序，而接收方的邮件服务器中则运行POP 服务器程 序。POP 有两种工作方式：“下载并保留”和“下载并删除”。在“下载并保留”方式下，用户从 邮件服务器上读取邮件后，邮件依然会保存在邮件服务器上，用户可再次从服务器上读取该邮件； 而使用“下载并删除”方式时，邮件一旦被读取，就被从邮件服务器上删除。 另一个邮件读取协议是因特网报文存取协议(IMAP), 它 比 POP 复杂得多，IMAP 为用户提 供了创建文件夹、在不同文件夹之间移动邮件及在远程文件夹中查询邮件等联机命令，为此IMAP 服务器维护了会话用户的状态信息。IMAP 的另一特性是允许用户代理只获取报文的某些部分，例如可以只读取一个报文的首部，或多部分MIME 报文的一部分。这非常适用于低带宽的情况，用户可能并不想取回邮箱中的所有邮件，尤其是包含很多音频或视频的大邮件。 此外，随着万维网的流行，目前出现了很多基于万维网的电子邮件，如Hotmail 、Gmail 等。 这种电子邮件的特点是，用户浏览器与 Hotmail 或 Gmail 的邮件服务器之间的邮件发送或接收使 用的是HTTP, 而仅在不同邮件服务器之间传送邮件时才使用SMTP。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-7e83948c6bd846ef184f0946894f3d3d"
  },
  "doc-fe29004a486eaaf37b6bdca0ac55e4a0": {
    "content": "万维网WWW的概念 万维网 (World Wide Web,WWW) 是一个分布式、联机式的信息存储空间，在这个空间中一样有用的事物称为一样资源，并由一个全域统一资源定位符 (URL) 标识。这些资源通过超文 本传输协议 ( HTTP) 传送给使用者，而后者通过单击链接来获取资源。 万维网使用链接的方法能非常方便地从因特网上的一个站点访问另一个站点，从而主动地按 需获取丰富的信息。超文本标记语言使得万维网页面的设计者很方便地用一个超链接从本页面的某处链接到因特网上的任何一个页面，并能在自己的计算机屏幕上显示这些页面。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-fe29004a486eaaf37b6bdca0ac55e4a0"
  },
  "doc-666a4563032265befd1f7a3d948c8021": {
    "content": "4.报文交换 数据交换的单位是报文，用户数据加上源地址、目的地址等信息后，后封装成报 文(Message)。 报文交换采用存储转发技术，整个报文先传送到相邻的节点，全部存储后查找转发表，转发到下 一个节点，如此重复，直至到达目的节点。每个报文都可单独选择到达目的端的路径。 报文交换技术的优点： 1)无建立连接时延。通信前无须建立连接，没有建立连接时延，用户可随时发送报文。 2)灵活分配线路。交换节点存储整个报文后，选择 一条合适的空闲线路，转发报文。若某 条传输路径发生故障，则可重新选择另一条路径传输数据。 3)线路利用率高。 报文在一段链路上传送时才占用这段链路的通信资源。 4)支持差错控制。 交换节点可对缓存下来的报文进行差错检验。 报文交换技术的缺点： 1)转发时延高。 交换节点要将报文整体接收完后，才能查找转发表转发到下一个节点。 2)缓存开销大。报文的大小没有限制，这就要求交换节点拥有较大的缓存空间。 3)错误处理低效。报文较长时，发生错误的概率相对更大，重传整个报文的代价也很大。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-666a4563032265befd1f7a3d948c8021"
  },
  "doc-a16eed83e89a604b1c6a3566a3048bc8": {
    "content": "11.IPv4地址 IP 地址是给连接到互联网上的每台主机(或路由器)的每个接口，分配的一个在全球范围内 唯一的32位标识符。IP 地址由互联网名字和数字分配机构ICANN 进行分配。为方便书写和记忆， 常把32位IP 地址分成4段，每段8位，用等效的十进制数表示，并在每段数字之间加一个小数点，即一个IP 地址用4段十进制数表示，称为点分十进制记法。 无论哪类IP 地址，都由网络号和主机号两部分组成。即IP 地址：:={<网络号>,<主机号>}。 其中网络号标志主机(或路由器)所连接到的网络。 一个网络号在整个互联网范围内必须是唯一的。主机号标志该主机(或路由器)。 一个主机号在它前面的网络号所指明的网络范围内必须是唯一的。由此可见，一个 IP地址在整个互联网范围内是唯一的。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a16eed83e89a604b1c6a3566a3048bc8"
  },
  "doc-53459c650e6a12b5e3b714838b4cbf03": {
    "content": "5.分组交换 分组交换也采用存储转发技术，但解决了报文交换中报文过长的问题。若报文太长，则对交 换节点的缓存容量就有很大的需求，在错误处理方面也比较低效。源主机在发送之前，先把较长 的报文划分成若干较小的等长数据段，在每个数据段前面添加一些由必要控制信息(如源地址、 目的地址和编号信息等)组成的首部，构成分组 (Packet), 源主机将分组发送到分组交换网中，分组交换网中的分组交换机收到一个分组后，先将其缓 存，然后从其首部中提取目的地址，据此查找自己的转发表，再后将分组转发给下一个分组交换 机。经过多个分组交换机的存储转发后，分组最终到达目的主机。 分组交换除继承报文交换的诸多优点外，还有如下优点： 1)方便存储管理，存储转发开销小。因为分组的长度固定，所以相应缓冲区的大小也固定。 2)传输效率高。分组是逐个传输的，可以使后一个分组的存储操作与前一个分组的转发操作 并行，这种流水线方式减少了报文的传输时间。 3)减少了出错概率和重传代价。 因为分组较短，其出错概率必然减小，所以每次重发的数 据量也就大大减少，这样不仅提高了可靠性，还减小了传输时延。 分组交换技术的缺点： 1)存在存储转发时延。尽管分组交换比报文交换的传输时延小，但相对于电路交换仍存在 存储转发时延，且其节点交换机必须具有更强的处理能力。 2)需要传输额外的信息量。 每个小数据段都要加上控制信息以构成分组，这使得传送的信 息量增大了5%～10%,进而使得控制复杂，降低了通信效率。 3)当分组交换网采用数据报服务时，可能出现失序、丢失或重复分组的情况，分组到达目 的主机时，要对分组按编号进行排序等工作，而这些工作很麻烦。若采用虚电路服务， 则虽然没有失序问题，但有呼叫建立、数据传输和虚电路释放三个过程。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-53459c650e6a12b5e3b714838b4cbf03"
  },
  "doc-e645b2b9f70b19b6c5dfa6825f63a4a1": {
    "content": "超文本传输协议HTTP的执行过程 超文本传输协议 (HTTP) 定义了浏览器(万维网客户进程)怎样向万维网服务器请求万维 网文档，以及服务器怎样把文档传送给浏览器。从层次的角度看，HTTP是面向事务 (Transaction-oriented) 的应用层协议，它规定了在浏览器和服务器之间的请求和响应的格式与规则，是万维网上能够可靠地交换文件(包括文本、声音、图像等各种多媒体文件)的重要基础。 从协议执行过程来说，浏览器要访问 WWW 服务器时，首先要完成对 WwW 服务器的域名 解析。一旦获得了服务器的IP地址，浏览器就通过TCP 向服务器发送连接建立请求。 每个万维网站点都有一个服务器进程，它不断地监听 TCP 的端口80(默认),当监听到连接 请求后便与浏览器建立TCP 连接。然后，浏览器就向服务器发送请求获取某个Web 页面的HTTP 请求。服务器收到请求后，将构建所请求Web 页的必需信息，并通过HTTP 响应返回给浏览器。浏览器再将信息进行解释，然后将Web 页显示给用户。最后，TCP 连接释放。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e645b2b9f70b19b6c5dfa6825f63a4a1"
  },
  "doc-806b33bc8df5a5e63aed8f0efea8d788": {
    "content": "域名解析过程 域名解析是指把域名转化为IP 地址的过程。当客户端需要域名解析时，通过本机的DNS 客 户端构造一个DNS 请求报文，以UDP 数据报方式发往本地域名服务器。 域名解析有两种方式：递归查询和迭代查询。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-806b33bc8df5a5e63aed8f0efea8d788"
  },
  "doc-fffe15e88f2df301f1faa7096f4391b0": {
    "content": "9.IPv4分组的格式 一个 IP 分组(或称IP 数据报)由首部和数据部分组成。首部前一部分的长度固定，共20B, 是所有IP 分组必须具有的。在首部固定部分的后面是一些可选字段，其长度可变，用来提供错误检测及安全等机制。 IPv4 首部的部分重要字段含义如下： 1)版本。占4位。指IP的版本，IPv4 数据报中该字段的值是4。 2)首部长度。占4位。以4B 为单位，最大可表示的首部长度为60B(15×4B)。最常用的首部长度是20B(5×4B), 该字段的值是5,此时不使用任何可选字段。 3)总长度。16位，指首部和数据之和的长度，单位为字节，因此数据报的最大长度为 2¹⁶-1=65535B。 以太网帧的最大传送单元(MTU) 为1500B, 因此当一个IP 数据报封装成 帧时，数据报的总长度(首部加数据)一定不能超过下面的数据链路层的MTU值。 4 ) 标 识。占16位。它是一个计数器，每产生一个数据报就加1,并赋值给标识字段。但它 并不是“序号”(因为IP 是无连接服务)。当一个数据报的长度超过网络MT时，必须分片，此时每个数据报片都复制一次标识号，以便能正确地重装成原来的数据报。 5)标志 (Flag)。 占3位。标志字段的最低位为MF,MF=1表示后面还有分片，MF=0 表示最后一个分片。标志字段中间的一位是DF, 只有当 DF=0 时才允许分片。 6)片偏移。占13位。它指出较长的数据报在分片后，某片在原数据报中的相对位置，片偏移以8B 为偏移单位。除最后一个分片外，每个分片的长度一定是8B 的整数倍。 7)生存时间(TT L) 。占8位。数据报在网络中可通过的路由器数的最大值，标识数据报在网络中的寿命，以确保数据报不会永远在网络中循环。路由器在转发数据报前，先将TTL减1。若TTL 被减为0,则该数据报必须丢弃。 8)协议。占8位。指出此数据报携带的数据使用何种协议，即数据报的数据部分应上交给哪个协议进行处理，如 TCP 、UDP 等。其中值为6表示TCP, 值为17表示UDP。 9)首部检验和。占16位。它只检验数据报的首部，不包括数据部分，不检验数据部分可减少计算的工作量。数据报每经过一个路由器，其首部中的某些字段(如生存时间、总长 度、标志、片偏移、源/目的地址)都可能发生变化，因此路由器都要重新计算首部检验 和。首部检验和的计算方法与UDP 和TCP 的检验和的计算方法相同，具体见5.2.2节。 10)源地址字段。占4B,标识发送方的IP 地址。 11)目的地址字段。占4B,标识接收方的IP 地址。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-fffe15e88f2df301f1faa7096f4391b0"
  },
  "doc-39bab698a0c52ee767bbb6ac6cf9fbdd": {
    "content": "10.IP数据报分片 一个链路层数据帧能承载的最大数据量称为最大传送单元(MTU) 。因 为IP 数据报被封装在 链路层的帧中，因此链路层的 MTU 严格地限制了IP 数据报的长度，而且在 IP 数据报的源与目 的地路径上的各段链路可能使用不同的链路层协议，有不同的 MTU 。 例如，以太网的 MTU 为1500B, 而许多广域网的MTU不超过576B 。当 IP数据报的总长度大于链路MTU 时，就需要将 IP 数据报中的数据分装在多个较小的IP数据报中，这些较小的数据报称为片。 命题追踪 分片时会影响首部中的哪些字段(2011) 片在目的地的网络层被重新组装。目的主机使用 IP 首部中的标识、标志和片偏移字段来完 成对片的重组。创建一个IP 数据报时，源主机为该数据报加上一个标识号。当一个路由器需要将 一个数据报分片时，形成的每个数据报(片)都具有原始数据报的标识号。当目的主机收到来自 同一发送主机的一批数据报时，它可通过检查数据报的标识号来确定哪些数据报属于同一个原始 数据报的片。IP 首部中的标志位占3位，但只有后2位有意义，分别是DF(Don't Fragment) 位和MF(More Fragment) 位。只有当 DF=0时，该IP数据报才可被分片。 MF 则用来告知目的主 机该IP 数据报是否为原始数据报的最后一个片。当MF=1时，表示相应的原始数据报还有后续 的片；当MF=0时，表示该数据报是相应原始数据报的最后一个片。目的主机在对片进行重组时，使用片偏移字段来确定片应放在原始IP 数据报的哪个位置。 IP 分片涉及一定的计算。例如， 一个长4000B 的 IP 数据报(首部20B, 数据部分3980B) 到达一个路由器，需要转发到一条MTU 为1500B 的链路上。这意味着原始数据报中的3980B 数 据必须分配到3个独立的片中(每片也是一个IP 数据报),每片的数据部分依次为1480B 、1480B 和1020B。假定原始数据报的标识号为777,则分成的3片如图4.6所示。可见，因为偏移值的单 位是8B, 所以除最后一个片外，其他所有片中的数据部分都为8B 的倍数。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-39bab698a0c52ee767bbb6ac6cf9fbdd"
  },
  "doc-43c572bd02bd404b10bd153d88d8fbb9": {
    "content": "14.网络地址转换 (NAT) 网络地址转换 (Network Address Translation,NAT) 是指通过将专用网络地址(如Intranet) 转换为公用地址(如Intermet), 从而对外隐藏内部管理的IP 地址。它使得整个专用网只需要一个 全球 IP 地址就可与互联网连通，因为专用网本地IP 地址是可重用的，所以NAT 大大节省了 IP 地址的消耗。同时，它隐藏了内部网络结构，从而降低了内部网络受到攻击的风险。 此外，为了网络安全，划出了三个私有 IP 地址块。私有IP 地址只用于LAN, 不 用 于WAN 连接(因此私有IP 地址不能直接用于互联网，必须通过网关利用NAT 将私有IP 地址转换为互联 网中合法的全球 IP 地址后，才能出现在互联网上),并且允许私有IP 地址被LAN 重复使用。这 有效地解决了IP 地址不足的问题。这三个私有IP 地址块如下： 1) 10.0.0.0/8,即10.0.0.0～10.255.255.255,相当于1个A 类网络。 2) 172.16.0 .0/12,即 172.16.0.0～172.31.255.255,相当于16个连续的B 类网络。 3) 192.168.0.0/16,即192.168.0.0～192.168.255.255,相当于256个连续的C 类网络。 在互联网中的所有路由器，对目的地址是私有地址的数据报一律不进行转发。这种采用私有 IP 地址的互联网络称为专用互联网或本地互联网。私有IP 地址也称可重用地址。 使用NAT 时需要在专用网连接到互联网的路由器上安装NAT 软件，NAT 路由器至少有一个 有效的外部全球IP 地址。当使用本地地址的主机和外界通信时，NAT 路由器使用NAT 转换表进 行本地IP 地址和全球 IP 地址的转换。NAT 转换表中存放着{本地IP 地址：端口}到{全球IP 地址：端口}的映射。通过这种映射方式，可让多个私有IP 地址映射到一个全球IP 地址。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-43c572bd02bd404b10bd153d88d8fbb9"
  },
  "doc-0a3e9fdd2bae4c043ac4479deaf96aaf": {
    "content": "6.SDN 的基本概念 网络层的主要任务是转发和路由选择。可以将网络层抽象地划分为数据平面(也称转发层面) 和控制平面，转发是数据平面实现的功能，而路由选择是控制平面实现的功能。 软件定义网络(Software Defined Network,SDN) 是近年流行的一种创新网络架构，它采用 集中式的控制平面和分布式的数据平面，两个平面相互分离，控制平面利用控制-数据接口对数 据平面上的路由器进行集中式控制，方便软件来控制网络。传统网络中的路由器既有转发表，又 有路由选择软件，即既有数据平面，又有控制平面。但是在图4.4所示的SDN 结构中，路由器都 变得简单了，它的路由选择软件都不需要了，因此路由器之间不再相互交换路由信息。在网络的 控制平面有一个逻辑上的远程控制器(可由多个服务器组成)。远程控制器掌握各主机和整个网 络的状态，为每个分组计算出最佳路由，通过Openflow 协议(或其他途径)将转发表(在SDN 中称为流表)下发给路由器。路由器的工作很单纯，即收到分组、查找转发表、转发分组。 这样，网络又变成集中控制的，而本来互联网是分布式的。SDN并非要把整个互联网都改造成如图4.4所示的集中控制模式，这是不现实的。然而，在某些具体条件下，特别是像一些大型 的数据中心之间的广域网，使用SDN 模式来建造，就可使网络的运行效率更高。 SDN 的可编程性通过为开发者提供强大的编程接口，使得网络具有很好的编程性。对上层应 用的开发者，SDN 提供的编程接口称为北向接口，北向接口提供了一系列丰富的API, 开发者可 以在此基础上设计自己的应用，而不必关心底层的硬件细节。SDN 控制器和转发设备建立双向会 话的接口称为南向接口，通过不同的南向接口协议(如Openflow),SDN 控制器就可兼容不同的 硬件设备，同时可在设备中实现上层应用的逻辑。SDN 控制器集群内部控制器之间的通信接口称 为东西向接口，用于增强整个控制平面的可靠性和可拓展性。 SDN 的优点：①全局集中式控制和分布式高速转发，既利于控制平面的全局优化，又利于高 性能的网络转发。②灵活可编程与性能的平衡，控制和转发功能分离后，使得网络可以由专有的 自动化工具以编程方式配置。③降低成本，控制和数据平面分离后，尤其是在使用开放的接口协 议后，就实现了网络设备的制造与功能软件的开发相分离，从而有效降低了成本。 SDN 的问题：①安全风险，集中管理容易受攻击，若崩溃，则整个网络会受到影响。②瓶颈问 题，原本分布式的控制平面集中化后，随着网络规模扩大，控制器可能成为网络性能的瓶颈。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0a3e9fdd2bae4c043ac4479deaf96aaf"
  },
  "doc-4e9b5aafd28be7a43063b73b9136ed62": {
    "content": "13.流量控制与滑动窗口机制 流量控制是指由接收方控制发送方的发送速率，使接收方有足够的缓冲空间来接收每个帧。 常见的流量控制方法有两种：停止-等待协议和滑动窗口协议。数据链路层和传输层均有流量控 制的功能，它们都用到了滑动窗口协议，但也有所区别，主要体现如下： 1)数据链路层控制的是相邻节点之间的流量，而传输层控制的是端到端的流量。 2)数据链路层的控制手段是接收方收不下时就不返回确认。传输层的控制手段是接收方通 过确认报文段中的窗口值来调整发送方的发送窗口。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4e9b5aafd28be7a43063b73b9136ed62"
  },
  "doc-817204852828c5f6838e063ca6b23668": {
    "content": "23.CSMA 协议 ALOHA 网络发生冲突的概率很大。若每个站点在发送前都先监听公用信道，发现信道空闲 后再发送，则会大大降低冲突的可能性，从而提高信道的利用率，载波监听多路访问(Carrier Sense Multiple Access,CSMA) 协议依据的正是这一思想。CSMA 协议是在ALOHA 协议基础上提出的 一种改进协议，它与 ALOHA 协议的主要区别是多了一个载波监听装置。 根据监听方式和监听到信道忙后的处理方式的不同，CSMA 协议分为三种。 (1)1- 坚持CSMA 1-坚持CSMA 的基本思想是：当站点要发送数据时，首先监听信道；若信道空闲，则立即发 送数据；若信道忙，则继续监听直至信道空闲。“坚持”的含义是监听到信道忙时，继续坚持监 听信道；“1”的含义是监听到信道空闲时，立即发送帧的概率为1。 (2)非坚持CSMA 非坚持CSMA 的基本思想是：当站点要发送数据时，首先监听信道；若信道空闲，则立即发 送数据；若信道忙，则放弃监听，等待一个随机的时间后，再重新监听。 非坚持CSMA 协议在监听到信道忙时就放弃监听，因此降低了多个站点等待信道空闲后同时 发送数据导致冲突的概率，但也增加了数据在网络中的平均时延。 (3)p- 坚持CSMA p- 坚持CSMA 只适用于时分信道，其基本思想是：当站点要发送数据时，首先监听信道；若 信道忙，则持续监听(等到下一个时隙再监听),直至信道空闲；若信道空闲，则以概率 p 发送 数据，以概率1-p 推迟到下一个时隙再继续监听；直到数据发送成功。 p- 坚持 CSMA 检测到信道空闲后，以概率p 发送数据，以概率1-p 推迟到下一个时隙继续 监听，目的是降低1-坚持 CSMA 中多个站点检测到信道空闲时同时发送帧的冲突概率；采用坚持“监听”的目的是，克服非坚持 CSMA 中因随机等待造成的延迟时间较长的缺点。因此， p- 坚持 CSMA 协议是非坚持CSMA 协议和1-坚持CSMA 协议的折中。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-817204852828c5f6838e063ca6b23668"
  },
  "doc-cc04a362d157fd61bc7e5b5f37baffd0": {
    "content": "14.物理层接口的特性 物理层考虑的是如何在连接各种计算机的传输介质上传输比特流，而不指具体的传输介 质。网络中的硬件设备和传输介质的种类繁多，通信方式也各不相同。物理层应尽可能屏蔽 这些差异，让数据链路层感觉不到这些差异，使其只需考虑如何实现本层的协议和服务。 物理层的主要任务是确定与传输介质的接口有关的一些特性： 1)机械特性。 指明接口所用接线器的形状和尺寸、引脚数量和排列、固定和锁定装置等。 2)电气特性。 指明在接口电缆的各条线上的电压范围、传输速率和距离限制等。 3)功能特性。 指明某条线上出现的某一电平的电压的意义，以及每条线的功能。 命题追踪 4)过程特性，也称规程特性。 指明不同功能的各种可能事件的出现顺序。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-cc04a362d157fd61bc7e5b5f37baffd0"
  },
  "doc-59f3d7caae3d5c45d5c5a623b9526d26": {
    "content": "层次域名空间 因特网采用层次树状结构的命名方法。采用这种命名方法，任何一个连接到因特网的主机或 路由器，都有一个唯一的层次结构名称，即域名 (Domain Name)。域 (Domain) 是名字空间中一个可被管理的划分。域可以划分为子域，而子域还可以继续划分为子域的子域，这样就形成了 顶级域、二级域、三级域等。每个域名都由标号序列组成，而各标号之间用点(“.”)隔开。 关于域名中的标号有以下几点需要注意： 1)标号中的英文不区分大小写。 2)标号中除连字符(-)外不能使用其他的标点符号。 3)每个标号不超过63个字符，多标号组成的完整域名最长不超过255个字符。 4)级别最低的域名写在最左边，级别最高的顶级域名写在最右边。 顶级域名 (Top Level Domain,TLD) 分为如下三大类： 1)国家(地区)顶级域名 (nTLD)。 国家和某些地区的域名，如“.cn”表示中国，“. 表 示美国，“.uk” 表示英国。 2)通用顶级域名 (gTLD)。 常见的有“.com”(公司)、“net”(网络服务机构)、“org”( 非 营利性组织)、“.edu” (教育机构)、和 “gov” (国家或政府部门)等。 3)基础结构域名 (arpa)。用于反向域名解析，即IP 地址反向解析为域名。 在域名系统中，各级域名由其上一级的域名管理机构管理，顶级域名由因特网名称与数字地 址分配机构 (ICANN) 管理。国家顶级域名下注册的二级域名均由该国家自行确定，每个组织都 可以将它的域再分成一定数量的子域，并将这些子域委托给其他组织去管理。例如，管理cn 域的 中国将 edu.cn 子域授权给中国教育和科研计算机网 (CERNET)来管理。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-59f3d7caae3d5c45d5c5a623b9526d26"
  },
  "doc-ece7afbed8b24a2e1404a2bc3714f1b1": {
    "content": "37.IEEE 802.11无线局域网 1. 无线局域网的组成 无线局域网可分为两大类：有固定基础设施的无线局域网和无固定基础设施的移动自组织网 络。所谓 “固定基础设施”,是指预先建立的、能覆盖一定地理范围的固定基站。 (1)有固定基础设施无线局域网 对于有固定基础设施的无线局域网，IEEE 制定了无线局域网的802.11系列协议标准，包括 802.1la/b/g/n 等。802.11 标准使用星形拓扑，其中心称为接入点 (Access Point,AP), 在 MAC 层使用CSMA/CA 协议。使用802.11系列协议的局域网也称Wi-Fi。 802.11标准规定无线局域网的最小构件是基本服务集 (Basic Service Set,BSS)。一个基本服 务集包括一个接入点和若干移动站。各站在本BSS 内的通信，或与本 BSS 外部站的通信，都必 须通过本 BSS 的 AP 。上面提到的AP 就是基本服务集中的基站 (base station)。安装AP 时，必 须为其分配一个不超过32字节的服务集标识符 (Service Set IDentifier,SSID) 和一个信道。SSID 是指使用该AP 的无线局域网的名称。基本服务集覆盖的地理范围称为基本服务区(Basic Service Area,BSA), 无线局域网的基本服务区的直径一般不超过100m。 (2)无固定基础设施移动自组织网络 另一种无线局域网是无固定基础设施的无线局域网，也称自组网络 (ad hoc network)。自 组 网络没有上述基本服务集中的 AP, 而有由一些平等状态的移动站相互通信组成的临时网络(见 图3.27)。各节点之间地位平等，中间节点都为转发节点，因此都具有路由器的功能。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ece7afbed8b24a2e1404a2bc3714f1b1"
  },
  "doc-5f44fedcabe9f4f1dd232c71545e3bb2": {
    "content": "3.计算机网络的功能 计算机网络的功能很多，现今的很多应用都与网络有关。主要有以下五大功能。 1. 数据通信 数据通信是计算机网络最基本和最重要的功能，用来实现联网计算机之间各种信息的传输。 例如，文件传输、电子邮件等应用，离开了计算机网络就无法实现。 2. 资源共享 资源共享既可是软件共享、数据共享，又可是硬件共享。它使计算机网络中的资源互通有无、 分工协作，从而极大地提高了硬件资源、软件资源和数据资源的利用率。 3. 分布式处理 当计算机网络中的某个计算机系统负荷过重时，可将其处理的某个复杂任务分配给网络中的 其他计算机系统，从而利用空闲计算机资源来提高整个系统的利用率。 4. 提高可靠性 计算机网络中的各台计算机可以通过网络互为替代机。 5. 负载均衡 将工作任务均衡地分配给计算机网络中的各台计算机。 除了以上几大主要功能，计算机网络还可实现电子化办公与服务、远程教育、娱乐等功能， 满足了社会的需求，方便了人们的学习、工作和生活，具有巨大的经济效益。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5f44fedcabe9f4f1dd232c71545e3bb2"
  },
  "doc-fbdebdfd7c256f8f71cf9ad7e0cef3cf": {
    "content": "TCP的确认机制 TCP 首部的确认号是期望收到对方的下一个报文段的数据的第一个字节的序号。在图5.8中， 若接收方B 已收到第一个报文段的数据，此时B 希望收到的下一个报文段的数据是从第3个字节 开始的，则B 发送给A 的报文段中的确认号字段应为3。发送方缓存区会继续存储那些已发送但 未收到确认的报文段，以便在需要时重传。 TCP 默认使用累积确认，即 TCP 只确认数据流中至第一个丢失字节为止的字节，这样可以 减小传输开销。接收方可在合适的时候发送确认，也可在自己有数据要发送时将确认信息顺便捎 带上(捎带确认)。例如，在图5.8中，接收方B 收到了A 发送的包含字节0~2及字节6~7的 报文段。由于某种原因，B 还未收到字节3~5的报文段，此时B 仍在等待字节3(和其后面的字 节),因此B 到 A 的下一个报文段将确认号字段置为3。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-fbdebdfd7c256f8f71cf9ad7e0cef3cf"
  },
  "doc-59b0cf1eb727058c846603b0f2b7811b": {
    "content": "23.动态主机配置协议 DHCP 动态主机配置协议 (Dynamic Host Configuration Protocol,DHCP) 常用于给主机动态地分配 IP 地址，它提供了即插即用的联网机制，这种机制允许一台计算机加入新的网络和自动获取 IP 地址而不用手工参与。DHCP是应用层协议，它是基于 UDP 的。 DHCP 使用客户/服务器模型。其工作原理：需要IP 地址的主机在启动时就向DHCP 服务器 广播发送发现报文，这时该主机就成为DHCP 客户。本地网络上的所有主机都能收到这个广播报文，但只有DHCP 服务器才能回答该广播报文。DHCP 服务器先在其数据库中查找该计算机的配置信息。若找到，则返回找到的信息；若找不到，则从服务器的IP 地址池中取一个地址分配给该 主机。DHCP服务器的回答报文称为提供报文，包含提供的 IP 地址等配置信息。 DHCP 服务器和 DHCP 客户的交换过程如下： 1)DHCP客户广播 “DHCP发现”消息，试图找到网络中的DHCP服务器，以便从 DHCP 服务器获得一个IP 地址。源地址为0.0.0.0,目的地址为255.255.255.255。 2)DHCP服务器收到“DHCP发现”消息后，广播“DHCP提供”消息，其中包括提供给 DHCP 客户机的IP 地址。源地址为 DHCP 服务器地址，目的地址为255.255.255.255。 3)DHCP客户收到 “DHCP 提供”消息，若接受该IP 地址，则广播 “DHCP 请求”消息向 DHCP 服务器请求提供IP 地址。源地址为0.0.0.0,目的地址为255.255.255.255。 4)DHCP服务器广播 “DHCP 确认”消息，将IP 地址分配给DHCP 客户。源地址为 DHCP 服务器地址，目的地址为255.255.255.255。 DHCP 服务器分配给 DHCP 客户的IP 地址是临时的，因此 DHCP 客户只能在一段有限的时 间内使用这个分配到的 IP 地址。DHCP 称这段时间为租用期。租用期的数值应由 DHCP 服务器 自己决定，DHCP 客户也可在自己发送的报文中提出对租用期的要求。DHCP 客户可随时提前终 止服务器提供的租用期，这时只需向DHCP 服务器发送释放报文。 DHCP 客户和服务器端需要通过广播方式来进行交互，原因是在DHCP 执行初期，客户机不 知道服务器端的IP 地址，而在执行中间，客户机并未被分配IP 地址，从而导致两者之间的通信 必须采用广播的方式。采用UDP 而不采用TCP 的原因也很明显：TCP 需要建立连接，若连对方 的 IP 地址都不知道，则更不可能通过双方的套接字建立连接。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-59b0cf1eb727058c846603b0f2b7811b"
  },
  "doc-8fef7be4e67739093a4cec71feb9f0e9": {
    "content": "万维网在传输层所使用的协议 万维网的内核部分是由三个标准构成的： 1)统一资源定位符 (U RL) 。负责标识万维网上的各种文档，并使每个文档在整个万维网的 范围内具有唯一的标识符URL。 2)超文本传输协议 (HTT P) 。一个应用层协议，它使用 TCP 连接进行可靠的传输，HTTP 是万维网客户程序和服务器程序之间交互所必须严格遵守的协议。 3)超文本标记语言 (HTM L) 。一种文档结构的标记语言，它使用一些约定的标记对页面上 的各种信息(包括文字、声音、图像、视频等)、格式进行描述。 URL 是对可以从因特网上得到的资源的位置和访问方法的一种简洁表示。URL 相当于一个 文件名在网络范围的扩展。URL 的一般形式是： <协议>://<主机>:<端口>/<路径>。 <协议>指用什么协议来获取万维网文档，常见的协议有 http、ftp 等 ；<主机>是存放资源的 主机在因特网中的域名或IP 地址；<端口>和<路径>有时可省略。在URL 中不区分大小写。 万维网以客户/服务器模式工作。浏览器是在用户主机上的万维网客户程序，而万维网文档所 驻留的主机则运行服务器程序，这台主机称为万维网服务器。客户程序向服务器程序发出请求， 服务器程序向客户程序送回客户所要的万维网文档。工作流程如下： Web用户使用浏览器(指定URL) 与Web 服务器建立连接，并发送浏览请求。 Web服务器把URL 转换为文件路径，并返回信息给 Web 浏览器。 3)通信完成，关闭连接。 万维网是无数个网络站点和网页的集合，它们在一起构成了因特网最主要的部分(因特网也 包括电子邮件、Usenet 和新闻组)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8fef7be4e67739093a4cec71feb9f0e9"
  },
  "doc-611e7621716a5345608712ffe1e2097d": {
    "content": "6.计算机网络的分类 1. 按分布范围分类 1)广域网 (WAN) 。 广域网的任务是提供长距离通信，运送主机所发送的数据，其覆盖范 围通常是直径为几十米到几千千米的区域。广域网是互联网的核心部分。连接广域网的 各节点交换机的链路一般都是高速链路，具有较大的通信容量。 2)城域网 (MA N) 。 城域网的覆盖范围可以跨越几个街区甚至整个城市，覆盖区域的直径 为5～50km。城域网大多采用以太网技术，因此有时也常并入局域网的范围讨论。 3)局域网(LA N) 。局域网一般用主机通过高速线路相连，覆盖范围较小，通常是直径为几 十到几千米的区域。传统上，局域网使用广播技术，而广域网使用交换技术。 4)个人区域网 (PAN) 。 个人区域网是指在个人工作的地方将消费电子设备(如平板电脑、 智能手机等)用无线技术连接起来的网络，也称无线个人区域网 (WPAN)。 2. 按传输技术分类 1)广播式网络。所有联网计算机都共享一个公共通信信道。当一台计算机利用共享通信信 道发送报文分组时，所有其他计算机都会“收听”到这个分组。“收听”到该分组的计 算机将通过检查目的地址来决定是否接收该分组。局域网基本上都采用广播式通信技术， 广域网中的无线、卫星通信网络也采用广播式通信技术。 2)点对点网络。 每条物理线路连接一对计算机。若通信的两台主机之间没有直接连接的线 路，则它们之间的分组传输就要通过中间节点进行存储和转发，直至目的主机。 3. 按拓扑结构分类 网络拓扑结构是指由网中节点(路由器、主机等)与通信线路之间的几何关系表示的网络结 构，主要指通信子网的拓扑结构。按拓扑结构，网络可分为总线形、星形、环形和网状网络等， 如图1.5所示。星形、总线形和环形网络多用于局域网，网状网络多用于广域网。 1)总线形网络。用单根传输线把计算机连接起来。优点是建网容易、增/减节点方便、节省 线路。缺点是重负载时通信效率不高、总线任意一处对故障敏感。 2)星形网络。每个终端或计算机都以单独的线路与中央设备相连。中央设备一般是交换机 或路由器。优点是便于集中控制和管理。缺点是成本高、中央设备对故障敏感。 3)环形网络。所有计算机接口设备连接成一个环。环形网络最典型的例子是令牌环局域网。 环既可以是单环，又可以是双环，环中信号是单向传输的。 4)网状网络。一般情况下，每个节点至少有两条路径与其他节点相连，多用在广域网中。 其有规则型和非规则型两种。优点是可靠性高。缺点是控制复杂、线路成本高。 以上4种基本的网络拓扑结构可以互连为更复杂的网络。 4. 按使用者分类 1)公用网 (Public Network)。指电信公司出资建造的大型网络。“公用”的意思是指所有 愿意按电信公司的规定缴纳费用的人都可使用这种网络。 2)专用网(Private Network)。指某个单位为满足本单位特殊业务的需要而建造的网络。这 种网络不向本单位外的人提供服务，如铁路、电力、军队等部门的专用网。 5. 按传输介质分类 传输介质可分为有线和无线两大类，因此网络可分为有线网络和无线网络。有线网络又可分 为双绞线网络、同轴电缆网络等，而无线网络又可分为蓝牙、微波、无线电等类型。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-611e7621716a5345608712ffe1e2097d"
  },
  "doc-65be256e3317faf5641a3e4f4b015c9b": {
    "content": "3.速率、波特与带宽 速率是指数据传输速率，表示单位时间内传输的数据量，常有两种描述形式。 1)码元传输速率。又称波特率或调制速率，表示数字通信系统每秒传输的码元数，单位是波特 (Baud)。码元既可以是多进制的，也可以是二进制的，码元速率与进制无关。 2)信息传输速率。又称比特率，表示数字通信系统每秒传输的比特数，单位是比特/秒(b/s)。 波特和比特是两个不同的概念，但波特率与比特率在数量上又有一定的关系。若一个码元携带n 比 特的信息量，则波特率M Baud对应的比特率为Mn b/s。 在模拟信号系统中，带宽(又称频率带宽)用来表示某个信道所能传输信号的频率范围，即 最高频率与最低频率之差，单位是赫兹 (Hz) 。在计算机网络中，带宽用来表示网络的通信线路 所能传输数据的能力，即最高数据率，显然，此时带宽的单位不再是Hz, 而是 b/s。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-65be256e3317faf5641a3e4f4b015c9b"
  },
  "doc-beb6fdcac65d2c86cf000de99dc83381": {
    "content": "12.TCP/IP模型 TCP/IP模型从低到高依次为网络接口层(对应 OSI 参考模型的物理层和数据链路层)、网际层、传输层和应用层(对应OSI 参考模型的会话层、表示层和应用层)。 TCP/IP 因为得到广泛 应用而成为事实上的国际标准。 网络接口层的功能类似于OSI 参考模型的物理层和数据链路层，其作用是从主机或节点接收IP分组，并将它们发送到指定的物理网络上。但TCP/IP并未具体描述网络接口层的功能和协议，只是指出主机必须使用某种协议与网络连接，以便在其上传送IP 分组。具体的物理网络既可是各种类型的局域网，如以太网、令牌环网等，又可是诸如电话网、ATM 等公共数据网络。 网际层(主机- 主机)是TCP/IP体系结构的关键部分，功能上它与OSI 参考模型的网络层非 常相似。网际层将分组发往任何网络，并为其独立地选择合适的路由，但不保证各个分组有序地 到达，各个分组的有序和可靠交付由高层负责。网际层仅提供无连接不可靠的IP, 数据传输的单位是IP数据报。当前采用的IP 是第4版即IPv4,它的下一版本是IPv6。 传输层(应用-应用或进程-进程)的功能同样与OSI 参考模型中的传输层类似，即使得发送 端和目的端主机上的对等实体进行会话。传输层主要使用以下两种协议： 1)传输控制协议(Transmission Control Protocol,TCP)。它是面向连接的，传输数据之前必须先建立连接，能够提供可靠的交付。数据传输的单位是报文段。 2)用户数据报协议 (User Datagram Protocol,UDP)。它是无连接的，不保证提供可靠的交付只能提供“尽最大努力交付”。数据传输的单位是用户数据报。 应用层(用户-用户)包含所有的高层协议，如虚拟终端协议(Telnet)、文件传输协议(FTP)、域名解析服务 (DNS)、电子邮件协议 (SMTP) 和超文本传输协议(HTTP)。 IP 是互联网中的核心协议；TCP/IP 可为各式各样的应用提供服务(所谓 everything over IP),TCP/IP 还允许IP在由各种网络构成的互联网上运行(所谓 IP over everything)。因此，互联网才会发展到今天的规模。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-beb6fdcac65d2c86cf000de99dc83381"
  },
  "doc-ce1302477ab1c31403bdbb6a92d5ecee": {
    "content": "6.UDP 概述 UDP 仅在IP 层的数据报服务之上增加了复用、分用和差错检测的功能。若应用开发者选 择 UDP 而非 TCP, 则应用程序几乎直接与IP 打交道。为什么应用开发者宁愿在UDP 之上构 建应用，也不选择 TCP? 既然 TCP 提供可靠的服务，而UDP 不提供，则 TCP 总是首选吗?答案是否定的，因为有很多应用更适合用UDP, 主要因为UDP 具有如下优点： 1)UDP无须建立连接。因此 UDP 不会引入建立连接的时延。 2)无连接状态。 TCP 需要在端系统中维护连接状态。此连接状态包括接收和发送缓存、拥 塞控制参数和序号与确认号的参数。而UDP 既不维护连接状态，又不跟踪这些参数。因 此，当某些专用服务器使用UDP 时，一般都能支持更多的活动客户机。 3)UDP的首部开销小。TCP 有20B的首部开销，而UDP 仅有8B 的开销。 4)UDP没有拥塞控制，因此网络中的拥塞不会影响源主机的发送速率。某些实时应用要求 源主机以稳定的速率发送数据，能容忍一些数据的丢失，但不允许有太大的时延。 5)UDP支持一对一、一对多、多对一和多对多的交互通信。 UDP 常用于一次性传输较少数据的网络应用，如DNS、SNMP等，因为对于这些应用，若采用TCP, 则将为连接创建、维护和拆除带来不小的开销。UDP 也常用于多媒体应用(如IP电话、实时视频会议、流媒体等),显然，可靠数据传输对这些应用来说并不是最重要的，但 TCP的拥塞控制会导致数据出现较大的延迟，这是它们不可容忍的。 UDP 不保证可靠交付，但这并不意味着应用对数据的要求是不可靠的，所有维护可靠性的工 作可由用户在应用层来完成。应用开发者可根据应用的需求来灵活设计自己的可靠性机制。 UDP 是面向报文的。发送方UDP 对应用层交下来的报文，在添加首部后就向下交付给IP层， 一次发送一个报文，既不合并，又不拆分，而是保留这些报文的边界；接收方UDP 对 IP层交上来 UDP数据报，在去除首部后就原封不动地交付给上层应用进程，一次交付一个完整的报文。因此报文不可分割，是UDP 数据报处理的最小单位。因此，应用程序必须选择合适大小的报文， 若报文太长，则UDP 把它交给IP 层后，可能导致分片；若报文太短，则UDP 把它交给IP 层后， 会使IP 数据报的首部的相对长度太大，两者都会降低IP 层的效率。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ce1302477ab1c31403bdbb6a92d5ecee"
  },
  "doc-18bee586529138bada42c241645dd300": {
    "content": "IP多播地址 多播数据报的源地址是源主机的 IP 地址，目的地址是IP 多播地址。IP 多播地址就是 IPv4 中的D 类地址。D 类地址的前四位是1110,因此D 类地址范围是224.0.0.0~239.255.255.255。每 个D 类IP 地址标志一个多播组，一台主机可以随时加入或离开一个多播组。 多播数据报和一般的IP 数据报的区别是，前者使用D 类 IP 地址作为目的地址，并且首部中 的协议字段值是2,表明使用IGMP 。需要注意的是： 1)多播数据报也是“尽最大努力交付”,不提供可靠交付。 2)多播地址只能用于目的地址，而不能用于源地址。 3)对多播数据报不产生 ICMP 差错报文。 IP 多播可以分为两种：①只在本局域网上进行硬件多播；②在互联网的范围内进行多播。目 前大部分主机都是通过局域网接入互联网的。因此，在互联网上进行多播的最后阶段，还是要把 多播数据报在局域网上用硬件多播交付给多播组的所有成员[见图4.22(b)]。 多播机制仅应用于UDP, 它能将报文同时发送给多个接收者。而 TCP 是一个面向连接的协 议，它意味着分别运行在两台主机的进程之间存在一条连接，因此会一对一地发送。 因为局域网支持硬件多播，所以只要把IP 多播地址映射成多播MAC 地址，即可将 IP 多播 数据报封装在局域网的MAC 帧中，而MAC 帧首部的目的MAC 地址字段就设置为由IP 多播地 址映射成的多播 MAC 地址。这样，就很方便地利用硬件多播实现了局域网内的IP 多播。 IANA 拥有的以太网多播地址的范围是从01-00-5E-00-00-00 到01-00-5E-7F-FF-FF。在这些地 址中，只有后23位可用作多播。但D 类IP 地址可供分配的有28位，即这28位中的前5位无法映 射到以太网多播地址，因此两者是多对一的映射关系，如图4.23所示。 例如，IP 多播地址224.128.64.32(E0-80-40-20) 和另一个IP 多播地址224.0.64.32(E0-00-40-20) 转换成以太网的多播地址都是01-00-5E-00-40-20。因此收到多播数据报的主机，还要在IP 层利用 软件进行过滤，把不是本主机要接收的数据报丢弃。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-18bee586529138bada42c241645dd300"
  },
  "doc-17b8c476eb789f091749311b17314b0f": {
    "content": "30.距离-向量路由算法 距离-向量算法的基础是Bellman-Ford 算法，它用于计算单源最短路径。每个节点以自身为 源点执行Bellman-Ford 算法，所以全局上可以解决任意节点对之间的最短路径问题。 下面讨论Bellman-Ford 算法的基本思想。 假设d(v) 表示从节点x 到节点y 的带权最短路径的费用，则有 d(V)=min{c(x,v)+d,(v)}, v 是x 的所有邻居 式中 ，c(x,v) 是从x 到其邻居v的费用。已知x 的所有邻居到y 的最短路径费用后，从x 到y 的最短路径费用是对所有邻居 v 的 dx,v)+d,(v) 的最小值。所有最短路径算法都依赖 于一个性质：“两点之间的最短路径也包含了路径上其他顶点间的最短路径。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-17b8c476eb789f091749311b17314b0f"
  },
  "doc-7d1a7ec32febe2dbc3e425bea4ac63ee": {
    "content": "28.CSMA/CA协议 CSMA/CD 协议已成功用于有线连接的局域网，但无线局域网不能简单地搬用CSMA/CD 协 议。无线局域网仍然使用CSMA, 但无法使用冲突检测，主要有两个原因： 1)适配器接收到的信号强度往往远小于发送信号的强度，且在无线介质上信号强度的动态 变化范围很大，因此若要实现冲突检测，则硬件上的花费会过大。 2)在无线通信中，并非所有站点都能够听见对方(但能产生冲突),即存在“隐蔽站”问题， 从而使得冲突检测机制并不能检测到所有的冲突。 为此，802.11标准定义了广泛用于无线局域网的CSMA/CA 协议，它对CSMA/CD 协议进行 修改，将冲突检测改为冲突避免 (Collision Avoidance,CA)。“冲突避免”并不是指协议可以完 全避免冲突，而是指协议的设计要尽量降低冲突发生的概率。因为802.11无线局域网不使用冲突 检测，一旦站点开始发送一个帧，就会完全发送该帧，但冲突存在时仍发送整个帧(尤其是长数 据帧)会严重降低网络的效率，所以要采用冲突避免技术来降低冲突的概率。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-7d1a7ec32febe2dbc3e425bea4ac63ee"
  },
  "doc-4c7c224b674691913a24d5b653c04f5a": {
    "content": "高速以太网 (1)100BASE-T以太网 100BASE-T 是在双绞线上传送100Mb/s 基带信号的星形拓扑以太网，它仍然使用CSMA/CD 协议，也称快速以太网。100 BASE-T 既支持全双工方式，又支持半双工方式，可在全双工方式下 工作而无冲突发生，因此在全双工方式下不使用CSMA/CD 协议。 100BASE-T 的 MAC 帧格式仍然是802.3标准规定的帧格式。保持最短帧长不变，但将一个 网段的最大长度减小到100m。帧间最小间隔从原来的9.6μs 改为0.96 μs。 (2)吉比特以太网 吉比特以太网也称千兆以太网，允许在1Gb/s速率下以全双工和半双工两种方式工作。使用 802.3 协议规定的帧格式。使用双绞线或光纤作为传输介质。在半双工方式下使用 CSMA/CD 协 议，而在全双工方式不使用CSMA/CD 协议。与10BASE-T 和100BASE-T 技术向后兼容。 (3)10吉比特以太网 10吉比特以太网的帧格式与10Mb/s 、100Mb/s和 1Gb/s 以太网的帧格式完全相同，还保留了 802.3标准规定的以太网最小帧长和最大帧长，以便升级和向后兼容。10吉比特以太网只工作在 全双工方式，不存在争用问题，当然也不使用CSMA/CD 协议。 以太网从10Mb/s 到10Gb/s 的演进证明了以太网是可扩展的(从10Mb/s 到10Gb/s) 、灵活的 (多种传输介质、全/半双工、共享/交换),且易于安装，稳健性好。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4c7c224b674691913a24d5b653c04f5a"
  },
  "doc-ed9d5c0a6f6d333f354f620c32460e29": {
    "content": "计网掩码 子网掩码可用来指明分类IP 地址的主机号部分被借用了多少位作为子网号。 子网掩码是一个与IP 地址相对应的、长32位的二进制串，它由一串1和跟随的一串0组成。 其中，1对应于IP 地址中的网络号及子网号，而0对应于主机号。主机或路由器只需将 IP 地址 和其对应的子网掩码逐位“与” (AND 运算),就可得出相应子网的网络地址。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ed9d5c0a6f6d333f354f620c32460e29"
  },
  "doc-257fa84611db0e7c844fd5d11a1b6c73": {
    "content": "29.静态路由与动态路由 路由器转发分组是通过路由表转发的，而路由表是通过各种算法得到的。从能否随网络的通 信量或拓扑自适应地进行调整变化来划分，路由算法可以分为如下两大类。 1)静态路由算法。指由网络管理员手工配置每一条路由。 2)动态路由算法。根据网络流量负载和拓扑结构的变化来动态调整自身的路由表。 静态路由算法的特点是简单和开销较小，但不能及时适应网络状态的变化，适用于简单的小 型网络。动态路由算法能较好地适应网络状态的变化，但实现复杂，开销也大，适用于较复杂的 大型网络。常用的动态路由算法可分为两类：距离-向量路由算法和链路状态路由算法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-257fa84611db0e7c844fd5d11a1b6c73"
  },
  "doc-73ee2522bb31ab817b3e9046e8b38d04": {
    "content": "客户/服务器模型 在客户/服务器(Client/Server,C/S) 模型中，有一个总是打开的主机称为服务器，它服务于 许多来自其他称为客户机的主机请求。其工作流程如下： 1)服务器处于接收请求的状态。 2)客户机发出服务请求，并等待接收结果。 3)服务器收到请求后，分析请求，进行必要的处理，得到结果并发送给客户机。 服务器上运行着专门用来提供某种服务的程序，可以同时处理多个远程或本地客户的请求。 客户程序必须知道服务器程序的地址。服务器启动后就一直不断地运行着，被动等待并接收来自 各地客户的请求。因此，服务器程序不需要知道客户程序的地址。 客户/服务器模型最主要的特征是：客户是服务请求方，服务器是服务提供方。如 Web 应用程 序，其中总是打开的Web 服务器服务于运行在客户机上的浏览器的请求。当Web 服务器接收到来 自客户机对某对象的请求时，它向该客户机发送所请求的对象以做出响应。使用客户/服务器模型的常见应用包括Web 、文件传输协议 (FTP) 、 远程登录和电子邮件等。 客户/服务器模型的主要特点还有： 1)网络中各计算机的地位不平等，服务器可通过对用户权限的限制来达到管理客户机的目 的。整个网络的管理工作由少数服务器负责，因此网络的管理非常集中和方便。 2)客户机相互之间不直接通信。例如，在Web 应用中两个浏览器并不直接通信。 3)可扩展性不佳。受服务器硬件和网络带宽的限制，服务器支持的客户机数量有限。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-73ee2522bb31ab817b3e9046e8b38d04"
  },
  "doc-6d9e7b22474c7ee3dae60acd2c204b3f": {
    "content": "39.VLAN 基本概念与基本原理 一个以太网是一个广播域，当一个以太网中包含的计算机太多时，往往会导致： ●以太网中出现大量的广播帧，特别是经常使用的ARP 和DHCP (第4章)。 ●一个单位的不同部门共享一个局域网，对信息保密和安全不利。 通过虚拟局域网 (Virtual LAN,VLAN),可将一个较大的局域网分割成一些较小的与地理 位置无关的逻辑上的VLAN, 而 每 个 VLAN 是一个较小的广播域。属于同一个 VLAN 的计算机 之间可以直接通信，而不同VLAN 的计算机之间不能直接通信。 有以下三种划分VLAN 的方式： 1)基于接口。将交换机的若干接口划为一个逻辑组，这种方法最简单、最有效，若主机离 开了原来的接口，则可能进入一个新的子网。 2)基于MAC 地址。按MAC 地址将一些主机划分为一个逻辑子网，当主机的物理位置从一 个交换机移动到另一个交换机时，它仍属于原来的子网。 3)基于IP 地址。根据网络层地址或协议划分VLAN, 这样的VLAN 可以跨越路由器进行扩 展，将多个局域网的主机组成一个VLAN。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-6d9e7b22474c7ee3dae60acd2c204b3f"
  },
  "doc-6ed03433f41dbb5cb210556afbd6be4c": {
    "content": "1. 数据、信号与码元 通信的目的是传输信息，如文字、图像和视频等。数据是指传送信息的实体。信号则是数据 的电气或电磁表现，是数据在传输过程中的存在形式。数据和信号都有模拟或数字之分：①模拟 数据(或模拟信号)的取值是连续的； ②数字数据(或数字信号)的取值是离散的。 在通信系统中，常用一个固定时长的信号波形表示一个k 进制数，这个时长内的信号称为码 元(可称k 进制码元),而该时长称为码元宽度(也称信号周期)。1码元可携带若干比特的信息 量。例如，在一个信号周期内可能出现2个信号，每个信号对应一个二进制数(1bit); 若一个信号周期内可能出现4个信号，则每个信号就对应一个四进制数(2bit)。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-6ed03433f41dbb5cb210556afbd6be4c"
  },
  "doc-24840a1019bc106a9cab48990f50c813": {
    "content": "7.模拟数据编码为数字信号 主要包括三个步骤，即采样、量化和编码，常用于对音频信号进行编码的PCM 编码。 1 ) 采样是指对模拟信号进行周期性扫描，将时间上连续的信号变成时间上离散的信号。根 据奈奎斯特定理，采样频率必须大于或等于模拟信号最大频率的两倍。 2 ) 量化是指将采样得到的电平幅值按照一定的分级标度转换为对应的数值并取整，这样就 将连续的电平幅值转换为了离散的数字量。采样和量化的实质就是分割和转换。 3 ) 编码是指将量化得到的离散整数转换为与之对应的二进制编码。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-24840a1019bc106a9cab48990f50c813"
  },
  "doc-dc0488130fc82fa8bedc4e058437b364": {
    "content": "26.IPv6 地址 IPv6 数据报的目的地址有以下三种基本类型： 1)单播。就是传统的点对点通信。 2 )多播。一点对多点的通信，数据报发送到一组计算机中的每一台。 3)任播。这是IPv6增加的一种类型。任播的终点是一组计算机，但数据报只交付其中的一 台计算机，通常是距离最近的一台计算机。 IPv4地址通常使用点分十进制表示法。若IPv6也使用这种表示法，则地址书写起来将相当 长 。IPv6标准使用冒号十六进制记法，即把地址中的每4位用 一个十六进制数表示，并用冒号分隔每1 6位，如4BF5:AA12:0216:FEBC:BA5F:039A:BE9A:2170。 当16位域的开头有一些0时，可以采用一种缩写表示法，但在域中必须至少有一个数字。例如，可以把地址4BF5:0000:0000:0000:BA5F:039A:000A:2176 缩写为4BF5:0:0:0:BA5F:39A:A:2176。 当有相继的0值域时，还可以进一步缩写。这些域可用双冒号缩写(::)。当然，双冒号表示 法在一个地址中仅能出现一次，因为0值域的个数没有编码，需要从指定的总的域的个数来推算。 这样一来，前述地址可被更紧凑地书写成4BF5:BA5F:39A:A:2176。 IPv6 地址的分类如下： 1)未指明地址：该地址不能用作目的地址，只能用于还未配置IPv6 地址的主机作为源地址。 2)环回地址：该地址的作用与IPv4 的环回地址相同，但IPv6 的环回地址仅此一个。 3)多播地址：该地址的作用和IPv4 的一样。这类地址占IPv6 地址空间的1/256。 4)本地链路单播地址：该地址的作用类似于IPv4 的私有IP 地址。 5)全球单播地址：用得最多的地址。IPv6 全球单播地址采用三级结构(见图4.13):第一 级为全球路由选择前缀，占48位，用于互联网中的路由选择，相当于IPv4 分类地址中 的网络号；第二级为子网标识符，占16位，用于各机构构建自己的子网；第三级为接口 标识符，用于指明主机或路由器的单个网络接口，相当于IPv4 分类地址中的主机号。 与IPv4 不同，IPv6地址的接口标识符有64位之多，足以对各种接口的硬件地址直接进行编码。这样，IPv6就可直接从128位地址的最后64位中直接提取出相应的硬件地址，而不需要使用地址解析协议 (ARP)进行地址解析。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-dc0488130fc82fa8bedc4e058437b364"
  },
  "doc-507284413ad80037617009093e1c30b0": {
    "content": "14.滑动窗口流量控制基本原理 滑动窗口流量控制是一种更高效的流量控制方法。在任意时刻，发送方都维持一组连续的允 许发送帧的序号，称为发送窗口；同时接收方也维持一组连续的允许接收帧的序号，称为接收窗 口。发送窗口表示在还未收到对方确认信息的情况下，发送方最多还能发送多少个帧和哪些帧。 同理，在接收方设置接收窗口是为了控制可以接收哪些帧和不可以接收哪些帧。 发送方每收到一个按序确认的确认帧，就将发送窗口向前滑动一个位置。这样，就有一个新 的序号落入发送窗口，序号落入发送窗口内的数据帧可以继续发送。当窗口内没有可以发送的帧 (窗口内的帧全部是已发送但未收到确认的帧)时，发送方就停止发送。 接收方每收到一个序号落入接收窗口的数据帧，就允许将该帧收下，然后将接收窗口向前滑 动一个位置，并发回确认。这样，就有一个新的序号落入接收窗口，序号落入接收窗口内的数据 帧即为准备接收的帧。若收到的帧落在接收窗口之外，则一律丢弃。 滑动窗口具有以下重要特性： 只有接收窗口向前滑动(同时接收方发送了确认)时，发送窗口才有可能(只有发送方 收到确认后才一定)向前滑动。 从滑动窗口的概念看，停止-等待协议与后面将介绍的后退N 帧协议和选择重传协议只在发送窗口大小与接收窗口大小上有所差别： 停止-等待协议：发送窗口WT=1, 接收窗口 WR=1。 后退N 帧协议：发送窗口WT>1, 接收窗口WR=1 。 选择重传协议：发送窗口 WT>1, 接收窗口WR>1。 若采用n比特对帧编号，则后两种滑动窗口协议还需满足 WT+WR≤2”。 当接收窗口大小为1时，只有收到该帧后才允许接收下一帧，因此可保证帧的有序接收。 在数据链路层的滑动窗口协议中，窗口大小在传输过程中是固定的(与传输层不同)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-507284413ad80037617009093e1c30b0"
  },
  "doc-914af5fc1c2f1ce1d9cb8ac4afc2758e": {
    "content": "16.单帧滑动窗口与停止-等待协议 ( S-W) 在停止-等待协议中，发送方每次只能发送一个帧，当发送方收到接收方的确认帧之后，才可 以发送下一个帧。从滑动窗口的角度看，停止-等待协议的发送窗口和接收窗口大小均为1。 在停止-等待协议中，可能出现两种差错：①数据帧出错或丢失，接收方检测到数据帧出了差 错，就简单地将该帧丢弃；若是数据帧在传输过程中丢失，接收方当然什么都不知道。为了应付这种可能的情况，发送方装备了计时器。在一个帧发送后，发送方等待确认，当计时器超时的时候， 若仍未收到确认，则重发该数据帧。如此重复，直到该数据帧正确到达为止。②确认帧出错或丢失， 若接收方已收到正确的数据帧，但发送方收不到确认帧，因此发送方会重传已被接收的数据帧， 接收方收到相同的数据帧时会丢弃该帧，并重传一个该帧对应的确认帧。 对于停止-等待协议，由于每发送一个数据帧就停止等待，只需保证每次发送的新数据帧的 序号与上次发送的数据帧的序号不同，因此用1比特来编号就足够。发送的帧交替地用0和1来标识，确认帧分别用ACK0 和 ACK1 来表示。若连续出现相同序号的数据帧，则表明发送方进行 了超时重传。若连续出现相同序号的确认帧，则表明接收方收到了重复帧。 此外，为了超时重传和判定重复帧的需要，发送方和接收方都要设置一个帧缓冲区。当发送 方发送完数据帧时，必须在其发送缓存中保留该数据帧的副本，这样才能在出现差错时进行重传。只有在收到对方发来的确认帧ACK后，方可清除该副本。 停止-等待协议的信道利用率很低。为了提高传输效率，产生了连续 ARQ 协议(后退N 帧协 议和选择重传协议),发送方可连续发送多个帧，而不是每发完一个帧就停止等待确认。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-914af5fc1c2f1ce1d9cb8ac4afc2758e"
  },
  "doc-eacc7e9b7854960579f402d6ae85d7b3": {
    "content": "路由信息协议 路由信息协议 (Routing Information Protocol,RIP)是内部网关协议IGP 中最先得到广泛应 用的协议。RIP 是一种分布式的基于距离向量的路由选择协议。 RIP有以下规定： 1)网络中的每个路由器都要维护从它自身到其他每个目的网络的距离记录，即距离向量。 2)RIP使用跳数 (Hop Count) (或称距离)来衡量到达目的网络的距离。规定从一路由器到直接连接的网络的距离定义为1;而每经过一个路由器，距离就加1。 3)RIP认为好的路由就是它通过的路由器数量少，即距离短或跳数少。 4)RIP允许一条路径最多只能包含15个路由器。因此距离等于16时表示网络不可达。可见 RIP 只适用于小型互联网。距离向量路由可能会出现环路的情况，规定路径上的最高跳数 的目的是防止分组不断在环路上循环，减少网络拥塞的可能性。 5)每个路由表项都有三个关键字段：<目的网络N, 距离d, 下一跳路由器地址X>。 RIP有以下特点： RIP的每个路由器都要不断与其他路由器交换信息，下面三个特点非常重要。 1)和谁交换信息：仅和直接相邻的路由器交换信息。 2)交换什么信息：交换的信息是本路由器所知道的全部信息，即自己的路由表。 3)何时交换信息：按固定的时间间隔(通常为30秒)交换路由信息。当网络拓扑发生变化 时，路由器也及时向相邻路由器通告拓扑变化后的路由信息。 路由器刚开始工作时，只知道自己到直接相连的几个网络的距离为1。每个路由器仅和相邻 路由器周期性地交换并更新路由信息。经过若干次交换和更新后，所有的路由器最终都会知道到 达本自治系统内任何网络的最短距离和下一跳路由器的地址，称为收敛。 RIP是应用层协议，它使用UDP 传送数据(端口520)。 RIP 选择的路径不一定是时间最短的，但一定是具有最少的路由跳数，因为它是根据最少跳数进行路径选择的。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-eacc7e9b7854960579f402d6ae85d7b3"
  },
  "doc-26eabdee6c53baf8193c1faec7b214b9": {
    "content": "2. 信源、信道与信宿 实际的通信系统大多数是双向的，可进行双向通信。数据通信系统主要划分为信源、信道和信宿三部分。信源是产生和发送数据的源头，信宿是接收数据的终点，它们通常都是计算机或其他数字终端装置。信道是信号的传输介质，一条双向通信的线路包含一个发送信道和一个接收信道。发送端信源发出的信息需要通过变换器转换成适合在 信道上传输的信号，而通过信道传输到接收端的信号首先由反变换器转换成原始信息，然后发送给信宿。噪声源是信道上的噪声及分散在通信系统其他各处的噪声的集中表示。 信道按传输信号形式的不同，分为传送模拟信号的模拟信道和传送数字信号的数字信道两大 类：信道按传输介质的不同分为无线信道和有线信道。 信道上传送的信号有基带信号和宽带信号之分。基带信号是由信源发出的未经过调制的原始 电信号，当在信道中直接传送基带信号时，称为基带传输；宽带信号首先将基带信号进行调制，形成频分复用模拟信号，然后送到信道上传输，称为宽带传输。 数据传输方式分为串行传输和并行传输。串行传输是指逐比特地按序依次传输，并行传输是 指若干比特通过多个通信信道同时传输。串行传输适用于长距离通信，如计算机网络。并行传输 适用于近距离通信，常用于计算机内部，如CPU与主存之间。 从通信双方信息的交互方式看，可分为三种基本方式： 1)单向通信。 只有一个方向的通信而没有反方向的交互，如无线电广播、电视广播等。 2)半双工通信。通信双方都可发送或接收信息，但任何一方都不能同时发送和接收信息。 3)全双工通信。 通信双方可同时发送和接收信息。 单向通信只需一个信道，而半双工通信或全双工通信都需要两个信道，每个方向一个信道。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-26eabdee6c53baf8193c1faec7b214b9"
  },
  "doc-a51593b28a60440a340639663f24d23a": {
    "content": "32.局域网的基本概念和体系结构 局域网 (Local Area Network,LAN) 是指在一个较小的地理范围(如一所学校)内，将各种 计算机、外部设备和数据库系统等通过双绞线、同轴电缆等连接介质互相连接起来，组成资源和 信息共享的计算机互联网络。主要特点如下： 1)为一个单位所拥有，且地理范围和站点数量均有限。 2)所有站点共享较高的总带宽(较高的数据传输速率)。 3)较低的时延和较低的误码率。 4)各站为平等关系而非主从关系。 5)能进行广播和多播。 局域网的特性主要由三个要素决定：拓扑结构、传输介质、介质访问控制方式，其中最重要 的是介质访问控制方式，它决定着局域网的技术特性。 常见的局域网拓扑结构主要有以下4大类：①星形结构；②环形结构；③总线形结构；④星 形和总线形结合的复合型结构。 局域网可以使用铜缆、双绞线和光纤等多种传输介质，其中双绞线为主流传输介质。 局域网的介质访问控制方法主要有CSMA/CD 协议、令牌总线协议和令牌环协议，其中前两 种协议主要用于总线形局域网，令牌环协议主要用于环形局域网。 三种特殊的局域网拓扑实现如下： ● 以太网 (目前使用范围最广)。逻辑拓扑是总线形结构，物理拓扑是星形结构。 ● 令 牌 环(Token Ring,IEEE 802.5)。逻辑拓扑是环形结构，物理拓扑是星形结构。 ● FDDI (光纤分布数字接 口，IEEE 802.8)。逻辑拓扑是环形结构，物理拓扑是双环结构。 IEEE802 标准定义的局域网参考模型只对应于OSI 参考模型的数据链路层和物理层，并将数 据链路层拆分为两个子层：逻辑链路控制 (LLC) 子层和介质访问控制 (M AC) 子层。与接入传 输介质有关的内容都放在 MAC 子层，它向上层屏蔽对物理层访问的各种差异，主要功能包括： 组帧和拆卸帧、比特传输差错检测、透明传输。LLC 子层与传输介质无关，它向网络层提供无确 认无连接、面向连接、带确认无连接、高速传送四种不同的连接服务类型。 因为在局域网市场中的垄断地位，以太网几乎成为局域网的代名词，而802 委员会制定的 LLC 子层作用已经不大，所以现在许多网卡仅装MAC 协议而不装 LLC 协议。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a51593b28a60440a340639663f24d23a"
  },
  "doc-b3655c01fcb43160a48a157b051a0a43": {
    "content": "8.计算机网络分层结构 计算机网络的各层及其协议的集合称为网络的体系结构(Architecture) 。换言之，计算机网络的体系结构就是这个计算机网络及其所应完成的功能的精确定义。需要强调的是，这些功能究竟是用何种硬件或软件完成的，是一个遵循这种体系结构的实现(Implementation)问题。体系结构是抽象的，而实现则是具体的，是真正在运行的计算机硬件和软件。计算机网络体系结构通常 都具有可分层的特性，它将复杂的大系统分成若干较容易实现的层次。 分层的基本原则如下： 1)每层都实现一种相对独立的功能，降低大系统的复杂度。 2)各层之间的接口自然清晰，易于理解，相互交流尽可能少。 3)各层功能的精确定义独立于具体的实现方法，可以采用最合适的技术来实现。 4)保持下层对上层的独立性，上层单向使用下层提供的服务。 5)整个分层结构应能促进标准化工作。 在网络分层结构中，第n 层的活动元素通常称为第n 层实体。具体来说，实体指任何可发送 或接收信息的硬件或软件进程，通常是某个特定的软件模块。不同机器上的同一层称为对等层， 同一层的实体称为对等实体。第n 层向第n+1层提供的服务包括在其以下各层提供的服务。第n 层的实体称为服务提供者，服务提供者上一层的实体称为服务用户。 协议数据单元 (P DU): 对等层之间传送的数据单位。第n 层的PDU 记为n-PDU 。各层的PDU都分为服务数据单元和协议控制信息两部分。 服务数据单元 (SDU): 层与层之间交换的数据单位。第n 层的 SDU 记为n-SDU。协议控制信息 (PCI): 控制协议操作的信息。第n 层的PCI 记为n-PCI。 每层的协议数据单元都有一个通俗的名称，如物理层的PDU 称为比特流，数据链路层的PDU 称为帧，网络层的PDU 称为分组，传输层的PDU 称为报文段。 当在各层之间传输数据时，将从第n+1 层收到的PDU 作为第n 层的SDU, 加上第n 层的PCI, 就封装成了第n 层的PDU, 交给第n-1 层后作为SDU 发送，接收方接收时做相反的处理，因此可知三者的关系为n-SDU+n-PCI=n-PDU=( n-1)-SDU。 具体地，层次结构的含义包括如下几方面： 1)第n 层的实体不仅要使用第n-1层的服务来实现自身定义的功能，还要向第 n+1 层提供本层的服务，该服务是第n 层及其下面各层提供的服务总和。 2)最低层只提供服务，是整个层次结构的基础；最高层面向用户提供服务。 3)上一层只能通过相邻层间的接口使用下一层的服务，而不能调用其他层的服务。 4)通信时，对等层在逻辑上有一个直接信道，表现为能直接将信息传送到对方。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-b3655c01fcb43160a48a157b051a0a43"
  },
  "doc-a7c13b58d3d9af6cebba7e581edd7e9f": {
    "content": "26.二进制指数退避算法的应用 一旦发生冲突，参与冲突的两个站点紧接着再次发送就没有意义，若坚持这样做，则将导致无 休止的冲突。CSMA/CD采用截断二进制指数退避算法来确定冲突后重传的时机，它让发生冲突的 站点在停止发送后，推迟一个随机的时间再重新发送。算法精髓如下： 1)确定基本退避时间，一般取2倍的总线端到端的传播时延2t (争用期)。 2)从离散的整数集合[0,1, …,(2*-1]中随机取出一个数，记为r, 重传所需推迟的时间就是 r 倍的争用期，即2rt 。参数k=min [重传次数，10],可见当重传次数不超过10时，参数k 等于重传次数；但当重传次数超过10时，k 就不再增大，而一直等于10。 3)当重传达16次仍不成功时，说明网络太拥挤，认为该帧永远无法正确发出，抛弃该帧并 向高层报告出错(这个条件容易忽略，请读者注意)。 假设适配器首次试图传送一帧，且在传送过程中检测到冲突。第1次重传时，k=1, 随机数 r 从整数集合{0,1}中选择，可选的重传推迟时间是0或2t 。若再次发生冲突，则第二次重传时， 随机数r 从整数集合{0,1,2,3}中选择，因此重传推迟时间是在0,2T,4t,6r 这四个时间中随机选 取的一个，以此类推。使用截断二进制指数退避算法可使重传需要推迟的平均时间随重传次数的 增大而增大(也称动态退避),因此能降低发生冲突的概率，有利于整个系统的稳定。 以太网还规定帧间最小间隔为9.6 μs, 相当于发送96比特的时间。这样做是为了使刚刚收到 数据帧的站的接收缓存来得及清理，为接收下一帧做好准备。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a7c13b58d3d9af6cebba7e581edd7e9f"
  },
  "doc-a55e7fcf00acc6d79c082f6e0508ffb7": {
    "content": "TCP连接释放的4次挥手过程 第一步：客户机打算关闭连接时，向服务器发送连接释放报文段，并停止发送数据，主动关闭 TCP 连接，该报文段的FIN 位置1,序号seq=u, 它等于前面已传送的数据的最后一个字节的 序号加1,FIN 报文段即使不携带数据，也要消耗一个序号。这时，客户机进入FIN-WAIT-1 (终止等待1)状态。 TCP是全双工的，即可以想象为一条 TCP 连接上有两条数据通路，发送FIN的一端不能再发送数据，即关闭了其中一条数据通路，但对方还可以发送数据。 第二步：服务器收到连接释放报文段后即发出确认。该报文段的ACK位置1 , 确认号ack=u+1，序号seq=v，等于它前面已传送过的数据的最后一个字节的序号加1.然后服务器进入CLOSE-WAIT状态。此时，从客户机到服务器这个方向的连接就释放了，但从服务器到客户机这个方向的连接并未关闭，TCP连接处于半关闭状态。客户机收到来自服务器的确认后，进入 FIN-WAIT-2 (终止等待2)状态，等待服务器发出的连接释放报文段。 第三步：若服务器已经没有要向客户机发送的数据，就向其发送连接释放报文段。该报文段的 FIN 位和 ACK 位都置1,序号seq=w (处于半关闭状态的服务器可能又发送了一些数据),还必须 重复发送上次已发送的确认号ack=u+1。这时服务器进入LAST-ACK(最后确认)状态。 第四步：客户机收到连接释放报文段后，必须发出确认，之后进入 TIME-WAIT(时间等待) 状态。该报文段的ACK 位置1,确认号ack=w+1, 序号seq=u+1 。 服务器收到该确认报文段后 就进入CLOSED (连接关闭)状态。客户机进入TIME-WAIT 状态后，还要经过时间等待计时器 设置的时间2 MSL(Maximum Segment Lifetime, 最长报文段寿命)后，才进入CLOSED 状态。 若服务器收到连接释放请求后不再发送数据，则从客户机发出FIN 报文段时刻算起，客户机释放 连接的最短时间为1RTT+2MSL, 服务器释放连接的最短时间为1.5RTT。 除时间等待计时器外，TCP 还使用一个保活计时器，以避免客户机突然出现故障，而导致服务器一直无效等待。服务器每收到一次客户的数据，就会重置保活计时器，若计时到期后还没有 收到客户的数据，服务器就每隔75秒发送一个探测报文段。若连续发送10个探测报文段后仍未 收到客户的响应，则服务器认为客户机出了故障，关闭这个连接。 对上述TCP 连接建立和释放的总结如下： 1)建立连接。分为3步： ① SYN=1,seq=x。 ② SYN=1,ACK=1,seq=y,ack=x+1。 ③ACK=1,seq=x+1,ack=y+1。 2)释放连接。分为4步： ① FIN=1,seq=u。 ② ACK=1,seq=v,ack=u+1。 ③ FIN=1,ACK=1,seq=w,ack=u+1。 ④ACK=1,seq=u+1,ack=w+1。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a55e7fcf00acc6d79c082f6e0508ffb7"
  },
  "doc-ebd9ee4b1439630cb47f3515878d35f1": {
    "content": "41.点对点协议 点对点协议 (Point-to-Point Protocol,PPP) 是现在最流行的点对点链路控制协议。主要有两 种应用：①用户通常都要连接到某个ISP 才能接入互联网，PPP 就是用户计算机与ISP 通信时所 用的数据链路层协议；②两台网络设备之间的直连专用线路。 PPP 有三个组成部分： 1 ) 一个链路控制协议(L CP) 。用来建立、配置、测试数据链路连接，以及协商一些选项。 2)一套网络控制协议 (NCP) 。PPP允许采用多种网络层协议，每个不同的网络层协议要用 一个相应的 NCP 来配置，为网络层协议建立和配置逻辑连接。 3)一种将 IP 数据报封装到串行链路的方法。IP 数据报在PPP 帧中就是其信息部分，这个信 息部分的长度受最大传送单元 (MTU)的限制。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ebd9ee4b1439630cb47f3515878d35f1"
  },
  "doc-16611ea90359b0db5f907596208e8099": {
    "content": "7.字符计数法 字符计数法是指在帧首部使用一个计数字段来记录该帧所含的字节数(包括计数字段自身所 占用的1字节),如图3.5所示。当接收方读出帧首部的字节计数值时，就知道后面跟随的字节数， 从而确定帧结束位置。因为帧与帧之间是连续传输的，所以也能确定下一帧的开始位置。 这种方法最大的问题在于若计数字段出错，即失去帧边界划分的依据，则接收方就无法判断 所传输帧的结束位和下一帧的开始位，收发双方将失去同步，造成灾难性后果。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-16611ea90359b0db5f907596208e8099"
  },
  "doc-cacf32feb754cc65ca6e8bf0a63ce973": {
    "content": "27.CSMA/CD 协议的归纳如下： ① 准备发送：适配器从网络层获得一个分组，封装成帧，放入适配器的缓存。 ② 检测信道：若信道忙，则持续检测，直至信道转为空闲；若在9.6μs的时间内信道保持空 闲(保证帧间最小间隔),则发送这个帧。 ③ 在发送过程中，适配器仍然持续检测信道。这里只有如下两种可能。 ●发送成功：在争用期内一直未检测到冲突，该帧肯定能发送成功。 ●发送失败：在争用期内检测到冲突，此时立即停止发送，适配器执行退避算法，等待 一段随机时间后返回步骤②。若重传16次仍不能成功，则停止重传并向上报错。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-cacf32feb754cc65ca6e8bf0a63ce973"
  },
  "doc-7068ff9c46e28ac2428df295a20059c8": {
    "content": "21.随机访问介质访问控制 在随机访问协议中，不采用集中控制方式解决发送信息的次序问题，所有用户都能根据自己 的意愿随机地发送信息，占用信道的全部速率。在总线形网络中，当有两个或多个用户同时发送 信息时，就会产生帧冲突(也称碰撞),导致所有冲突用户的发送均以失败告终。为了解决随机 访问发生的冲突，每个用户需要按照一定的规则反复地重传它的帧，直到该帧无冲突地通过，这 些规则就是随机访问介质访问控制协议，其核心思想是：胜利者通过争用获得信道，进而获得信 息的发送权。因此，随机访问介质访问控制协议也称争用型协议。 可见，若采用信道划分机制，则节点之间的通信要么共享空间，要么共享时间，要么共享空 间和时间；而若采用随机访问控制机制，则节点之间的通信既不共享时间，又不共享空间。因此， 随机介质访问控制实质上是一种将广播信道转换为点到点信道的机制。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-7068ff9c46e28ac2428df295a20059c8"
  },
  "doc-c5250602c5f116bcec924ef7f984c4a6": {
    "content": "TCP的序号机制 TCP 首部的序号字段用来保证数据能有序提交给应用层，TCP 把数据视为一个无结构但有序 的字节流，序号建立在传送的字节流之上，而不建立在报文段之上。 TCP 连接传送的数据流中的每个字节都编上一个序号。序号字段的值是指本报文段所发送的 数据的第一个字节的序号。如图5.8所示，假设A 和 B 之间建立了一条 TCP 连接，A 的发送缓存 区中共有10B, 序号从0开始标号，第一个报文段包含第0~2个字节，则该TCP 报文段的序号 是0,第二个报文段的序号是3。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c5250602c5f116bcec924ef7f984c4a6"
  },
  "doc-0c897e520399735a3b7f817b63379819": {
    "content": "拥塞避免算法 拥塞避免算法的思路是让拥塞窗口cwnd 缓慢增大，具体做法是：每经过一个往返时延RTT 就 把发送方的拥塞窗口cwnd 加1,而不是加倍，使拥塞窗口cwnd 按线性规律缓慢增长(加法增大), 这比慢开始算法的拥塞窗口增长速率要缓慢得多。 根据cwnd 的大小执行不同的算法，可归纳如下： ● 当cwnd<ssthresh时，使用慢开始算法。 ● 当cwnd>ssthresh时，停止使用慢开始算法而改用拥塞避免算法。 ● 当cwnd=ssthresh时，既可使用慢开始算法，又可使用拥塞避免算法(常规做法)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0c897e520399735a3b7f817b63379819"
  },
  "doc-504e047ae6286b8ede0a563df9266e33": {
    "content": "10.计算机网络提供的服务可按以下三种方式分类。 (1)面向连接服务与无连接服务 在面向连接服务中，通信前双方必须先建立连接，分配相应的资源(如缓冲区),以保证通 信能正常进行，传输结束后释放连接和占用的资源。因此这种服务可分为连接建立、数据传输和 连接释放三个阶段。例如，TCP 就是一种面向连接服务的协议。 在无连接服务中，通信前双方不需要先建立连接，需要发送数据时可直接发送，将每个带有 目的地址的包(报文分组)传送到线路上，由系统选定路线进行传输。这种服务常被描述为“尽 最大努力交付”,是一种不可靠的服务。例如，IP 、UDP 就是一种无连接服务的协议。 (2)可靠服务和不可靠服务 可靠服务是指网络具有纠错、检错、应答机制，能保证数据正确、可靠地传送到目的地。不 可靠服务是指网络只是尽量让数据正确、可靠地传送到目的地，是一种尽力而为的服务。 对于提供不可靠服务的网络，其网络的正确性、可靠性要由应用或用户来保障。例如，用户 收到信息后要判断信息的正确性，若不正确，则用户就要把出错信息报告给信息的发送者，以便 发送者采取纠正措施。通过用户的这些措施，可将不可靠服务变成可靠服务。 (3)有应答服务和无应答服务 有应答服务是指接收方在收到数据后向发送方给出相应的应答，该应答由传输系统内部自动 实现，而不由用户实现。发送的应答既可以是肯定应答，又可以是否定应答，通常在接收到的数 据有错误时发送否定应答。例如，文件传输服务就是一种有应答服务。 无应答服务是指接收方收到数据后不自动给出应答。若需要应答，则由高层实现。例如，对 于WWW服务，客户端收到服务器发送的页面文件后不给出应答。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-504e047ae6286b8ede0a563df9266e33"
  },
  "doc-073b68b4ea963beaa9f597d711fee66a": {
    "content": "集线器与交换机的区别 假设交换机已通过自学习算法逐步建立了完整的转发表，下面举例说明使用集线器的共享式 以 太 网与全部使用交换机的交换式以太网的区别。 1)主机发送普通帧。对于共享式以太网，集线器将帧转发到其他所有接口，其他各主机中 的网卡根据帧的目的MAC 地址决定接收或丢弃该帧。对于交换式以太网，交换机收到帧 后，根据帧的目的MAC 地址和自身的交换表将帧明确地转发给目的主机。 2)主机发送广播帧。对于共享式以太网，集线器将帧转发到其他所有接口，其他各主机中 的网卡检测到帧的目的MAC 地址是广播地址时，就接收该帧。对于交换式以太网，交换 机检测到帧的目的MAC 地址是广播地址，于是从其他所有接口转发该帧，其他各主机收 到该广播帧后，就接收该帧。两种情况的效果相同，但原理并不相同。 3)多对主机同时通信。对于共享式以太网，当多对主机同时通信时，必然产生冲突。对于 交换式以太网，交换机能实现多对接口的高速并行交换，因此不会产生冲突。 可见，集线器既不隔离广播域，又不隔离冲突域，而交换机不隔离广播域，但隔离冲突域。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-073b68b4ea963beaa9f597d711fee66a"
  },
  "doc-28835eb23baf249b73744d20b2c845ed": {
    "content": "5.数据报 网络在发送分组前不需要先建立连接。源主机的高层协议将报文拆成若干较小的数据段，并 加上地址等控制信息后构成分组。中间节点存储分组很短一段时间，找到最佳的路由后，尽快转 发每个分组。网络层不提供服务质量的承诺。因为网络不提供端到端的可靠传输服务，所以这就 使得网络中的路由器比较简单，且造价低廉(与电话网络相比)。 下面用图4.3中的例子来说明数据报服务的原理。假定主机A向主机B 发送分组。 1 ) 主机A 先将分组逐个发往与它直接相连的交换节点A, 交换节点A 缓存收到的分组。 然后查找自己的转发表。因为不同时刻的网络状态不同，所以转发表的内容可能不完全 相同，所以有的分组转发给交换节点C, 有的分组转发给交换节点D。 网络中的其他节点收到分组后，类似地转发分组，直到分组最终到达主机B。 当分组正在某一链路上传送时，分组并不占用网络其他部分的资源。因为采用存储转发技术， 资源是共享的，所以主机A 在发送分组时，主机B 也可同时向其他主机发送分组。 通过上面的例子，我们可以总结出数据报服务具有如下特点： 1)发送分组前不需要建立连接。发送方可随时发送分组，网络中的节点可随时接收分组。 2)网络尽最大努力交付，传输不保证可靠性，所以分组可能出错或丢失；网络为每个分组 独立地选择路由，转发的路径可能不同，因此分组不一定按序到达目的节点。 3)发送的分组中要包括发送方和接收方的完整地址，以便可以独立传输。 4)当分组在交换节点存储转发时，需要排队等候处理，这会带来一 定的时延。当网络发生 拥塞时，这种时延会大大增加，交换节点还可根据情况丢弃部分分组。 5)网络具有冗余路径，当某个交换节点或一条链路出现故障时，可相应地更新转发表，寻找另一条路径转发分组，对故障的适应能力强。 6)收发双方不独占某条链路，资源利用率较高。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-28835eb23baf249b73744d20b2c845ed"
  },
  "doc-732f8feba2a95c10610f0aae1e03b703": {
    "content": "15.划分子网 两级 IP 地址的缺点：IP 地址空间的利用率有时很低；给每个物理网络分配一个网络号会使 路由表变得太大，进而使网络性能变坏；两级IP 地址不够灵活。 从1985年起，在IP 地址中又增加了一个“子网号字段”,使两级IP 地址变成了三级IP地 址。这种做法称为划分子网。划分子网已成为互联网的正式标准协议。 划分子网的基本思路如下 ： ●划分子网纯属一个单位内部的事情。单位对外仍然表现为没有划分子网的一个网络。 ●划分子网的方法是从网络的主机号借用若干位作为子网号，当然主机号也相应减少了相 同的位数。三级IP 地址的结构：IP 地址：:={<网络号>,<子网号>,<主机号>}。 ●路由器转发分组根据的仍然是IP数据报的目的网络号，本单位的路由器收到IP数据报后， 再按目的网络号和子网号找到目的子网。最后把IP 数据报交付给目的主机。 例如，将一个 C 类网络208.115.21.0划分为4个子网，子网号占用2位，因此主机号就只有 6位，各子网的网络地址分别为208.115.21.0、208.115.21.64、208.115.21.128、208.115.21.192。每 个子网可分配的IP 地址数为2⁶-2=62。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-732f8feba2a95c10610f0aae1e03b703"
  },
  "doc-c5fbde46d116f9165f04f3577b739c1b": {
    "content": "5.流量控制 因为链路两端节点的工作速率和缓存空间存在差异，所以发送方的发送能力可能大于接收方 的接收能力，此时若不适当限制发送方的发送速率，前面来不及接收的帧将被后面不断发送来的 帧“淹没”,造成帧的丢失而出错。因此，流量控制实际上就是限制发送方的发送速率，使之不 超过接收方的接收能力。这个过程需通过某种反馈机制，使发送方知道在什么情况下可以接着发 送下一帧，而在什么情况下必须暂停发送，以等待收到某种反馈信息后继续发送。 在OSI 体系结构中，数据链路层具有流量控制的功能。而在TCP/IP 体系结构中，流量控制 功能被移到了传输层。它们控制的对象不同。对数据链路层来说，控制的是相邻节点之间的数据 链路上的流量，而对传输层来说，控制的则是从源端到目的端之间的流量。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c5fbde46d116f9165f04f3577b739c1b"
  },
  "doc-6dccdc9db3377192e7e94197d0c8556c": {
    "content": "37.OSPF的基本工作原理 因为各路由器之间频繁地交换链路状态信息，所以所有路由器最终都能建立一个链路状态数 据库，即全网的拓扑结构图。然后，每个路由器利用链路状态数据库中的数据，使用 Dijkstra 算 法计算自己到达各目的网络的最优路径，构造出自己的路由表。此后，当链路状态发生变化时， 每个路由器重新计算到达各目的网络的最优路径，构造出新的路由表。 为了使OSPF 能用于规模很大的网络，将一个自治系统再划分为若干更小的范围，称为区域。 划分区域的好处是，把利用洪泛法交换链路状态信息的范围局限在各个区域，而不是整个 AS, 从而减少了整个网络上的通信量。在一个区域内，由一个或多个区域边界路由器负责为流向该区 域以外的分组提供路由选择。在 AS 内只有一个区域配置成主干区域，它包含 AS 内的所有区域 边界路由器，可能还包含一些非边界路由器，主干区域的作用是连通其他区域。当分组在 AS 内的不同区域之间传送时，要先找到本区域内的一个区域边界路由器(如R3 、R4 、R7), 再通过主干区域路由到位于目的区域的区域边界路由器，最后路由到目的地。在图4.18中，R3 、R4 和 R7都是区域边界路由器，每个区域至少有一个区域边界路由器。主干区域还要有一个路由器专门负责和本AS 外的其他 AS 交换路由器信息，称为自治系统边界路由器(如R6)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-6dccdc9db3377192e7e94197d0c8556c"
  },
  "doc-8eb3bcce6dce2b56cf4a0cf6d5ff1f50": {
    "content": "7.UDP的首部格式 UDP数据报包含两部分：首部字段和数据字段。UDP 首部有8B, 由4个字段组成，每个字段的长度都是2B。各字段意义如下： 1)源端口。源端口号。在需要对方回信时选用，不需要时可用全0。 2)目的端口。目的端口号。这在终点交付报文时必须使用到。 3)长度。 UDP数据报的长度(包括首部和数据),其最小值是8(仅有首部)。 4)检验和。检测UDP 数据报在传输中是否有错。有错就丢弃。该字段是可选的，当源主机 不想计算检验和时，则直接令该字段为全0。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8eb3bcce6dce2b56cf4a0cf6d5ff1f50"
  },
  "doc-fd41ad5d48077ba0c967a181c41ac723": {
    "content": "计算机网络的概念 一般认为，计算机网络是一个将众多分散的、自治的计算机系统，通过通信设备与线路连接 起来，由功能完善的软件实现资源共享和信息传递的系统。 计算机网络(简称网络)由若干节点(Node, 或译为结点)和连接这些节点的链路(Link) 组成。网络中的节点可以是计算机、集线器、交换机或路由器等。网络之间还可通过路由器互连， 构成一个覆盖范围更广的计算机网络，这样的网络称为互连网 (intermet) 。 于是，我们可以这样 理解：网络把许多计算机连在一起，而互连网则把许多网络通过路由器连在一起。 请读者注意以下两个意思相差很大的名词：internet 和 Internet。 internet(互连网)是一个通用名词，泛指由多个计算机网络互连而成的计算机网络。在这 些网络之间可以使用任意的通信协议作为通信规则，不一定非要使用 TCP/IP。 Internet (互联网或因特网)则是一个专用名词，指当前全球最大的、开放的、由众多网络 和路由器互连而成的特定计算机网络，它采用TCP/IP 族作为通信规则。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-fd41ad5d48077ba0c967a181c41ac723"
  },
  "doc-2b8a9b3e3f6b51e19fd954018e563258": {
    "content": "27.从 IPv4 向 IPv6 过渡 从IPv4 向IPv6 过渡只能采用逐步演进的办法，同时还必须使新安装的IPv6 系统能够向后兼 容。IPv6 系统必须能够接收和转发IPv4 分组，并且能够为IPv4 分组选择路由。 从 IPv4向IPv6过渡可以采用下列两种策略： 1)双协议栈，是指在一台设备上同时装有 IPv4和IPv6 两个协议栈，分别配置了一个 IPv4 地址和一个 IPv6 地址，因此这台设备既能和IPv4 网络通信，又能和IPv6 网络 通信。双协议栈主机在与 IPv6 主机通信时采用IPv6 地址，而在与 IPv4 主机通信时 采用IPv4 地址，双协议栈主机使用应用层的域名系统 (DNS)获知目的主机采用的 是哪种地址。若DNS 返回的是IPv4 地址，则双协议的源主机就使用IPv4 地址。若 DNS 返回的是IPv6 地址，则双协议栈的源主机就使用IPv6 地址。 2)隧道技术，是指在IPv6 数据报要进入 IPv4 网络时，把整个IPv6 数据报封装成IPv4 数据报的数据部分，使原来的IPv6 数据报就好像在IPv4 网络的隧道中传输。当IPv4 数据报离开 IPv4 网络时，再将其数据部分交给主机的 IPv6 协议。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2b8a9b3e3f6b51e19fd954018e563258"
  },
  "doc-9f4b31637b48d520435417a1be1dfd21": {
    "content": "CSMA/CD协议 载波监听多路访问/冲突检测(CSMA/CD) 协议是CSMA协议的改进方案，适用于总线形网络 或半双工网络环境。对于全双工网络，因为全双工采用两条信道，分别用来发送和接收，在任何 时候，发收双方都可以发送或接收数据，不可能产生冲突，所以不需要CSMA/CD 协议。 载波监听是指每个站点在发送前和发送过程中都必须不停地检测信道，在发送前检测信道是 为了获得发送权，在发送过程中检测信道是为了及时发现发送的数据是否发生冲突。站点要在发 送数据前先监听信道，只有信道空闲时才能发送。 冲突检测 (Collision Detection) 就是边发送边 检测，适配器边发送数据边检测信道上电压的变化情况，当检测到电压的变化幅度超过一定的门 限值时，表明发生了冲突，适配器要立即停止发送数据，等待一段随机时间后再次发送。 CSMA/CD 的工作流程可简单地概括为“先听后发，边听边发，冲突停发，随机重发”。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-9f4b31637b48d520435417a1be1dfd21"
  },
  "doc-463827fa257a27d9bc774ef356cec309": {
    "content": "TCP的拥塞控制 拥塞控制是指防止过多的数据注入网络，保证网络中的路由器或链路不致过载。出现拥塞时，端点并不了解拥塞发生的细节，对通信的端点来说，拥塞往往表现为通信时延的增加。 拥塞控制与流量控制的区别： 拥塞控制是让网络能够承受现有的网络负荷，是一个全局性的过程，涉及所有的主机、所有的路由器，以及与降低网络传输性能有关的所有因素。相反，流量 控制往往是指点对点的通信量的控制，是个端到端的问题(接收端控制发送端),它所要做的是 抑制发送端发送数据的速率，以便使接收端来得及接收。当然，拥塞控制和流量控制也有相似的地方，即它们都通过控制发送方发送数据的速率来达到控制效果。 例如，某个链路的传输速率为10Gb/s, 某大型机向一台PC以1Gb/s的速率传送文件，显然 网络的带宽是足够大的，因而不存在拥塞问题，但如此高的发送速率将导致PC可能来不及接收，因此必须进行流量控制。但若有100万台PC 在此链路上以1Mb/s 的速率传送文件，则现在的问题就变为网络的负载是否超过了现有网络所能承受的范围。 TCP 进行拥塞控制的算法有四种：慢开始、拥塞避免、快重传和快恢复。 发送方在确定发送报文段的速率时，既要考虑接收方的接收能力，又要从全局考虑不要使网 络发生拥塞。因此，除了上节介绍的接收窗口，TCP还要求发送方维持一个拥塞窗口 (cwnd), 其大小取决于网络的拥塞程度，并且动态地变化。发送方控制拥塞窗口的原则：只要网络未出现 拥塞，拥塞窗口就再增大一些，以便把更多的分组发送出去，以提高网络的利用率。但只要网络 出现拥塞，拥塞窗口就减小一些，以减少注入网络的分组数，以缓解网络出现的拥塞。 发送窗口的上限值应取接收窗口rwnd 和拥塞窗口cwnd中较小的一个，即发送窗口的上限值=min[rwnd,cwnd]。接收窗口的大小可根据 TCP报文首部的窗口字段通知发送方，而发送方如何维护拥塞窗口 呢?这就是下面讲解的慢开始和拥塞避免算法。这里假设：数据为单方向传送，对方只传送确认 报文；接收方总是有足够大的缓存空间，因而发送窗口的大小由网络的拥塞程度决定。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-463827fa257a27d9bc774ef356cec309"
  },
  "doc-52aee7f8dcda2139521cf885d71ddc50": {
    "content": "SMTP协议 简单邮件传输协议 (Simple Mail Transfer Protocol,SMTP) 是一种提供可靠且有效的电子邮 件传输的协议，它控制两个相互通信的SMTP 进程交换信息。因为SMTP 采用客户/服务器模式 工作，所以负责发送邮件的SMTP 进程就是SMTP 客户，而负责接收邮件的SMTP 进程就是SMTP服务器。SMTP 用的是 TCP连接，端口号为25。SMTP 通信有以下三个阶段。 (1)连接建立 发件人的邮件发送到发送方邮件服务器的邮件缓存中后，SMTP 客户就每隔一定时间对邮件 缓存扫描一次。如发现有邮件，就与接收方邮件服务器的SMTP 服务器建立 TCP 连 接 ，SMTP服务器使用的熟知端口号为25。连接建立后，接收方SMTP 服务器发出220 Service ready (服务就 绪)。然后SMTP 客户向SMTP 服务器发送HELO 命令，附上发送方的主机名。 SMTP 不使用中间的邮件服务器。TCP 连接总是在发送方和接收方这两个邮件服务器之间直 接建立，而不管它们相隔多远，不管在传送过程中要经过多少个路由器。当接收方邮件服务器因 故障暂时不能建立连接时，发送方的邮件服务器只能等待一段时间后再次尝试连接。 (2)邮件传送 连接建立后，就可开始传送邮件。邮件的传送从MAIL 命令开始，MAIL 命令后面有发件人 的地址。如MAILFROM:<th@hit.edu.cn> 。 若 SMTP 服务器已准备好接收邮件，则回答250 OK。 下面跟着一个或多个RCPT 命令，格式为RCPT TO:<收件人地址>。每发送一个RCPT 命令，都 应有相应的信息从 SMTP 服务器返回，如250 OK 或550 No such user here (无此用户)。 RCPT 命令的作用是，先弄清接收方系统是否已做好接收邮件的准备，然后才发送邮件，以 便不至于发送了很长的邮件后才知道地址错误，进而避免浪费通信资源。 获得OK 的回答后，客户端就使用DATA命令，表示要开始传送邮件的内容。正常情况下， SMTP 服务器返回的信息是354 Start mail input;end with<CRLF>.<CRLF> 。<CRLF>表示回车换 行。此时 SMTP 客户就可开始传送邮件内容，并用<CRLF>.<CRLF>表示邮件内容的结束。 (3)连接释放 邮件发送完毕后，SMTP客户应发送QUIT 命令。SMTP 服务器返回的信息是221(服务关 闭),表示SMTP 同意释放TCP 连接。邮件传送的全部过程就此结束。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-52aee7f8dcda2139521cf885d71ddc50"
  },
  "doc-124f678afe64f6377e862ee0a85ea6bf": {
    "content": "6.差错检测 因为信道噪声等原因，帧在传输过程中可能会出现错误，这些错误分为位错和帧错。 1)位错：帧中某些位出现差错，通常采用循环冗余检验 (CR C) 来发现位错。 2)帧错：帧丢失、帧重复或帧失序等错误，它们都属于传输差错。 过去 OSI 的观点是：必须让数据链路层向上提供可靠传输。因此在CRC 检错的基础上，增加了帧编号、确认和重传机制。收到正确的帧就要向发送方发送确认。发送方在一定期限内若未 收到对方的确认，就认为出现了差错，因此进行重传，直到收到确认为止。现在，在通信质量较 差的无线传输中，数据链路层依然使用确认和重传机制，向上提供可靠的传输服务。 对于通信质量良好的有线链路，数据链路层已不再使用确认和重传机制，即不要求向上提供 可靠传输的服务，而仅需进行CRC 检错，目的是将有差错的帧丢弃，保证上交的帧都是正确的， 而对出错的帧的重传任务则由高层协议(如传输层TCP) 完成。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-124f678afe64f6377e862ee0a85ea6bf"
  },
  "doc-452a1c28f81d332f1aa5869ef05c8061": {
    "content": "2.异构网络互连 互联网是由全球范围内数以百万计的异构网络互连起来的。这些网络的拓扑结构、寻址方案、 差错处理方法、路由选择机制等都不尽相同。网络层所要完成的任务之一就是实现这些异构网络 的互连。网络互连是指将两个以上的计算机网络，通过一定的方法，用一些中继系统相互连接起 来，以构成更大的网络系统。根据所在的层次，中继系统分为以下4种： 物理层中继系统：转发器，集线器。 2)数据链路层中继系统：网桥或交换机。 3)网络层中继系统：路由器。 4)网络层以上的中继系统：网关。 当使用物理层或数据链路层的中继系统时，只是把一个网络扩大了，而从网络层的角度看， 它仍然是同一个网络， 一般并不称为网络互连。因此，网络互连通常是指用路由器进行网络连接 和路由选择。路由器是一台专用计算机，用于在互联网中进行路由选择。 TCP/IP 在网络互连方面的做法是在网络层采用标准化协议，但相互连接的网络可以是异构 的 。IP 网络的概念如图4. 1所示。图4. 1(a) 表示许多计算机网络通过一些路由器进行互连。因为 参与互连的计算机网络都使用相同的IP, 通过 IP 就可使这些性能各异的网络在网络层上看起来像 是一个统一的网络，所以可把互连后的网络视为如图4.1(b) 所示的一个虚拟互连网络，简称IP 网络。 使用IP 网络的好处是：当IP 网上的主机进行通信时，就好像在单个网络上通信一样，而看 不见互连的各个网络的具体异构细节(如具体的编址方案、路由选择协议等)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-452a1c28f81d332f1aa5869ef05c8061"
  },
  "doc-f96becae64f455966932fb68f2078bea": {
    "content": "9.零比特填充法 零比特填充法允许数据帧包含任意个数的比特，它使用一个特定的比特串01111110来标志一 帧的开始和结束。为了不使数据字段中出现的比特流01111110被误判为帧的首尾 标志，发送方先扫描整个数据字段，每遇到5个连续的“1”,就自动在其后插入一个“0”。经过 这种比特填充后，就可保证数据字段中不会出现6个连续的“1”。接收方执行该过程的逆操作， 即每收到5个连续的“1”,就自动删除后面紧跟的“0”,以恢复原始数据。在数据链路层早期使 用的HDLC 协议中，便是采用这种比特填充的首尾标志法来实现透明传输的。 零比特填充法很容易由硬件来实现，性能优于字节填充法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-f96becae64f455966932fb68f2078bea"
  },
  "doc-5193a12f652f95c1aac91b04abca6036": {
    "content": "12.特殊IP地址 在各类IP 地址中，有些 IP 地址具有特殊用途，不用作主机的IP 地址： ●主机号全为0表示本网络本身，如202.98.174.0。 ●主机号全为1表示本网络的广播地址，也称直接广播地址，如202.98.174.255。 ● 127.x.x.x保留作为本地软件环回测试(Loopback Test)本主机的进程之间的通信用，本主 机不会将目的地址为环回地址的IP 数据报发送到任何网络。 ● 32位全为0,即0.0.0.0,表示本网络上的本主机(见DHCP)。 ● 32位全为1,即255.255.255.255,表示受限广播地址，只在本网络上进行广播。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5193a12f652f95c1aac91b04abca6036"
  },
  "doc-f8a9d0be028c5c409c722c2f24f99a36": {
    "content": "4.奈奎斯特定理(奈氏准则) 具体的信道所能通过的频率范围总是有限的。信号中的许多高频分量往往不能通过信道， 否则在传输中就会衰减，导致接收端收到的信号波形失去码元之间的清晰界限，这种现象称为 码间串扰。奈奎斯特定理规定：在理想低通(没有噪声、带宽有限)信道中，为了避免码间串 扰，极限码元传输速率为2W波特，其中 W是信道的频率带宽(单位为Hz) 。 若用V表示每个 码元的离散电平数量(码元的离散电平数量是指有多少种不同的码元，若有16种不同的码元， 则需要4个二进制位，因此数据传输速率是码元传输速率的4倍),则极限数据传输速率为 理想低通信道的极限数据传输速率=2Wlog₂V (单位为b/s) 对于奈氏准则，有以下结论： 1)在任何信道中，码元传输速率是有上限的。若传输速率超过上限，则会出现严重的码间 串扰问题，使得接收端无法完全正确地识别码元。 2)信道的带宽越大，则传输码元的能力越强。 3)奈氏准则给出了码元传输速率的限制，但并未限制信息传输速率，即未对一个码元最多 可以携带多少比特给出限制。 因为码元传输速率受奈氏准则制约，所以要提高数据传输速率，就要设法使每个码元携带更 多比特的信息量，此时需要采用多元制的调制方法。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-f8a9d0be028c5c409c722c2f24f99a36"
  },
  "doc-e2d2f7b7b6ece2f9d71b50eb3ba2aef0": {
    "content": "5.香农定理 实际的信道会有噪声，噪声是随机产生的。香农定理给出了带宽受限且有高斯噪声干扰的信 道的极限数据传输速率，当用该速率传输数据时，不会产生误差。香农定理定义为 信道的极限数据传输速率=Wlog (1+S/N) (单位为b/s) 式中 ，W为信道的频率带宽(单位为Hz),S 为信道内所传输信号的平均功率，N 为信道内的高斯噪声功率。S/N 为信噪比，即信号的平均功率与噪声的平均功率之比，信噪比有两种表示形式： 无单位记法和分贝 (dB) 记法。当采用无单位记法时，信噪比=S/N; 当采用分贝记法时，信噪比 = 10log₁o(S/N)(单位为dB), 例如，当S/N=1000 时，信噪比为30dB。注意，在使用香农定 理计算信道的极限数据传输速率时，信噪比应采用无单位记法。 对于香农定理，有以下结论： 1)信道的带宽或信道中的信噪比越大，信息的极限传输速率越高。 2)对一定的传输带宽和一定的信噪比，信息传输速率的上限是确定的。 3)只要信息传输速率低于信道的极限传输速率，就能找到某种方法实现无差错的传输。 4)香农定理得出的是极限信息传输速率，实际信道能达到的传输速率要比它低不少。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e2d2f7b7b6ece2f9d71b50eb3ba2aef0"
  },
  "doc-4a4a1496c168f55f972a177b1a5aaa56": {
    "content": "4.虚电路 在虚电路方式中，当两台计算机进行通信时，应当先建立网络层的连接，也就是建立一条逻 辑上的虚电路(Virtual Circuit,VC),连接一旦建立，就固定了虚电路对应的物理路径。与电路 交换类似，整个通信过程分为三个阶段：虚电路建立、数据传输与虚电路释放。 每次建立虚电路时，将一个未用过的虚电路号(VCID) 分配给该虚电路，以区别于本系统 中的其他虚电路，然后双方就沿着已建立的虚电路传送分组。分组的首部仅在连接建立时使用完 整的目的地址，之后每个分组的首部只需携带这条虚电路的编号即可。在虚电路网络中的每个节 点上都维持一张虚电路表，表中每项记录一个打开的虚电路的信息，包括在接收链路和发送链路 上的虚电路号、前一节点和下一节点的标识，它是在虚电路建立过程中确定的。 虚电路方式的工作原理如下所示。 1)数据传输前，主机A 与主机 B 先建立连接，主机A 发出“呼叫请求”分组，该分组通 过中间节点送往主机B,若主机 B 同意连接，则发送“呼叫应答”分组予以确认。 2)虚电路建立后，主机A和主机B 就可相互传送数据分组。 3)传送结束后，主机A通过发送“释放请求”分组来拆除虚电路，逐段断开整个连接。 通过上面的例子，可总结出虚电路服务具有如下特点： 1)虚电路通信链路的建立和拆除需要时间开销，对交互式应用和少量的短分组情况显得很 浪费，但对长时间、频繁的数据交换效率较高。 2)虚电路的路由选择体现在连接建立阶段，连接建立后，就确定了传输路径。 3)虚电路提供了可靠的通信功能，能保证每个分组正确且有序到达。此外，还可对两个端 点的流量进行控制，当接收方来不及接收数据时，可以通知发送方暂缓发送。 4)虚电路有一个致命的弱点，即当网络中的某个节点或某条链路出现故障而彻底失效时， 所有经过该节点或该链路的虚电路将遭到破坏。 5)分组首部不包含目的地址，包含的是虚电路号，相对于数据报方式，其开销小。 虚电路之所以是虚，是因为这条电路不是专用的，每个节点到其他节点之间的链路可能同时 有若干条虚电路通过，也可能同时在多个节点之间建立虚电路。 注意，图4.2所示的数据传输过程是有确认的传输，B 收到分组后要发回相应的确认。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4a4a1496c168f55f972a177b1a5aaa56"
  },
  "doc-672b11a546a2b3bcd7f6cad52a133de7": {
    "content": "29.CSMAVCA 协议的确认机制(2011) 因为无线信道的通信质量远不如有线信道，所以802.11标准使用链路层确认/重传(ARQ) 方案，即站点每通过无线局域网发送完一帧，就要在收到对方的确认帧后才能继续发送下一帧。 可见，802.11标准无线局域网采用的停止-等待协议是一种可靠传输协议。 为了尽量避免冲突，802.11标准规定，所有站检测到信道空闲后，还要等待一段很短的时间 (继续监听)才能发送帧。这段时间称为帧间间隔 (InterFrame Space,IFS) 。 帧间间隔的长短取 决于站点要发送的帧的类型。802.11标准使用了下列三种IFS。 1)SIFS ( 短IFS): 最短的IFS, 用来分隔属于一次对话的各帧，使用SIFS 的帧类型有ACK 帧、CTS 帧、分片后的数据帧，以及所有回答AP 探询的帧等。 2)PIFS (点协调IFS): 中等长度的IFS, 在 PCF 方式中使用。 3)DIFS (分布式协调IFS): 最长的IFS, 在 DCF 方式下用来发送数据帧和管理帧。 802.11标准规定各站在发送数据之前，必须监听信道，只要监听到信道忙，就不能发送数据。 802.11标准还规定各站采用虚拟载波监听机制，即让源站将它要占用信道的持续时间(包括目的 站发回 ACK 帧所需的时间)及时通知给所有其他站，以便使所有其他站在这段时间内都停止发 送，这样就大大减少了冲突的概率。“虚拟载波监听”表示其他站并未监听信道，而是因收到了 源站的通知才不发送数据，这种效果就像是其他站都监听了信道。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-672b11a546a2b3bcd7f6cad52a133de7"
  },
  "doc-2109b69efddaf4ba592c0a1645bcd167": {
    "content": "3.链路管理 数据链路层连接的建立、维持和释放过程称为链路管理，它主要用于面向连接的服务。链路 两端的节点要进行通信，必须首先确认对方已处于就绪状态，并交换一些必要的信息以对帧序号 初始化，然后才能建立连接，在传输过程中要能维持连接，而在传输完毕后要释放该连接。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2109b69efddaf4ba592c0a1645bcd167"
  },
  "doc-28f3a0853572fb49708462f779e9fb14": {
    "content": "P2P模型 在CS 模型中,服务器性能的好坏决定了整个系统的性能，当大量用户请求服务时，服务器就必然成为系统的瓶颈。P2P模型的思想是整个网络中的传输内容不再被保存在中心服务器上，每个节点都同时具有下载、上传的功能，其权利和义务都是大体对等的。 在P2P 模型中，各计算机没有固定的客户和服务器划分。相反，任意一对计算机——称为对 等方(Pe er), 直接相互通信。实际上，P2P 模型从本质上来看仍然使用客户/服务器模型，每个节 点既作为客户访问其他节点的资源，又作为服务器提供资源给其他节点访问。 与C/S 模型相比，P2P模型的优点主要体现如下： 1)减轻了服务器的计算压力，消除了对某个服务器的完全依赖，可以将任务分配到各个节点上，因此大大提高了系统效率和资源利用率。 2)多个客户机之间可以直接共享文档。 3)可扩展性好，传统服务器有响应和带宽的限制，因此只能接受一定数量的请求。 4)网络健壮性强，单个节点的失效不会影响其他部分的节点。 P2P 模型也有缺点。在获取服务的同时，还要给其他节点提供服务，因此会占用较多的内存，影响整机速度。例如，经常进行P2P 下载还会对硬盘造成较大的损伤。据某互联网调研机构统计， 某些年份 P2P 程序占了互联网50%～90%的流量，使网络变得非常拥塞，因此各大ISP (互联网服务提供商，如电信、网通等)通常都对P2P 应用持反对态度。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-28f3a0853572fb49708462f779e9fb14"
  },
  "doc-ef013831c0a3724f44a051ef1a45d285": {
    "content": "3.路由与转发 路由器主要完成两个功能：一是路由选择(确定哪一条路径),二是分组转发 (当一个分组到达时所采取的动作)。前者根据路由选择协议构造并维护路由表。后者处理通过路由器的数据 流，关键操作是转发表查询、转发及相关的队列管理和任务调度等。 1)路由选择。根据路由协议构造路由表，同时经常或定期地与相邻路由器交换信息，获取 网络最新拓扑，动态更新维护路由表，以决定分组到达目的地节点的最优路径。 2)分组转发。 指路由器根据转发表将分组从合适的端口转发出去。 路由表是根据路由选择算法得出的，而转发表是从路由表得出的。转发表的结构应使查找过 程最优化，路由表则需要最优化网络拓扑变化的计算。在讨论路由选择的原理时，往往不区分转 发表和路由表，而笼统地使用路由表一词。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ef013831c0a3724f44a051ef1a45d285"
  },
  "doc-eb52228a86bc0b8a86dd9b02f73e2a03": {
    "content": "11.同轴电缆 同轴电缆由内导体、绝缘层、外导体屏蔽层和绝缘保护套层构成，同轴电缆一般分为两类：①50Ω同轴电缆，主要用于传送基带数字信号，在早期局域网中应用广泛；②75Ω 同轴电缆，主要用于传送宽带信号，在有线电视系统中应用广泛。因为外导体屏蔽层的作用，所 以同轴电缆具有良好的抗干扰特性而被广泛用于传输较高速率的数据。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-eb52228a86bc0b8a86dd9b02f73e2a03"
  },
  "doc-20bb73fe2c922586106075dd78af569f": {
    "content": "TCP报文段首部各个字段的含义 1)源端口和目的端口。各占2B。分别表示发送方和接收方使用的端口号。 命题追踪 TCP 首部中序号、确认号的含义(2009、2016) 2)序号。占4B, 范围为0~2³² -1,共2³2个序号。 TCP 连接中传送的字节流中的每个字节 都要按顺序编号，序号字段值指的是本报文段所发送的数据的第一个字节的序号。 例如，一报文段的序号字段值是301,而携带的数据共有100B, 表明本报文段的数据的 最后一个字节的序号是400,因此下一个报文段的数据序号应从401开始。 3)确认号。 占 4B, 是期望收到对方下一个报文段的第一个数据字节的序号。若确认号为N, 则表明到序号N-1为止的所有数据都已正确收到。 例如，B 正确收到了A 发送过来的一个报文段，其序号字段是501,而数据长度是200B( 序 号501～700),这表明B 正确收到了A 发送的到序号700为止的数据。因此B 期望收到A 的下一个数据序号是701,于是B 在发送给A 的确认报文段中把确认号置为701。 4)数据偏移 (首部长度)。占4位，这里不是IP 数据报分片的那个数据偏移，而是表示首 部长度(首部中还有长度不确定的选项字段),它指出TCP 报文段的数据起始处距离 TCP 报文段的起始处有多远。“数据偏移”的单位是32位(以4B 为计算单位)。因为4位二 进制数能表示的最大值为15,所以TCP 首部的最大长度为60B。 5)保留。 占6位，保留为今后使用，但目前应置为0。 6)紧急位 URG。 当 URG=1 时，表明紧急指针字段有效。它告诉系统此报文段中有紧急数 据，应尽快传送(相当于高优先级的数据)。紧急数据被插入至报文段数据的最前面，而 在紧急数据后面的数据仍是普通数据，因此要与首部中的紧急指针字段配合使用。 7)确认位ACK 。仅当ACK=1 时确认号字段才有效。当ACK=0 时，确认号无效。 TCP 规定，在连接建立后所有传送的报文段都必须把ACK 置1。 8)推送位PSH(Push) 。 两个应用进程进行交互式通信时，都希望在键入一个命令后立即就 能收到对方的响应，此时发送方 TCP 把 PSH 置1,接收方TCP 收到PSH=1 的报文段后， 就尽快交付给接收应用进程，而不再等到整个缓存都填满了后再向上交付。 9)复位位 RST(Reset) 。 当 RST=1 时，表示TCP 连接中出现严重差错(如主机崩溃等), 必须释放连接，然后重新建立传输连接。此外，它还可用于拒绝一个非法的报文段。 10)同步位SYN。当 SYN=1 时表示这是一个连接请求或连接接受报文。 当SYN=1,ACK=0时，表明这是一个连接请求报文，若对方同意建立连接，则应在响应 报文中使用SYN=1,ACK=1 。 11)终止位FIN(Finish) 。用来释放一个连接。当FIN=1时，表明此报文段的发送方的数据 已发送完毕，并要求释放传输连接。 12)窗口。 占2B, 范围为0~2¹⁶-1。窗口值告诉对方，从本报文段首部中的确认号算起，接 收方目前允许对方发送的数据量(以字节为单位)。接收方的数据缓存空间是有限的，因 此窗口值作为接收方让发送方设置其发送窗口的依据。 例如，设确认号是701,窗口字段是1000。这表明，从701号算起，发送此报文段的一 方还有接收1000字节数据(字节序号为701～1700)的接收缓存空间。 13)检验和。占2B 。检验和字段检验的范围包括首部和数据两部分。计算检验和时，和 UDP一样，要在TCP 报文段的前面加上12B 的伪首部(只需将UDP 伪首部的协议字段的17 改成6,UDP 长度字段改成TCP 长度，其他的和 UDP 一样)。 14)紧急指针。占2B。紧急指针仅在URG=1时才有意义，它指出本报文段中的紧急数据的 字节数(紧急数据在报文段数据的最前面)。即使窗口为零，也可以发送紧急数据。 15)选项。长度可变，最长可达40B。当不使用选项时，TCP首部长度是20B 。TCP最初只规定了一种选项，即最大报文段长度(Maximum Segment Size, MSS), 它是TCP 报文段中的数据字段的最大长度。之后又陆续增加了窗口扩大、时间戳等选项，具体请参见教材。 16)填充。这是为了使整个首部长度是4B的整数倍。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-20bb73fe2c922586106075dd78af569f"
  },
  "doc-a8824c1aea800afa58be48a3762992c8": {
    "content": "28. 路由算法 路由选择协议的核心是路由算法，即需要何种算法来获得路由表中的各个项目。路由算法的 目的很简单：给定一组路由器及连接路由器的链路，路由算法要找到一条从源路由器到目的路由 器的“最佳”路径。通常，“最佳”路径是指具有最低费用的路径。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-a8824c1aea800afa58be48a3762992c8"
  },
  "doc-f038f5da30901d2ce42833321f62625e": {
    "content": "8.字节填充法 字节填充法使用特定字节来定界一帧的开始与结束，控制字符SOH 放在帧的最前面，表示帧的开始，控制字符EOT 表示帧的结束。为了使信息位中出现的特殊字符不被误判为帧的首尾定界符，可在特殊字符之前填充一个转义字符ESC 来加以区分(注意，转义字符 是ASCII 码中的控制字符，是一个字符，而非“E”“S”“C”三个字符的组合),以实现数据的透 明传输。接收方收到转义字符后，就知道其后面紧跟的是数据信息，而不是控制信息。 帧的数据段中出现EOT 或 SOH 字符，发送方在每个EOT或SOH 字符前再插入一个ESC 字符, 接收方收到数据后会自己删除这个插入的ESC 字符，结果仍得到原来的数据。这也正是字符填充法名称的由来。若转义字符ESC 也出现在数据中，则解决方法仍是在转义字符前插入一个转义字符。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-f038f5da30901d2ce42833321f62625e"
  },
  "doc-f746800dc318223d381ac24dc0e6b1f0": {
    "content": "套接字 在网络中通过 IP 地址来标识和区别不同的主机，通过端口号来标识和区分一台主机中的不 同应用进程，端口号拼接到 IP 地址就构成套接字 (Soc ket) 。在网络中采用发送方和接收方的套 接字来识别端点。套接字，实际上是一个通信端点，即： 套接字 (Socket)=(IP地址：端口号) ，它唯一地标识网络中的一台主机上的一个应用进程。 在网络通信中，主机A 发给主机 B 的报文包含目的端口号和源端口号，源端口号是“返回地 址”的一部分，即当B 需要发回一个报文给A 时 ，B 到 A 的报文中的目的端口号便是A 到 B 的报 文中的源端口号(完全的返回地址是A 的 IP 地址和源端口号)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-f746800dc318223d381ac24dc0e6b1f0"
  },
  "doc-4c759b9c1f4a3bd192b6f500521adb66": {
    "content": "19.介质访问控制 介质访问控制所要完成的主要任务是，为使用介质的每个节点隔离来自同一信道上其他节点 所传送的信号，以协调活动节点的传输。图3.15是广播信道的通信方式，节点 A、B、C、D、E共享广播信道，假设A 要与C 通 信 ，B 要与D 通信，因为它们共用一条信道，若不加控制，则两 对节点之间的通信可能会因互相干扰而失败。用来决定广播信道中信道分配的协议属于数据链路 层的一个子层，称为介质访问控制 (Medium Access Control,MAC)子层。 常见的介质访问控制方法有信道划分介质访问控制、随机访问介质访问控制和轮询访问介质 访问控制。其中前者是静态划分信道的方法，而后两者是动态分配信道的方法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4c759b9c1f4a3bd192b6f500521adb66"
  },
  "doc-8ae594c4084153ff7f383278dd04f63e": {
    "content": "域名服务器 域名到IP 地址的解析是由运行在域名服务器上的程序完成的，一个服务器所负责管辖的(或 有权限的)范围称为区(小于或等于域),一个区中的所有节点必须是能够连通的，每个区设置 相应的权限域名服务器，用来保存该区中的所有主机的域名到IP 地址的映射。每个域名服务器不 但能够进行一些域名到IP 地址的解析，而且必须具有连向其他域名服务器的信息。当自己不能进 行域名到IP 地址的转换时，能够知道到什么地方去找其他域名服务器。 DNS 使用了大量的域名服务器，它们按层次方式组织。没有一台域名服务器具有因特网上所 有主机的映射，相反，该映射分布在所有的域名服务器上。有4种类型的域名服务器。 1. 根域名服务器 根域名服务器是最高层次的域名服务器，所有的根域名服务器都知道所有的顶级域名服务器 的域名和IP 地址。根域名服务器是最重要的域名服务器，不管是哪个本地域名服务器，要对因特 网上任何一个域名进行解析，只要自己无法解析，就首先要求助于根域名服务器。因特网上有13 个根域名服务器，尽管我们将这13个根域名服务器中的每一个都视为单个服务器，但每个“服务器”实际上是冗余服务器的集群，以提供安全性和可靠性。需要注意的是，根域名服务器用来 管辖顶级域(如.com), 通常它并不直接将待查询的域名直接转换成IP 地址，而是告诉本地域名 服务器下一步应当找哪个顶级域名服务器进行查询 。 2. 顶级域名服务器 这些域名服务器负责管理在该顶级域名服务器注册的所有二级域名。收到DNS 查询请求时， 就给出相应的回答(可能是最后的结果，也可能是下一步应当查找的域名服务器的IP地址) 。 3. 权限域名服务器(授权域名服务器) 每台主机都必须在权限域名服务器处登记。为了更加可靠地工作，一台主机最好至少有两个 权限域名服务器。实际上，许多域名服务器都同时充当本地域名服务器和权限域名服务器。权限 域名服务器总能将其管辖的主机名转换为该主机的IP 地址。 4. 本地域名服务器 本地域名服务器对域名系统非常重要。每个因特网服务提供者 (ISP), 或一所大学，甚至一 所大学中的各个系，都可以拥有一个本地域名服务器。当一台主机发出 DNS 查询请求时，这个 查询请求报文就发送给该主机的本地域名服务器。事实上，我们在Windows 系统中配置“本地连接”时，就需要填写DNS地址，这个地址就是本地DNS (域名服务器)的地址。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8ae594c4084153ff7f383278dd04f63e"
  },
  "doc-5aebc920ddd1c203a2f57f4ddca32e60": {
    "content": "21.IP地址与硬件地址 IP 地址是网络层及网络层之上使用的地址，它是分层式的。硬件地址 (MA C 地址)是数据 链路层使用的地址，它是平面式的。IP 地址放在IP 数据报的首部，而MAC 地址放在MAC 帧的 首部。把IP 数据报封装为 MAC 帧后，数据链路层看不见IP 数据报中的IP 地址。 因为路由器的隔离，IP 网络中无法通过广播MAC 地址来完成跨网络的寻址，所以在网络 层只使用 IP 地址来完成寻址。寻址时，每个路由器依据其路由表(依靠路由协议生成)选择 到目标网络(主机号全为0的网络地址)需要转发到的下一跳(路由器的物理端口号或下一网 络地址),而IP 数据报通过多次路由转发到达目标网络后，改为在目标局域网中通过数据链路 层的MAC 地址以广播方式寻址。这样可以提高路由选择的效率。 下列几个性质是计算机网络的精髓，有必要特别强调： 1)在IP 层抽象的互联网上只能看到IP 数据报。 2)虽然在IP 数据报首部中有源IP地址，但路由器只根据目的IP地址进行转发。 3)在局域网的链路层，只能看见MAC帧 。IP数据报被封装在MAC帧中。通过路由器转发 时 ，IP数据报在每个网络中都被路由器解封装和重新封装，其 MAC帧首部中的源地址 和目的地址会不断改变。这也决定了无法使用MAC地址跨网络通信。 4)尽管互连在一起的网络的硬件地址体系各不相同，但IP层抽象的互联网屏蔽了下层这些 复杂的细节。只要我们在网络层上讨论问题，就能够使用统一的、抽象的IP 地址研究主 机与主机或路由器之间的通信。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5aebc920ddd1c203a2f57f4ddca32e60"
  },
  "doc-13041c4cacbd85f34fd9db4c648a9ca7": {
    "content": "域名系统 域名系统 (Domain Name System,DNS) 是因特网使用的命名系统，用来把便于人们记忆的 具有特定含义的主机名(如www.cskaoyan.com) 转换为便于机器处理的IP 地址。相对于IP 地址，人们更喜欢使用具有特定含义的字符串来标识因特网上的计算机。DNS系统采用客户/服务器模型，其协议运行在UDP 之上，使用53号端口。 从概念上可将DNS 分为三部分：层次域名空间、域名服务器和解析器。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-13041c4cacbd85f34fd9db4c648a9ca7"
  },
  "doc-0521f3bc9331aa3d7662dc79770a2de4": {
    "content": "19.路由聚合 一个大的CIDR 地址块中包含很多小地址块，因此在路由表中就可利用较大的一个CIDR地 址块来代替许多较小的地址块。这种方法称为路由聚合，它使得路由表中的一个项目可以表示原 来传统分类地址的多条路由项目，压缩了路由表所占的空间，从而提高了网络性能。 最长前缀匹配(也称最佳匹配): 使用CIDR 时，路由表中的表项由“网络前缀”和\"下一跳地址”组成。在查找路由表时可能会得到不止一个匹配结果。此时，应当从匹配结果中选择具 有最长网络前缀的路由，因为网络前缀越长，其地址块就越小，因而路由就越具体。 CIDR 查找路由表的方法：为了更有效地查找最长前缀匹配，通常将无分类编址的路由表存 放在一种层次式数据结构(通常采用二叉线索)中，然后自上而下地按层次进行查找。 CIDR 的优点在于网络前缀长度的灵活性。因为上层网络的前缀长度较短，所以相应的路由 表的项目较少。而内部又可采用延长网络前缀的方法来灵活地划分子网。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0521f3bc9331aa3d7662dc79770a2de4"
  },
  "doc-740043ec1153417d3eebaa494d90cd2b": {
    "content": "快重传和快恢复算法 有时个别报文段会在网络中丢失，但实际上网络并未发生拥塞。若发送方迟迟收不到确认， 就会产生超时，并误认为网络发生了拥塞，这就导致发送方错误地启动慢开始算法，从而降低传 输效率。采用快重传算法可以让发送方尽早知道发生了个别报文段的丢失。 (1)快重传 快重传算法是使发送方尽快(尽早)进行重传，而不等超时计时器超时再重传。这就要求接 收方不要等待自己发送数据时才进行捎带确认，而要立即发送确认，即使收到了失序的报文段也 要立即发出对已收到报文段的重复确认。发送方一旦连续收到3个冗余ACK (重复确认),就立 即重传相应的报文段，而不是等该报文段的超时计时器超时再重传。 (2)快恢复 快恢复算法的原理如下：当发送方连续收到3个冗余 ACK (重复确认)时，执行“乘法减 小”方法，把慢开始门限 ssthresh 调整为当前 cwnd 的一半。这是为了预防网络发生拥塞。但发送 方现在认为网络很可能没有发生(严重)拥塞，否则就不会有几个报文段连续到达接收方，也不 会连续收到重复确认。因此与慢开始算法的不同之处是，它把 cwnd 值也调整为当前cwnd 的一半 (等于ssthresh 值),然后开始执行拥塞避免算法(\"加法增大\"),使拥塞窗口缓慢地线性增大。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-740043ec1153417d3eebaa494d90cd2b"
  },
  "doc-0cb26282bf2e5da7a85c0bacfde3e99e": {
    "content": "34.以太网的传输介质与网卡 以太网常用的传输介质有4种：粗缆、细缆、双绞线和光纤。 计算机与外界局域网的连接是通过主板上嵌入的一块网络适配器 (Adapter ) [也称网络接口卡 (Network Interface Card,NIC)]实现的。适配器上装有处理器和存储器，工作在数据链路层。适 配器和局域网的通信是通过电缆或双绞线以串行方式进行的，而适配器和计算机的通信则是通过 计算机的I/O 总线以并行方式进行的。因此，适配器的重要功能就是进行数据的串并转换。 适配器不仅能实现与局域网传输介质之间的物理连接和电信号匹配，还涉及帧的发送与接 收、帧的封装与拆封、介质访问控制、数据的编码与解码及数据缓存等功能。当适配器收到正确 的帧时，就使用中断来通知该计算机，并交付协议栈中的网络层。当计算机要发送IP 数据报时， 就由协议栈把IP 数据报向下交给适配器，组帧后发送到局域网。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0cb26282bf2e5da7a85c0bacfde3e99e"
  },
  "doc-ba22fc744317f0871bc093f62c94a231": {
    "content": "24.网际控制报文协议ICMP 为了有效地转发 IP 数据报和提高交付成功的机会，在网络层使用了网际控制报文协议 (Intemet Control Message Protocol,ICMP),让主机或路由器报告差错和异常情况。ICMP报文被 封装在IP 数据报中发送，但ICMP 不是高层协议，而是网络层的协议。 ICMP 报文有两种，即ICMP 差错报告报文和 ICMP 询问报文。 ICMP 差错报告报文用于目标主机或到目标主机路径上的路由器，向源主机报告差错和异常 情况。共有以下5种常用的类型： 1)终点不可达。 当路由器或主机不能交付数据报时，就向源点发送终点不可达报文。 2)源点抑制。当路由器或主机因为拥塞而丢弃数据报时，就向源点发送源点抑制报文，使源点知道应当把数据报的发送速率放慢。 3)时间超过。当路由器收到一个数据报时，会将其首部中生存时间 (TTL) 的值减1。若结果不为0,则路由器将该数据报转发出去。若结果为0,则路由器不但要丢弃该数据报，而且要向源点发送时间超过报文。当终点在预先规定的时间内不能收到一个数据报的全 部数据报片时，就把已收到的数据报片都丢弃，并向源点发送时间超过报文。 4)参数问题。当路由器或目的主机收到的数据报的首部中有的字段(注意不是任意字段) 的值不正确时，就丢弃该数据报，并向源点发送参数问题报文。 5)改变路由(重定向)。路由器把改变路由报文发送给主机，让主机知道下次应将数据报发送给另外的路由器(可通过更好的路由)。 对于以下几种情况，不应发送 ICMP 差错报告报文： 1 ) 对ICMP 差错报告报文，不再发送ICMP 差错报告报文。 2)对第一个分片的数据报片的所有后续数据报片，都不发送ICMP 差错报告报文。 3)对具有多播地址的数据报，都不发送ICMP 差错报告报文。 4)对具有特殊地址(如127.0.0.0或0.0.0.0)的数据报，不发送ICMP 差错报告报文。 常用的ICMP 询问报文有两种类型： 1)回送请求和回答报文。用来测试目的主机是否可达以及了解其有关状态。 2)时间戳请求和回答报文。利用报文中记录的时间戳，发送方可计算出当前的往返时延。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-ba22fc744317f0871bc093f62c94a231"
  },
  "doc-c8f3d2373147341871d12f8cdb9a5d16": {
    "content": "传输层的功能 数据链路层提供链路上相邻节点之间的逻辑通信，网络层提供主机之间的逻辑通信。传输层 位于网络层之上、应用层之下，它为运行在不同主机上的进程之间提供逻辑通信①。传输层属于 面向通信部分的最高层，同时也是用户功能中的最低层。显然，即使网络层协议不可靠(网络层 协议使分组丢失、混乱或重复),传输层同样能为应用程序提供可靠的服务。 从图5.1可看出，网络的边缘部分的两台主机使用网络的核心部分的功能进行端到端的通信 时，只有主机的协议栈才有传输层，而路由器在转发分组时都只用到下三层的功能(在通信子网 中没有传输层，传输层只存在于通信子网以外的主机中)。传输层的功能如下。 1）. 应用进程之间的逻辑通信 从网络层来说，通信的双方是两台主机，IP 数据报的首部给出了这两台主机的IP 地址。但 “两台主机之间的通信”实际上是两台主机中的应用进程之间的通信。应用进程之间的通信也称 端到端的逻辑通信。IP 虽然能把分组送到目的主机，但这个分组还停留在主机的网络层，而没有 交付给主机中的进程。从传输层来看，通信的真正端点不是主机而是主机中的进程。 2）. 复用和分用 复用是指发送方不同的应用进程都可以使用同一个传输层协议传送数据。分用是指接收方的 传输层在剥去报文的首部后能够把这些数据正确交付到目的应用进程。 3）. 差错检测 传输层要对收到的报文(首部和数据部分)进行差错检测。对于TCP, 若接收方发现报文段 出错，则要求发送方重发该报文段。对于UDP, 若接收方发现数据报出错，则直接丢弃。在网络 层 ，IP 数据报首部中的检验和字段只检验首部是否出错，而不检查数据部分。 4）. 提供面向连接和无连接的传输协议 传输层向高层用户屏蔽了低层网络核心的细节(如网络拓扑、路由协议等),它使应用进程 看见的是在两个传输层实体之间好像有一条端到端的逻辑通信信道，这条逻辑通信信道对上层的表现却因传输层协议不同而有很大的差别。当传输层采用面向连接的TCP 时，尽管下面的网络是 不可靠的(只提供尽最大努力的服务),但这种逻辑通信信道就相当于一条全双工的可靠信道。 但当传输层采用无连接的UDP 时，这种逻辑通信信道仍然是一条不可靠信道。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c8f3d2373147341871d12f8cdb9a5d16"
  },
  "doc-eeb7136306177f890bbbf6e655857c68": {
    "content": "42.以太网交换机 交换机的原理： 以太网交换机也称二层交换机，二层是指以太网交换机工作在数据链路层。以太网交换机实 质上是一个多接口的网桥，它能将网络分成小的冲突域，为每个用户提供更大的带宽。对于传统 使用集线器的共享式10Mb/s 以太网，若共有N 个用户，则每个用户的平均带宽为总带宽(10Mb/s) 的1/N。 使用以太网交换机(全双工方式)连接这些主机时，虽然从每个接口到主机的带宽还是 10Mb/s, 但是因为一个用户通信时是独占带宽的(而不是和其他网络用户共享传输介质带宽的), 所以拥有N 个接口的交换机的总容量为N×10Mb/s。这正是交换机的最大优点。以太网交换机的特点： 1)当交换机的接口直接与主机或其他交换机连接时，通常都工作在全双工方式。 2)交换机具有并行性，能同时连通多对接口，使每对相互通信的主机都能像独占通信介质 那样，无冲突地传输数据，这样就不需要使用CSMA/CD 协议。 3)当交换机的接口连接集线器时，只能使用 CSMA/CD 协议且只能工作在半双工方式。当 前的交换机和计算机中的网卡都能自动识别上述两种情况。 4)交换机是一种即插即用设备，其内部的帧转发表是通过自学习算法，基于网络中各主机 间的通信，自动地逐渐建立的。 5)交换机因为使用专用交换结构芯片，交换速率较高。 以太网交换机主要采用两种交换模式： 1)直通交换方式。接收到帧的同时就立即按该帧的目的MAC 地址决定转发接口。这种方式 的转发时延非常小，缺点是不检查差错就直接转发，因此可能将一些无效帧转发给其他 站。直通交换方式不适用于需要速率匹配、协议转换或差错检测的线路。 2)存储转发交换方式。 首先缓存接收到的帧，然后检查帧是否正确(可能还需要进行速率 匹配或协议转换),确认无误后，根据目的MAC 地址决定转发接口；若帧出错，则将其 丢弃。优点是可靠性高，且支持不同速率接口间的转换，缺点是时延较大。 交换机一般都具有多种速率的接口，如10Mb/s、100Mb/s 的接口，以及多速率自适应接口。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-eeb7136306177f890bbbf6e655857c68"
  },
  "doc-48063a7c317ce6fdac84b05196bda8af": {
    "content": "2.计算机网络的组成 从不同的角度看，可将计算机网络的组成分为如下几类。 1)从组成部分看，计算机网络主要由硬件、软件、协议三大部分组成。硬件主要由主机(也 称端系统)、通信链路(如双绞线、光纤)、交换设备(如路由器、交换机等)和通信 处理机(如网卡)等组成。软件主要包括各种实现资源共享的软件和方便用户使用的各 种工具软件(如E-mail 程序、FTP 程序、聊天程序等)。协议是计算机网络的核心，如同 交通规则制约汽车驾驶一样，协议规定了网络传输数据时所遵循的规范。 2)从工作方式看，计算机网络(这里主要指Internet, 即互联网)可分为边缘部分和核心部 分。边缘部分由所有连接到互联网上的供用户直接使用的主机组成，用来进行通信(如 传输数据、频或视频)和资源共享；核心部分由大量网络和连接这些网络的路由组成， 它为边缘部分提供连通性和交换服务。 3)从功能组成看，计算机网络由通信子网和资源子网组成。通信子网由各种传输介质、通 信设备和相应的网络协议组成，它使网络具有数据传输、交换、控制和存储的能力，实 现联网计算机之间的数据通信。资源子网是实现资源共享功能的设备及其软件的集合， 向网络用户提供共享其他计算机上的硬件资源、软件资源和数据资源的服务。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-48063a7c317ce6fdac84b05196bda8af"
  },
  "doc-91e8fdad419900769a30727553786231": {
    "content": "7.计算机网络的性能指标 性能指标从不同方面度量计算机网络的性能。常用的性能指标如下。 1)速率 (Speed)。指连接到网络上的节点在数字信道上传送数据的速率，也称数据传输速 率、数据率或比特率，单位为 b/s(比特/秒)或bit/s(有时也写为bps)。当数据率较高时，可用kb/s(k=10³) ,Mb/s(M=10⁶)或Gb/s(G=109)表示。 2)带宽(Bandwidth)。带宽原本表示通信线路允许通过的信号频率范围，单位是赫兹(Hz)。但在计算机网络中，带宽表示网络的通信线路所能传送数据的能力，是数字信道所能传 送的“最高数据传输速率”的同义语，单位是比特/秒 (b/s)。 3)吞吐量( Throughput)。指单位时间内通过某个网络(或信道、接口)的实际数据量。吞吐量常用于对实际网络的测量，以便获知到底有多少数据量能够通过网络。 4)时延(Del ay)。指数据(一个报文或分组)从网络(或链路)的一端传送到另一端所需的总时间，它由4部分构成：发送时延、传播时延、处理时延和排队时延。 ●发送时延，也称传输时延。节点将分组的所有比特推向链路所花的时间，即从发送分组的第一个比特算起，到该分组的最后一个比特发送完毕所花的时间。 发送时延=分组长度/发送速率 ●传播时延。 电磁波在信道(传输介质)中传播一定的距离所花的时间，即一个比特 从链路的一端传播到另一端所需的时间。 传播时延=信道长度/电磁波在信道上的传播速率 区分传输时延和传播时延。传输时延是节点将分组推向网络所需的时间，它取决于分组长度和发送 速率。传播时延是一个比特从一个节点传播至另一节点所需的时间，它取决于两个节点之间距离和信道所使用的传输介质，而与分组长度或发送速率无关。 ●处理时延。分组在交换节点为存储转发而进行的一些必要处理所花的时间。例如，分析分组的首部、差错检验或查找合适的路由等。 ●排队时延。分组在路由器的输入队列或输出队列中排队等待所花的时间。 因此，数据在网络中经历的总时延就是以上4部分时延之和： 总时延=发送时延+传播时延+处理时延+排队时延 在考试中，通常不用考虑处理时延和排队时延(除非另有说明)。 5)时延带宽积。指发送端发送的第一个比特即将到达终点时，发送端已发出了多少比特， 也称以比特为单位的链路长度，即时延带宽积=传播时延×信道带宽。 6)往返时延 (Round-Trip Time,RTT)。指从发送端发出一个短分组，到发送端收到来自接 收端的确认(接收端收到数据后立即发送确认)总共经历的时间。在互联网中，往返时 延还包括各中间节点的处理时延、排队时延及转发数据时的发送时延。 7)信道利用率。用来指出某个信道有百分之多少的时间是有数据通过的。 信道利用率=有数据通过的时间/(有数据通过的时间+无数据通过的时间)信道利用率并非越高越好，信道利用率太低会浪费网络资源；信道利用率太高会产生较 大的时延，导致网络拥塞。这就好比当公路上的车流量很大时，容易出现拥堵。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-91e8fdad419900769a30727553786231"
  },
  "doc-89493c0ca63b6b323e20f543d0988ba0": {
    "content": "路由选择协议分类 1. 内部网关协议 (Interior Gateway Protocol,IGP) 内部网关协议即在一个自治系统内部使用的路由选择协议，它与在互联网中的其他自治系统 选用什么路由选择协议无关。目前这类路由选择协议使用得最多，如RIP 和OSPF。 2. 外部网关协议 (External Gateway Protocol,EGP) 若源主机和目的主机处在不同的自治系统中(两个自治系统可能使用不同的 IGP), 则当数 据报传到一个自治系统的边界时，就需要使用一种协议将路由选择信息传递到另一个自治系统 中。这样的协议就是外部网关协议。目前使用最多的外部网关协议是BGP-4。 自治系统之间的路由选择也称域间路由选择，自治系统内部的路由选择也称域内路由选择。 图4.16是两个自治系统互连的示意图。每个自治系统自己决定在本自治系统内部运行哪个内 部网关协议(可以是RIP 或 OSPF) 。 但每个自治系统都有一个或多个路由器(图中的路由器 R1 和R2) 除运行本系统的内部网关协议外，还要运行外部网关协议(如BGP-4)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-89493c0ca63b6b323e20f543d0988ba0"
  },
  "doc-3aeacef0a6ca3fd5e102a1808d47e884": {
    "content": "RIP的优缺点 RIP 的优点： 1)实现简单、开销小、收敛过程较快。 2)若一个路由器发现了更短的路由，则这种更新信息就传播得很快，在较短时间内便可被 传至所有路由器，俗称 “好消息传播得快”。 RIP的缺点： 1)RIP限制了网络的规模，它能使用的最大距离为15(16表示不可达)。 2)路由器之间交换的是路由器中的完整路由表，因此网络规模越大，开销也越大。 3)当网络出现故障时，路由器之间需反复多次交换信息才能完成收敛，要经过较长时间才 能将故障消息传送到所有路由器 (慢收敛现象),俗称坏消息传播得慢。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-3aeacef0a6ca3fd5e102a1808d47e884"
  },
  "doc-327048b1420ca42a4a95c708fe9bd0c2": {
    "content": "3.电路交换 最典型的电路交换网是传统电话网，从通信资源分配的角度看，交换就是按照某种方式动态地分配传输线路的资源。电路交换分为三步：建立连接(开始占用通信资源)、传输数据(一直占用通信资源)和释放连接(归还通信资源)。在进行数据传输前，两个用户之间必须先建立一条专用的物理通信路径(由通信双方之间的交换设备和链路逐段连接而成)。在数据传输过程中，这一物理通信路径始终被两个用户独占，直到通信结束后才被释放。 在电路交换中，电路建立后，除源节点和目的节点外，电路上的任何节点都采取“直通方式” 发送数据和接收数据，即不存在存储转发所耗费的时间。在电路交换的整个通信阶段，比特流连 续地从源节点直达目的节点，就好像在一个管道中传送。 电路交换技术的优点： 1)通信时延小。因为通信线路为通信双方专用，数据直达，所以传输速率高。 2)有序传输。 双方通信时按发送顺序传送数据，不存在失序问题。 3 ) 没 有 冲 突。不同的通信双方拥有不同的信道，不会出现争用物理信道的问题。 4 ) 实 时 性 强。通信双方之间的物理通路一旦建立，双方就可随时通信。 电路交换技术的缺点： 1)建立连接时间长。电路交换的平均连接建立时间对计算机通信来说太长。 2)线路利用率低。物理通路被通信双方独占，即使线路空闲，也不能供其他用户使用。 3 ) 灵 活 性 差。物理通路中的任何一点出现故障，就必须重新拨号建立新的连接。 4)难以实现差错控制。 中间节点不具备存储和检验数据的能力，无法发现并纠正错误。 计算机之间的数据传送往往是突发式(高频、少量)的，当使用电路交换来传送数据时，已 被用户占用的通信线路资源在绝大部分时间里都是空闲的，其利用率往往不到10%甚至1%。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-327048b1420ca42a4a95c708fe9bd0c2"
  },
  "doc-3180a25741105031630bc39816af71b0": {
    "content": "7.拥塞控制 因出现过量的分组而引起网络性能下降的现象称为拥塞。判断网络是否进入拥塞状态的方 法是，观察网络的吞吐量与网络负载的关系：若随着网络负载的增加，网络的吞吐量明显小于正 常的吞吐量，则网络就可能已进入轻度拥塞状态；若网络的吞吐量随着网络负载的增大而下降， 则网络就可能已进入拥塞状态。拥塞控制主要解决的问题是如何获取网络中发生拥塞的信息，从 而利用这些信息进行控制，以避免因拥塞而出现分组的丢失。 拥塞控制的作用是确保网络能够承载所达到的流量，这是一个全局性的过程，涉及网络中所 有的主机、路由器及导致网络传输能力下降的所有因素。单一地增加资源并不能解决拥塞。 与流量控制的区别：流量控制往往是指在发送方和接收方之间的点对点通信量的控制。流量 控制所要做的是抑制发送方发送数据的速率，以便使接收方来得及接收。 拥塞控制的方法有两种： 1)开环控制。在设计网络时事先将有关发生拥塞的因素考虑周到，力求网络在工作时不产 生拥塞。这是一种静态的预防方法。 一旦整个系统启动并运行，中途就不再需要修改。 开环控制手段包括确定何时可接收新流量、何时可丢弃分组及丢弃哪些分组，确定何种 调度策略等。所有这些手段的共性是，在做决定时不考虑当前网络的状态。 2)闭环控制。事先不考虑有关发生拥塞的各种因素，采用监测网络系统去监视，及时检测 哪里发生了拥塞，然后将拥塞信息传到合适的地方，以便调整网络系统的运行，并解决 出现的问题。闭环控制是基于反馈环路的概念，是一种动态的方法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-3180a25741105031630bc39816af71b0"
  },
  "doc-4e2b7a3b6ee26a95e658864cfabe2311": {
    "content": "4.封装成帧与透明传输 封装成帧是指在一段数据的前后分别添加首部和尾部，构成帧，帧是数据链路层的传送单元。 帧长等于帧的数据部分长度加上首部和尾部的长度。首部和尾部中含有很多控制信息，它们的一 个重要作用是确定帧的界限，即帧定界。接收方能从接收到的二进制比特流中区分出帧的开始与 结束。如在HDLC 协议中，用标识位F(01111110) 来标识帧的开始和结束。在通信过程中，检 测到帧标识位F 即认为其是帧的开始，然后一旦检测到帧标识位F 即表示帧的结束。HDLC 标准 帧格式如图3.4所示。为了提高帧的传输效率，应当使帧的数据部分的长度尽可能地大于首部和 尾部的长度，但随着帧长的增加，传输差错发生的概率也随之提高，发生差错时重传的代价也越 大，因此每种链路层协议都规定了帧的数据部分的长度上限，即最大传送单元。 透明是一个重要的计算机术语，它表示某个实际存在的事物看起来不存在一样。若在数据中 恰好出现与帧定界符相同的比特组合(会误认为“传输结束”而丢弃后面的数据),则要采取有 效的措施来解决这个问题，即透明传输。透明传输是指不论什么样的比特组合的数据，都能够按 照原样无差错地在这个数据链路上传输。因此，对所传送的数据来说，它看不见数据链路层有什 么妨碍数据传输的东西。也就是说，数据链路层对这些数据来说是透明的。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-4e2b7a3b6ee26a95e658864cfabe2311"
  },
  "doc-79fa3daf5b1b04c98384ec68b90f035a": {
    "content": "TCP的流量控制 流量控制的功能就是让发送方的发送速率不要太快，以便让接收方来得及接收，因此可以说流量控制是一个速度匹配服务(匹配发送方的发送速率与接收方的读取速率)。 TCP 利用滑动窗口机制来实现流量控制，滑动窗口的基本原理已在第3章中介绍过，这里要介绍的是TCP 如何使用窗口机制来实现流量控制。 TCP要求接收方维持一个接收窗口(rwnd), 接收方根据当前接收缓存的大小，动态地调整接收窗口的大小，其大小反映了接收方的容量。接 收方将其放在TCP 报文段首部中的“窗口”字段，以通知发送方。发送方的发送窗口不能超过接收方给出的接收窗口值，以限制发送方向网络注入报文的速率。 假设数据只从A发往B, 而B仅向A发送确认报文段，则B 可通过设置确认报文段首部中的窗口字段来将rwnd 通知给A。rwnd即接收方允许连续接收的能力，单位是字节。发送方A 总是根据最新收到的rwnd 值来限制自己发送窗口的大小，从而将未确认的数据量控制在rwnd大小之内，保证A不会使B 的接收缓存溢出。设A向B发送数据，在连接建立时，B告诉A: “我的接收窗口rwnd=400”。接收方B 进行了三次流量控制，这三个报文段都设置了ACK=1, 只有在ACK=1时确认号字段才有意义。第一次把窗口减到rwnd=300, 第二次又减到rwnd=100, 最后减到rwnd=0, 即不允许发送方再发送数据。 这使得发送方暂停发送的状态将持续到B 重新发出一个新的窗口值为止。 TCP 为每个连接设有一个持续计时器，只要发送方收到对方的零窗口通知，就启动持续计时 器。若计时器超时，就发送一个零窗口探测报文段，而对方就在确认这个探测报文段时给出现在 的窗口值。若窗口仍然为零，则发送方收到确认报文段后就重新设置持续计时器。 传输层和数据链路层的流量控制的区别是：传输层实现的是端到端，即两个进程之间的流量 控制；数据链路层实现的是两个中间的相邻节点之间的流量控制。此外，数据链路层的滑动窗口 协议的窗口大小不能动态变化，传输层的窗口大小则可以动态变化。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-79fa3daf5b1b04c98384ec68b90f035a"
  },
  "doc-0a5a21c871858bbf9575fa15feaee0a8": {
    "content": "20.网络层转发分组的过程 分组转发都是基于目的主机所在网络的，这是因为互联网上的网络数远小于主机数，这样可 以极大地压缩转发表的大小。当分组到达路由器后，路由器根据目的IP 地址的网络前缀来查找转 发表，确定下一跳应当到哪个路由器。因此，在转发表中，每条路由必须有下面两条信息：(目的网络地址，下一跳地址) 这样，IP 数据报最终一定可以找到目的主机所在目的网络上的路由器(可能要通过多次间接 交付),当到达最后一个路由器时，才试图向目的主机进行直接交付。 采用 CIDR 编址时，若一个分组在转发表中可以找到多个匹配的前缀，则应当使用最长前缀 匹配。为了更快地查找转发表，可以按照前缀的长短，将前缀最长的排在第1行，按前缀长度的 降序排列。这样，从第1行最长的开始查找，只要检索到匹配的，就不必再继续查找。 此外，在路由表中还可以增加两种特殊的路由： 1)特定主机路由：对特定目的主机的IP 地址专门指明一个路由，以方便网络管理员控制和 测试网络。若特定主机的IP 地址是a.b.c.d, 则转发表中对应项的目的网络是a.b.c.d/32。 /32表示的子网掩码没有意义，但是，这个特殊的前缀可以用在转发表中。 2)默认路由：用特殊前缀0.0.0.0/0表示默认路由，全0掩码和任何目的地址进行按位与运 算，结果必然为全0,即必然和前缀0.0.0.0/0相匹配。只要目的网络是其他网络(不在转发表中),就一律选择默认路由。默认路由通常用于路由器到互联网的路由，互联网包括 无数的网络集合，不可能在路由表项中一一列出，因此只能采用默认路由的方式。 特定主机路由条目的匹配优先级最高，默认路由条目的匹配优先级最低。 综上所述，归纳出路由器执行的分组转发算法如下： 1)从收到的IP 分组的首部提取目的主机的IP 地址D (目的地址)。 2)若查找到特定主机路由(目的地址为D), 则按照这条路由的下一跳转发分组；否则从转 发表中的下一条(按前缀长度的顺序)开始检查，执行步骤3)。 3)将这一行的子网掩码与目的地址D 逐位“与” (AND 操作)。若运算结果与本行的前缀 匹配，则查找结束，按照“下一跳”指出的进行处理(或者直接交付本网络上的目的主 机，或通过指定接口发送到下一跳路由器)。否则，若转发表还有下一行，则对下一行进 行检查，重新执行步骤3)。否则，执行步骤4)。 4)若转发表中有一个默认路由，则把分组传送给默认路由；否则，报告转发分组出错。 值得注意的是，转发表(或路由表)并没有给分组指明到某个网络的完整路径(先经过哪个 路由器，后经过哪个路由器等)。转发表指出，到某个网络应当先到某个路由器(下一跳路由器), 到达下一跳路由器后，再继续查找其转发表，知道再下一步应当到哪个路由器。这样一步一步地 查找下去，直到到达目的网络。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0a5a21c871858bbf9575fa15feaee0a8"
  },
  "doc-74696275a43cf6de7f70e953dbd8cd72": {
    "content": "开放最短路径优先协议（OSPF） OSPF 协议是使用分布式链路状态路由算法的典型代表，也是内部网关协议 (IGP) 的 一种。 与 RIP相比 ，OSPF有下面4个主要特点： 1)OSPF使用洪泛法向本自治系统中所有路由器发送信息，路由器通过所有输出端口向所有 相邻的路由器发送信息，而每个相邻的路由器又将此信息发往所有的相邻路由器(但不再发送给刚刚发来信息的那个路由器)。这样，最终整个区域中所有的路由器都得到了这个信息的一个副本。而RIP仅仅向自己相邻的几个路由器发送信息。 2)发送的信息是与本路由器相邻的所有路由器的链路状态，但是，这只是路由器所知道的 部分信息。而在RIP中，发送的信息是本路由器所知道的全部信息，即整个路由表。 3)只有当链路状态发生变化时，路由器才用洪泛法向所有路由器发送此信息，并且更新过 程收敛得快，不会出现 RIP “坏消息传得慢”的问题。而在 RIP 中，不管网络拓扑是否 发生变化，路由器之间都要定期交换路由表的信息。 4)OSPF是网络层协议，它不用UDP或 TCP, 而直接用IP 数据报传送(其IP数据报首部的协议字段为89)。而 RIP 是应用层协议，它在传输层使用UDP。 除以上区别外，OSPF 还有以下特点： 1)OSPF允许对每条路由设置成不同的代价，对于不同类型的业务可计算出不同的路由。 2)若到同一个目的网络有多条相同代价的路径，则可将通信量分配给这几条路径。 3)OSPF 分组具有鉴别功能，从而保证仅在可信赖的路由器之间交换链路状态信息。 4)OSPF 支持可变长度的子网划分和无分类编址CIDR。 5)每个链路状态都带上一个32位的序号，序号越大，状态就越新。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-74696275a43cf6de7f70e953dbd8cd72"
  },
  "doc-c1e8cd306816c9f8974fb42aafc0a5df": {
    "content": "8.数字数据调制为模拟信号 数字数据调制技术在发送端将数字信号转换为模拟信号，而在接收端将模拟信号还原为数字 信号，分别对应于调制解调器的调制和解调过程。 1 ) 调幅 (AM)或幅移键控 (ASK)。通过改变载波的振幅来表示数字信号1 和0。例如， 用有载波和无载波输出分别表示1和0。这种方式比较容易实现，但抗干扰能力差。 2 ) 调频 (FM)或频移键控( FSK) 。通过改变载波的频率来表示数字信号1和0。例如，用 频率大和频率f左分别表示1和0。这种方式容易实现，抗干扰能力强，目前应用较广泛。 调相 (PM)或相移键控(PSK) 。通过改变载波的相位来表示数字信号1和0。例如，用 相位0和π分别表示1和0,是一种绝对调相方式。 与 PSK 不同，DPSK(差分相移键控)是一种相对调相方式，它通过检测当前码元与前一个码元的 载波相位差来传输数字信息。例如，使用相位有无变化分别表示1和0。 4)正交幅度调制 ( QAM)。在频率相同的前提下，将AM 与 PM 结合起来，形成叠加信号。 设波特率为B, 采用m 个相位，每个相位有n 种振幅，则该QAM 的数据传输速率R 为 R=Blog₂(mn) (单位为b/s)？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c1e8cd306816c9f8974fb42aafc0a5df"
  },
  "doc-588eb259656960c3f3e0c8fe1508c214": {
    "content": "TCP对网络拥塞的处理 无论在慢开始阶段还是在拥塞避免阶段，只要发送方判断网络出现拥塞(未按时收到确认), 就要首先把慢开始门限ssthresh 设置为出现拥塞时的发送方的cwnd 值的一半(但不能小于2), 然后把拥塞窗口cwnd 重新设置为1,执行慢开始算法。这样做的目的是迅速减少主机发送到网络中的分组数，使得发生拥塞的路由器有足够时间把队列中积压的分组处理完。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-588eb259656960c3f3e0c8fe1508c214"
  },
  "doc-8df1684622e14f4dc123ffc82ec264f9": {
    "content": "电子邮件格式 一个电子邮件分为信封和内容两大部分，邮件内容又分为首部和主体两部分。RFC 822规定 了邮件的首部格式，而邮件的主体部分则让用户自由撰写。用户写好首部后，邮件系统自动地将 信封所需的信息提取出来并写在信封上，用户不需要亲自填写信封上的信息。 邮件内容的首部包含一些首部行，每个首部行由一个关键字后跟冒号和值组成。有些关键字 是必需的，有些则是可选的。最重要的关键字是To 和 Subject。 To是必填的关键字，后面填入一个或多个收件人的电子邮件地址。电子邮件地址的格式为： 收件人邮箱名@邮箱所在主机的域名，如abc@cskaoyan.com, 其中邮箱名abc 在 cskaoyan.com 这 个邮件服务器上必须是唯一的。这也就保证了该邮件地址在整个因特网上是唯一的。 Subject是可选关键字，是邮件的主题，反映了邮件的主要内容。 当然，还有一个必填的关键字是 From, 但它通常由邮件系统自动填入。首部与主体之间用 一个空行进行分割。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-8df1684622e14f4dc123ffc82ec264f9"
  },
  "doc-db3ccd39bbf8db8451887a2e313c745b": {
    "content": "链路状态算法 链路状态是指本路由器都和哪些路由器相邻，以及相应链路的代价。链路状态算法要求每个 节点都具有全网拓扑结构图(这个拓扑结构图在全网范围内是一致的),它们执行下列两项任务： 第一，主动测试所有相邻节点的状态；第二，定期地将链路状态传播给所有其他节点。因此每个 节点都知道全网共有多少个节点、哪些节点是相连的、其代价是多少等，于是每个节点都可使用 Dijkstra 最短路径算法计算出到达其他节点的最短路径。 在链路状态算法中，节点每收到一个链路状态报文，便用其更新自己的网络状态“视野图”, 一旦链路状态发生变化，就使用 Dijkstra 算法重新计算到达所有其他节点的最短路径。 因为一个节点的链路状态只涉及相邻节点的连通状态，而与整个互联网的规模并无直接关 系，所以链路状态算法适用于大型的或路由信息变化聚敛的互联网环境。 链路状态算法的主要优点是，每个节点都使用同样的链路状态数据独立地计算路径，而不依 赖中间节点的计算；链路状态报文不加改变地传播，因此采用该算法易于查找故障。当一个节点 从所有其他节点接收到报文时，它就在本地立即计算出正确的路径，保证一步汇聚。最后，因为 链路状态报文仅运载来自单个节点关于直接链路的信息，其大小与网络中的节点数量无关，所以 链路状态算法比距离-向量算法有更好的规模可伸展性。 两种路由算法的比较：在距离-向量算法中，每个节点仅与它的直接邻居交谈，向它的邻居 发送自己的路由表，其大小取决于网络中的节点数量，代价较大。在链路状态算法中，每个节点 通过广播的方式与所有其他节点交谈，但它只告诉它们与它直接相连的链路的费用。 典型的链路状态路由算法是OSPF 算法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-db3ccd39bbf8db8451887a2e313c745b"
  },
  "doc-0e8bd78e0727aeb56d5fa3f094dd829f": {
    "content": "TCP的特点 TCP 是在不可靠的IP 层之上实现的可靠的数据传输协议，它主要解决传输的可靠、有序、 无丢失和不重复问题。TCP 是TCP/IP 体系中非常复杂的一个协议，主要特点如下： 1)TCP是面向连接的传输层协议，TCP 连接是一条逻辑连接。 2)每一条TCP 连接只能有两个端点，每一条TCP 连接只能是一对一的。 3)TCP 提供可靠交付的服务，保证传送的数据无差错、不丢失、不重复且有序。 4)TCP 提供全双工通信，允许通信双方的应用进程在任何时候都能发送数据，为此TCP 连 接的两端都设有发送缓存和接收缓存，用来临时存放双向通信的数据。 发送缓存用来暂时存放以下数据：①发送应用程序传送给发送方TCP 准备发送的数据； ②TCP 已发送但尚未收到确认的数据。接收缓存用来暂时存放以下数据：①按序到达但尚未被接收应用程序读取的数据；②不按序到达的数据。 5)TCP是面向字节流的，虽然应用程序和 TCP 的交互是一次一个数据块(大小不等),但 TCP 把应用程序交下来的数据仅视为一连串的无结构的字节流。 TCP和UDP在发送报文时所采用的方式完全不同。UDP 报文的长度由发送应用进程决定， 而 TCP报文的长度则根据接收方给出的窗口值和当前网络拥塞程度来决定。若应用进程传送到 TCP 缓存的数据块太长，则TCP 就把它划分得短一些再传送；若太短，则TCP 也可等到积累足 够多的字节后再构成报文段发送出去。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0e8bd78e0727aeb56d5fa3f094dd829f"
  },
  "doc-169053a2232207c83234da77af38a353": {
    "content": "11.差错控制 实际通信链路都不是理想的，比特在传输过程中可能产生差错，1可能变成0,0也可能 变成1,这就是比特差错。比特差错是传输差错中的一种，本节仅讨论比特差错。 通常利用编码技术进行差错控制，主要有两类：自动重传请求 (Automatic Repeat reQuest, ARQ) 和前向纠错 (Forward Error Correction,FEC)。在 ARQ 方式中，当接收方检测到差错时， 就设法通知发送方重发，直到收到正确的数据为止。在FEC 方式中，接收方不但能发现差错，而 且能确定错误的位置并加以纠正。因此，差错控制又可分为检错编码和纠错编码。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-169053a2232207c83234da77af38a353"
  },
  "doc-3334aa0786dc2897d44d448c9a247cf9": {
    "content": "FTP的数据连接与控制连接 FTP 在工作时使用两个并行的TCP 连接(见图6.7):一个是控制连接(服务器端口号21), 一个是数据连接(服务器端口号20)。使用两个不同的端口号可以使协议更容易实现。 1. 控制连接 服务器监听21号端口，等待客户连接，建立在这个端口上的连接称为控制连接，用来传输 控制信息(如连接请求、传送请求等)。 FTP客户发出的传送请求，通过控制连接发送给服务器 端的控制进程，但控制连接并不用来传送文件。在传输文件时还可以使用控制连接(如客户在传输中途发一个中止传输的命令),因此控制连接在整个会话期间一直保持打开状态。 2. 数据连接 服务器端的控制进程在接收到FTP 客户发送来的文件传输请求后，就创建“数据传送进程” 和“数据连接”。数据连接用来连接客户端和服务器端的数据传送进程，数据传送进程实际完成文件的传送，在传送完毕后关闭“数据传送连接”并结束运行。 数据连接有两种传输模式：主动模式 PORT 和被动模式 PASV 。PORT 模式的工作原理：客户端连接到服务器的21 端口，登录成功后要读取数据时，客户端随机开放一个端口，并发送命令告知服务器，服务器收到PORT 命令和端口号后，通过20端口和客户端开放的端口连接，发送数据。PASV 模式的不同点是，客户端要读取数据时，发送 PASV 命令到服务器，服务器在本地随机开放一个端口，并告知客户端，客户端再连接到服务器开放的端口进行数据传输。可见，是用PORT 模式还是PASV 模式，选择权在客户端。简单概括为，主动模式传送数据是“服务器” 连接到“客户端”的端口；被动模式传送数据是“客户端”连接到“服务器”的端口。 因为FTP 使用了一个分离的控制连接，所以也称 FTP 的控制信息是带外 (Out-of-band) 传送的。使用FTP时，要修改服务器上的文件，就需要先将此文件传送到本地主机，然后将修改后的文件副本传送到原服务器，来回传送耗费很多时间。网络文件系统 (NFS)采用另一种思路，它允许进程打开一个远程文件，并能在该文件的某个特定位置开始读写数据。这样，NFS可使用户只复制一个大文件中的一个很小的片段，而不需要复制整个大文件。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-3334aa0786dc2897d44d448c9a247cf9"
  },
  "doc-3f5132f330747329c26f7601c6af729a": {
    "content": "端口号 应用进程通过端口号进行标识，端口号长度为16比特，能够表示65536(2¹⁶)个不同的端 口号。端口号只具有本地意义，即端口号只标识本计算机应用层中的各进程，在因特网中不同计 算机的相同端口号是没有联系的。根据端口号范围可将端口分为两类： 1)服务器端使用的端口号。它又分为两类，最重要的一类是熟知端口号，数值为0～1023, IANA (互联网地址指派机构)把这些端口号指派给了 TCP/IP 最重要的一些应用程序， 让所有的用户都知道。另一类称为登记端口号，数值为1024～49151,它是供没有熟知端 口号的应用程序使用的，使用这类端口号必须在IANA 登记，以防止重复。 一些常用的熟知端口号如下： FTP:21; TELNET:23; SMTP:25; DNS:53; TFTP:69; HTTP:80; SNMP:161. 客户端使用的端口号，数值为49152～65535。因为这类端口号仅在客户进程运行时才动 态地选择，所以也称短暂端口号。当服务器进程收到客户进程的报文时，就知道了客户 进程所使用的端口号，因而可以把数据发送给客户进程。通信结束后，刚用过的客户端 口号就不复存在，这个端口号就可以供其他客户进程使用。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-3f5132f330747329c26f7601c6af729a"
  },
  "doc-c06771e1eb5bb3cec6ec51a65632acd0": {
    "content": "15.中继器 中继器的主要功能是放大、整形并转发信号，以消除信号经过一长段电缆后产生的失真和衰 减，使信号的波形和强度达到所需的要求，进而扩大网络传输的距离。其原理是信号再生(而非 简单地放大衰减的信号)。中继器有两个端口，数据从一个端口输入，从另一个端口发出。端口 仅作用于信号的电气部分，而不管是否有错误数据或不适于网段的数据。 中继器两端的网络部分是网段，而不是子网，使用中继器连接的几个网段仍是一个局域 网。中继器若出现故障，则对相邻两个网段的工作都产生影响。 从理论上讲，中继器的使用数量是无限的，网络因而也可无限延长。但事实上这是不可能的， 因为网络标准中对信号的延迟范围做了具体规定，中继器只能在该范围内进行有效的工作，否则 会引起网络故障。例如，在采用粗同轴电缆的10BASE5 以太网规范中，互相串联的中继器的个 数不能超过4个，而且用4个中继器串联的5段通信介质中，只有3段可以挂接计算机，其余2 段只能用作扩展通信范围的链路段，不能挂接计算机。这就是所谓的“5-4-3规则”。 放大器和中继器都起放大作用，只不过放大器放大的是模拟信号，其原理是放大衰减的信号， 而中继器放大的是数字信号，其原理是整形再生衰减的信号。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-c06771e1eb5bb3cec6ec51a65632acd0"
  },
  "doc-5b1d47ca7da9d5a7ab5dc2840d5ed9f6": {
    "content": "TCP的重传机制 两种事件会导致TCP 对报文段进行重传：超时和冗余 ACK。 (1)超时 TCP 每发送一个报文段，就对这个报文段设置一个超时计时器。计时器设置的重传时间到期 但还未收到确认时，就要重传这一报文段。 因为 TCP 的下层是互联网环境，IP 数据报所选择的路由变化很大，所以传输层的往返时延 的方差也很大。为了计算超时计时器的重传时间，TCP 采用一种自适应算法，它记录一个报文段 发出的时间，以及收到相应确认的时间，这两个时间之差称为报文段的往返时间 (Round-Trip Time,RTT) 。TCP 维护了RTT 的一个加权平均往返时间RTTS, 它会随新测量RTT 样本值的变 化而变化。显然，超时计时器设置的超时重传时间 (Retransmission Time-Out,RTO)应略大于 RTTS, 但也不能大太多，否则当报文段丢失时，TCP 不能很快重传，导致数据传输时延大。 (2)冗余 ACK (冗余确认) 超时触发重传存在的一个问题是超时周期往往太长。所幸的是，发送方通常可在超时事件发生 之前通过注意所谓的冗余 ACK 来较好地检测丢包情况。冗余 ACK 就是再次确认某个报文段的 ACK, 而发送方先前已经收到过该报文段的确认。例如，发送方 A 发送了序号为1、2、3、4、5 的 TCP 报文段，其中2号报文段在链路中丢失，它无法到达接收方B。因此3、4、5号报文段对于 B 来说就成了失序报文段。TCP 规定每当比期望序号大的失序报文段到达时，就发送一个冗余ACK, 指明下一个期待字节的序号。在本例中，3、4、5号报文段到达B, 但它们不是B 所期望收到的下 一个报文段，于是B 就发送3个对1号报文段的冗余ACK, 表示自己期望接收2号报文段。 TCP 规定当发送方收到对同一个报文段的3个冗余ACK 时，就可以认为跟在这个被确认报文段之后的 报文段已经丢失。就前面的例子而言，当A 收到对于1号报文段的3个冗余ACK 时，它可以认为 2号报文段已经丢失，这时发送方A 可以立即对2号报文段执行重传，这种技术通常称为快速重传。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5b1d47ca7da9d5a7ab5dc2840d5ed9f6"
  },
  "doc-dbba4dd414ecddd29738035d33f3ca3b": {
    "content": "41.IGMP与多播路由协议 路由器要获得多播组的成员信息，需要利用网际组管理协议 (Internet Group Management Protocol,IGMP) 。连接到局域网上的多播路由器还必须和互联网上的其他多播路由器协同工 作，以便把多播数据报用最小代价传送给所有组成员，这就需要使用多播路由选择协议。 IGMP 是让连接到本地局域网上的多播路由器，知道本局域网上是否有主机参加或退出了某 个多播组。IGMP 并不是在互联网范围内对所有多播组成员进行管理的协议。IGMP 不知道IP 多 播组包含的成员数，也不知道这些成员分布在哪些网络上。 IGMP 报文被封装在IP 数据报中传送，但它也向IP 提供服务。因此不把IGMP 视为一个单 独的协议，而视为整个网际协议IP 的一个组成部分。IGMP 的工作可分为两个阶段。 第一阶段：当某台主机加入新的多播组时，该主机应向多播组的多播地址发送一个IGMP 报 文，声明自己要成为该组的成员。本地的多播路由器收到IGMP 报文后，还要利用多播路由选择 协议，把这种组成员关系转发给互联网上的其他多播路由器。 第二阶段：组成员关系是动态的。本地多播路由器要周期性地探询本地局域网上的主机，以 便知道这些主机是否仍然是组的成员。只要对某个组有一台主机响应，多播路由器就认为这个组 是活跃的。但一个组在经过几次探询后仍然没有一台主机响应，多播路由器就认为本网络上的主 机都已离开了这个组，因此就不再把这个组的成员关系转发给其他的多播路由器。 多播路由选择实际上就是要找出以源主机为根节点的多播转发树，其中每个分组在每条链路 上只传送一次(在多播转发树上的路由器不会收到重复的多播数据报)。不同的多播组对应于不 同的多播转发树；同一个多播组，对不同的源点也会有不同的多播转发树。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-dbba4dd414ecddd29738035d33f3ca3b"
  },
  "doc-74cd39b29d5c7a9dfcb41fbed25d63d0": {
    "content": "5.无连接服务与面向连接服务 TCP/IP 族在IP 层之上使用了两个传输协议：一个是面向连接的传输控制协议 (TCP), 采用TCP时，传输层向上提供的是一条全双工的可靠逻辑信道；另一个是无连接的用户数据报协议 (UDP), 采用UDP 时，传输层向上提供的是一条不可靠的逻辑信道。 TCP 提供面向连接的可靠服务，通信双方在传送数据之前必须先建立连接，然后基于此连接 进行可靠数据传输，数据传输结束后要释放连接。TCP不提供广播或多播服务。TCP 为了实现可靠数据传输，就必须增加许多措施，如确认、流量控制、计时器及连接管理等。这不仅使协议数 据单元的首部增大很多，还要占用许多的处理机资源。因此TCP 主要适用于可靠性更重要的场合， 如文件传输协议(FTP)、 超文本传输协议(HTTP)、 远程登录 (TELNET) 等。 UDP 提供无连接的不可靠服务，通信双方在传送数据之前不需要建立连接，接收方的传输层 在收到UDP 用户数据报后，无须给发送方发回任何确认。UDP 在 IP 层之上仅提供两个附加服务：多路复用和对数据的错误检查。 IP 层知道怎样把分组投递给一台主机，但不知道怎样把它们投递 给主机上的具体应用。因为UDP 比较简单，所以执行速度比较快、实时性好。使用UDP的应用主要包括小文件传送协议 (TFTP) 、DNS 、SNMP 和实时传输协议 (RTP)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-74cd39b29d5c7a9dfcb41fbed25d63d0"
  },
  "doc-528dfb25f22949fe9ea4111070de3c61": {
    "content": "慢开始算法 慢开始算法的思路是当发送方刚开始发送数据时，因为并不清楚网络的负荷情况，若立即把 大量数据注入网络，则有可能引发网络拥塞。具体方法是：先发送少量数据探测一下，若没有发 生拥塞，则适当增大拥塞窗口，即由小到大逐渐增大拥塞窗口(发送窗口)。 例如，A向B发送数据，发送方先令cwnd=1,即一个MSS 。A发送第一个报文段，A收到 B 对第一个报文段的确认后，把cwnd 从1增大到2。于是A 接着发送两个报文段，A收到B对这两个报文段的确认后，把cwnd 从2增大到4,下次就可一次发送4个报文段。 慢开始的“慢”并不是指拥塞窗口 cwnd 的增长速率慢，而是指在TCP 开始发送报文段时先 设置cwnd=1, 使得发送方一开始向网络注入的报文段少(目的是试探一下网络的拥塞情况),然 后逐渐增大cwnd, 这对防止网络出现拥塞是一个非常有力的措施。使用慢开始算法后，每经过一 个传输轮次(往返时延RTT),cwnd 就会加倍，即cwnd 的值随传输轮次指数增长。为了防止cwnd 增长过大而引起网络拥塞，还需要设置一个慢开始门限ssthresh(阈值)。这样，当慢开始一直把 cwnd 增大到一个规定的ssthresh 时，然后改用拥塞避免算法。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-528dfb25f22949fe9ea4111070de3c61"
  },
  "doc-5a5bd9dacfaef1b13999f924eee82889": {
    "content": "基于RIP协议的距离向量算法 对每个相邻路由器发送来的RIP 报文，执行如下步骤： 1)对地址为X 的相邻路由器发来的RIP 报文，先修改该报文中的所有项目：把“下一跳” 字段中的地址都改为X, 并把所有“距离”字段的值加1。 2)对修改后的RIP 报文中的每个项目，执行如下步骤： IF(若原来的路由表中没有目的网络N) 则把该项目添加到路由表中(表明这是新的目的网络)。 ELSEIF (若原来的路由表中有目的网络N, 且下一跳路由器的地址是X) 用收到的项目替换原路由表中的项目(因为要以更新的消息为准)。 ELSEIF (若原来的路由表中有目的网络N, 且下一跳路由器的地址不是X) 若收到的项目中的距离d 小于路由表中的距离，则进行更新。 ELSE 什么也不做。 3)若180秒(RIP 默认超时时间)还没有收到相邻路由器的更新路由表，则把此相邻路由器 记为不可达的路由器，即把距离设置为16(表示不可达)。 4)返回。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-5a5bd9dacfaef1b13999f924eee82889"
  },
  "doc-90854237162527620c06990af4b61242": {
    "content": "42.冲突域与广播域 这里的“域”表示冲突或广播在其中发生并传播的区域。 1. 冲突域 冲突域是指连接到同一物理介质上的所有节点的集合，这些节点之间存在介质争用的现象。 在OSI 参考模型中，冲突域被视为第1层的概念，像集线器、中继器等简单复制转发信号的第1 层设备所连接的节点都属于同一个冲突域，也就是说它们不能划分冲突域。而第2层(网桥、交 换机)、第3层(路由器)设备都可以划分冲突域。 2. 广播域 广播域是指接收同样广播消息的节点集合。也就是说，在该集合中的任何一个节点发送一个 广播帧，其他能收到这个帧的节点都被认为是该广播域的一部分。在OSI 参考模型中，广播域被 视为第2层的概念，像第1层(集线器等)、第2层(交换机等)设备所连接的节点都属于同一 个广播域。而路由器，作为第3层设备，则可以划分广播域，即可以连接不同的广播域。 通常所说的局域网 (LAN) 特指使用路由器分割的网络，也就是广播域。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-90854237162527620c06990af4b61242"
  },
  "doc-e154de1eb0dc691bb53be3a8ede745b5": {
    "content": "电子邮件系统的组成结构 自从有了因特网，电子邮件就在因特网上流行起来。电子邮件是一种异步通信方式，通信时 不需要双方同时在场。电子邮件把邮件发送到收件人使用的邮件服务器，并放在其中的收件人邮 箱中，收件人可以随时上网到自己使用的邮件服务器进行读取。 一个电子邮件系统应具有三个最主要的组成构件，即用户代理 (User Agent)、 邮件服务器和电子邮件使用的协议，如 SMTP 、POP3 (或IMAP)等。 用户代理(UA): 用户与电子邮件系统的接口。用户代理向用户提供一个很友好的接口来发送 和接收邮件，用户代理至少应当具有撰写、显示和邮件处理的功能。通常情况下，用户代理就是一个运行在PC 上的程序(电子邮件客户端软件),常见的有Outlook 和Foxmail等。 邮件服务器：它的功能是发送和接收邮件，同时还要向发件人报告邮件传送的情况(已交付、 被拒绝、丢失等)。邮件服务器以客户/服务器模式工作，但它必须能够同时充当客户和服务器。例如，当邮件服务器A向邮件服务器B发送邮件时，A就作为SMTP 客户，而B是 SMTP服务器；反之，当B向A发送邮件时，B就是SMTP客户，而A 就是 SMTP服务器。 邮件发送协议和读取协议：邮件发送协议用于用户代理向邮件服务器发送邮件或在邮件服务 器之间发送邮件，如 SMTP; 邮件读取协议用于用户代理从邮件服务器读取邮件，如POP3。注意， SMTP 用的是推(Push) 的通信方式，即用户代理向邮件服务器发送邮件及在邮件服务器之间发 送邮件时，SMTP 客户将邮件推送到SMTP 服务器。而POP3 用的是拉(Pull) 的通信方式，即用 户读取邮件时，用户代理向邮件服务器发出请求，拉取用户邮箱中的邮件。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e154de1eb0dc691bb53be3a8ede745b5"
  },
  "doc-91a00947f0ffba20abf053cd6609f4b4": {
    "content": "22.ALOHA协议 ALOHA 协议分为纯ALOHA 协议和时隙 ALOHA 协议两种。 ( 1 ) 纯ALOHA协议 纯 ALOHA 协议的基本思想是，当总线形网络中的任何站点需要发送数据时，可以不进行任 何检测就发送数据。若在一段时间内未收到确认，则该站点就认为传输过程中发生了冲突。发送 站点需要等待一段随机的时间后再发送数据，直至发送成功。 纯 ALOHA 网络的吞吐量很低，为了克服这个缺点，便产生了时隙 ALOHA 协议。 (2)时隙ALOHA 协议 时隙ALOHA 协议同步各站点的时间，将时间划分为一段段等长的时隙 (Slot), 规定站点只 能在每个时隙开始时才能发送帧，发送一帧的时间必须小于或等于时隙的长度。这样就避免了用 户发送数据的随意性，降低了产生冲突的可能性，提高了信道的利用率。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-91a00947f0ffba20abf053cd6609f4b4"
  },
  "doc-d16aae67dc3497ccf86dee7749557668": {
    "content": "16.集线器 集线器(Hub) 实质上是一个多端口的中继器。当Hub 工作时，一个端口接收到数据信号后， 因为信号在从端口到Hub 的传输过程中已有衰减，所以 Hub 便对该信号进行整形放大，使之再生 (恢复)到发送时的状态，紧接着转发到其他所有(除输入端口外)处于工作状态的端口。若同 时有两个或多个端口输入，则输出时将发生冲突，致使这些数据都无效。从Hub 的工作方式可以 看出，它在网络中只起信号放大和转发作用，目的是扩大网络的传输范围，而不具备信号的定向 传送能力，即信息传输的方向是固定的，是标准的共享式设备。 使用Hub 组网灵活，它将所有节点的通信集中在以其为中心的节点上，由Hub 组成的网络 是共享式网络，但逻辑上仍是总线网。 Hub 的每个端口连接的是同一网络的不同网段，同时 Hub 也只能在半双工状态下工作，网络的吞吐率因而受到限制。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-d16aae67dc3497ccf86dee7749557668"
  },
  "doc-2a63d10fa3d4c016a761cb8f1ae3c704": {
    "content": "22.地址解析协议 无论网络层使用什么协议，在实际网络的链路上传送数据帧时，最终必须使用硬件地址。所 以需要一种方法来完成 IP 地址到 MAC 地址的映射，这就是地址解析协议 (Address Resolution Protocol,ARP) 。 每台主机都设有一个 ARP 高速缓存，用来存放本局域网上各主机和路由器的 IP 地址到 MAC 地址的映射表，称ARP 表。使用ARP 来动态维护ARP 表。ARP对高速缓存中的 每个映射表项都设置了生存时间(如20min), 超时的项目会从高速缓存中删除。 ARP 工作在网络层，其工作原理如下：主机A 欲向本局域网上的某台主机B 发送IP 数据报 时，先在其 ARP 高速缓存中查看有无主机B 的 IP 地址。若有，则可以查出其对应的硬件地址，再将此硬件地址写入MAC帧，然后通过局域网将该MAC 帧发往此硬件地址。若没有，则通过使用目的MAC地址为FF-FF-FF-FF-FF-FF 的帧来封装并广播 ARP 请求分组 (广播发送),使同 一个局域网里的所有主机都收到此 ARP 请求。主机 B 收到该ARP 请求后，向主机A发出ARP 响应分组(单播发送),分组中包含主机B的IP 地址与MAC 地址的映射关系，主机A 收到ARP 响应分组后就将此映射写入ARP 缓存，然后按查询到的硬件地址发送MAC 帧 。ARP 因为“看到 了”IP 地址，所以它工作在网络层，而NAT 路由器因为“看到了”端口，所以它工作在传输层。 对于某个协议工作在哪个层次，读者应该能通过协议的工作原理进行推测。 使用ARP 的4种典型情况总结如下： 1)发送方是主机(如H1), 要把IP 分组发送到本网络上的另一台主机(如H2) 。 这时H1在网1用 ARP 找到目的主机H2 的硬件地址。 2)发送方是主机(如H1), 要把IP 分组发送到其他网络上的一台主机(如H4) 。 这时H1用ARP 找到与网1连接的路由器R1 的硬件地址(默认网关),剩下的工作由R1 来完成。 3)发送方是路由器(如R1), 要把IP 分组转发到与R1 连接的网络(网2)上的一台主机(如H3)。 这时R1在网2用ARP 找到目的主机 H3的硬件地址。 4)发送方是路由器(如R1), 要把IP 分组转发到网3上的一台主机(如H4) 。这时R1 在 网 2 用ARP 找到与网2连接的路由器 R2 的硬件地址，剩下的工作由R2 来完成。 从 IP 地址到硬件地址的解析是自动进行的，主机的用户并不知道这种地址解析过程。只要 主机或路由器和本网络上的另一个已知 IP 地址的主机或路由器进行通信，ARP 就自动地将这个 IP 地址解析为数据链路层所需的硬件地址，然后插入MAC 帧。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-2a63d10fa3d4c016a761cb8f1ae3c704"
  },
  "doc-52a207a3ccb7b9cffa0c5af13890b31c": {
    "content": "35.以太网的MAC 地址 IEEE 802 标准为局域网规定了一种48位的全球地址，是指局域网上的每台计算机中固化在网 络适配器的ROM 中的地址，称为物理地址或MAC 地址(因为这种地址用在MAC 帧中),这个地 址用于控制主机在网络上的数据通信。全世界所有的局域网适配器都具有不同的地址，一台计算机只要没有更换适配器，不管其地理位置如何变化，其MAC 地址都不会变化。 MAC 地址长6字节，一般用由连字符(或冒号)分隔的12个十六进制数表示，如02-60-8c-e4- b1-21。高24位为厂商代码，低24位为厂商自行分配的适配器序列号。 当路由器通过适配器连接到局域网时，适配器上的MAC 地址就用来标志路由器的某个接口。 路由器若同时连接到两个网络上，则它需要两个适配器和两个MAC 地址。 适配器从网络上每收到一个 MAC 帧，首先都要用硬件检查MAC 帧中的目的地址。若是发 往本站的帧，则收下，否则丢弃该帧。这里“发往本站的帧”包括以下三种帧： 1)单播帧 (一对一),即收到的帧的目的地址与本站的MAC 地址相同。 2)广播帧 (一对全体),即发送给本局域网上所有站点的(全1地址)。 3)多播帧 (一对多),即发送给本局域网上一部分站点的帧。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-52a207a3ccb7b9cffa0c5af13890b31c"
  },
  "doc-b437fcc9f1d822942164e84a58be978c": {
    "content": "33.以太网与IEEE 802.3 以太网是目前最流行的有线局域网技术。 以太网规约的第一个版本是DIX V1,它 由DEC 、Intel 和 Xerox 联合提出。之后，它被修 改为第二版规约 DIX Ethernet V2,是世界上第一个局域网产品的规约。在此基础上， IEEE 802 委员会的IEEE 802.3工作组制定了第一个IEEE 的以太网标准IEEE 802.3。 严格来说，以太网是指符合DIX Ethernet V2 标准的局域网，但DIX Ethernet V2 标准与 IEEE 802.3标准的差别很小，因此通常将802.3局域网简称为以太网。 以太网采用两项措施来简化通信：①采用无连接的工作方式，既不对发送的数据帧编号，又 不要求接收方发送确认，即以太网尽最大努力交付数据，提供的是不可靠服务，对差错的纠正则 由高层完成；②发送的数据都使用曼彻斯特编码的信号，每个码元的中间出现一次电压转换，接 收方利用这种电压转换方便地将位同步信号提取出来。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-b437fcc9f1d822942164e84a58be978c"
  },
  "doc-923e96e4d4b52bb3b04cfe246c6719a2": {
    "content": "文件传输协议FTP的工作原理 文件传输协议( File Transfer Protocol,FTP) 是因特网上使用得最广泛的文件传输协议。FTP 提供交互式的访问，允许客户指明文件的类型与格式，并允许文件具有存取权限。它屏蔽了各计 算机系统的细节，因而适合于在异构网络中的任意计算机之间传送文件。 FTP 提供以下功能： ① 提供不同种类主机系统(硬、软件体系等都可以不同)之间的文件传输能力。 ② 以用户权限管理的方式提供用户对远程 FTP 服务器上的文件管理能力。 ③ 以匿名FTP 的方式提供公用文件共享的能力。 FTP 采用客户/服务器的工作方式，使用TCP 可靠的传输服务。一个 FTP 服务器进程可同时为多个客户进程提供服务。FTP的服务器进程由两大部分组成：一个主进程，负责接收新的请求；另外有若干从属进程，负责处理单个请求。其工作步骤如下： ① 打开熟知端口21(控制端口),使客户进程能够连接上。 ② 等待客户进程发连接请求。 ③ 启动从属进程处理客户进程发来的请求。从属进程对客户进程的请求处理完毕后即终止。 ④ 回到等待状态，继续接收其他客户进程的请求。主进程与从属进程是并发执行的。 FTP 服务器必须在整个会话期间保留用户的状态信息。特别是服务器必须把指定的用户账户与控制连接联系起来，服务器必须追踪用户在远程目录树上的当前位置。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-923e96e4d4b52bb3b04cfe246c6719a2"
  },
  "doc-6d0c5176c7587384840d073ee892cd5d": {
    "content": "8.IPv4 分组 IPv4 (版本4)即现在普遍使用的网际协议( Internet Protocol,IP) 。IP 定义数据传送的基本 单元——IP 分组及其确切的数据格式。IP 也包括一套规则，指明分组如何处理、错误怎样控制。 特别是IP 还包含非可靠投递的思想，以及与此关联的路由选择的思想。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-6d0c5176c7587384840d073ee892cd5d"
  },
  "doc-0318afa67c7c85cf3251f467138be0c5": {
    "content": "17.多帧滑动窗口与后退N 帧协议 (GBN ) 在后退N帧协议中，发送方可在未收到确认帧的情况下，将序号在发送窗口内的多个数据帧 全部发送出去。后退 N 帧的含义是：发送方发送N 个数据帧后，若发现这N 个帧的前一个数据 帧在计时器超时的时候仍未收到其确认信息，则该帧被判为出错或丢失，此时发送方不得不重传该出错帧及随后的N 个帧。这意味着，接收方只允许按顺序接收帧。 发送方向接收方发送数据帧。发送方发完0号帧后，可以继续发送后续的1 号帧、2号帧等。发送方每发送完一个数据帧，就要为该帧设置超时计时器。因为连续发送了许 多帧，所以确认帧必须指明是对哪个帧的确认。为了降低开销，GBN 协议允许接收方进行累积确 认，即允许接收方不需要每收到一个正确的数据帧就立即发回一个确认帧，而可在连续收到多个 正确的数据帧后，对最后一个数据帧发回确认信息，也就是说“对某个数据帧的确认就代表该帧 和之前所有的数据帧均已正确无误地收到”。ACKn 表示对n 号帧的确认，表示接收方已正确收到 n 号帧及之前的所有帧，下次期望收到n+1 号帧(也可能是0号帧)。接收方只按序接收数据帧。 在图3.11中，虽然在有差错的2号帧之后接着收到了正确的6个数据帧，但接收方必须将这些帧丢弃，此外，接收方还可重发已发送的最后一个确认帧 ACK1(以防止ACK1丢失)。等2号帧超过超时重传时间，发送方重新发送窗口中2号帧之后的所有数据帧。 若采用n 比特对帧编号，则其发送窗口 WT 应满足1<WT≤2\"-1。 若 WT 大于2\"-1,则会造 成接收方无法分辨新数据帧和旧数据帧(参考本章末的疑难点1)。 后退N 帧协议的接收窗口WR=1, 可保证按序接收数据帧。 不难看出，后退N 帧协议一方面因连续发送数据帧而提高了信道利用率，另一方面在重传时 又必须重传原来已正确到达的帧(仅因这些帧的前面有一帧出错),因此这种做法会降低传送效 率。当信道误码率较大时，后退N 帧协议不一定优于停止-等待协议。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-0318afa67c7c85cf3251f467138be0c5"
  },
  "doc-9b66a4cbfbcae1dc4a7368ac6414968b": {
    "content": "18.多帧滑动窗口与选择重传协议 (SR) 为了进一步提高信道的利用率，可以设法只重传出现差错和计时器超时的数据帧，但此时必 须加大接收窗口，以便先收下失序但正确到达且序号仍落在接收窗口内的那些数据帧，等到所缺 序号的数据帧收齐后，再一并送交上层。这就是选择重传协议。 为了使发送方仅重传出错的帧，接收方不能再采用累积确认，而要对每个正确接收的数据帧 逐一进行确认。显然，选择重传协议比后退N 帧协议更复杂，且接收方需要设置足够的帧缓冲区 (帧缓冲区的数量等于接收窗口大小)来暂存那些失序但正确到达且序号落在接收窗口内的数据 帧。每个发送缓冲区对应一个计时器，当计时器超时的时候，缓冲区的帧就重传。若接收方收到 重复的数据帧(表示确认帧丢失),则丢弃该帧，并重传与该帧对应的确认帧。 选择重传协议还采用了比上述其他协议更有效的差错处理策略，即一旦接收方检测到某个数 据帧出错，就向发送方发送一个否定帧NAK, 要求发送方立即重传NAK 指定的数据帧。在图3.12 中，2号帧丢失后，接收方仍可正常接收并缓存之后收到的数据帧，待发送方超时重传2号帧并 被接收方成功接收后，接收窗口就可向前移动，而当发送方收到2号帧的确认后，发送窗口就可 向前移动。在某个时刻，接收方检测到10号帧出错，向发送方发出否定帧NAK10, 在此期间接 收方仍可正常接收并缓存之后收到的帧，发送方收到否定帧NAK10 后立即重传10号帧。 选择重传协议的接收窗口WR和发送窗口WT都大于1,一次可以发送或接收多个帧。若采用 n 比特对帧编号，需满足条件①: WR+WT≤2\" (否则，在接收方的接收窗口向前移动后，若有一 个或多个确认帧丢失，则发送方就会超时重传之前的旧数据帧，接收窗口内的新序号与之前的旧 序号出现重叠，接收方就无法分辨是新数据帧还是重传的旧数据帧)。此外，还应满足条件②: WR≤WT 就毫无意义)。由①和②不难得出WR≤2\"⁻¹ 。 一般情况下，WR和 WT的大小是相同的。 (否则，若接收窗口大于发送窗口，则接收窗口永远不可能填满，接收窗口多出的空间",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-9b66a4cbfbcae1dc4a7368ac6414968b"
  },
  "doc-3847f9aa49369d22b4fdfc26cedada4d": {
    "content": "默认网关 默认网关是子网与外部网络连接的设备，也就是连接本机或子网的路由器接口的 IP地址。 当主机发送数据时，根据所发送数据的目的IP 地址，通过子网掩码来判定目的主机是否在子网中， 若目的主机在子网中，则直接发送。若目的主机不在子网中，则将该数据发送到默认网关，由网 关(路由器)将其转发到其他网络，进一步寻找目的主机。 现在的互联网标准规定：所有网络都必须使用子网掩码。若一个网络未划分子网，则该网络 的子网掩码就使用默认子网掩码。A、B、C 类地址的默认子网掩码分别为255.0.0.0、255.255.0.0 、 255.255.255.0。例如，某主机的IP 地址为192.168.5.56,子网掩码为255.255.255.0,进行逐位“与”运算后，得出该主机所在子网的网络号为192.168.5.0。 子网掩码是一个网络的重要属性，路由器相互之间交换路由信息时，必须将自己所在网络的 子网掩码告诉对方。分组转发时，路由器将分组的目标地址和某网络的子网掩码按位相与，若结 果与该网络地址一致，则路由匹配成功，路由器将分组转发至该网络。 在使用子网掩码的情况下： ① 一台主机在设置IP 地址信息的同时，必须设置子网掩码。 ② 同属于一个子网的所有主机及路由器的相应端口，必须设置相同的子网掩码。 ③ 路由器的路由表中所包含的信息主要内容有目的网络地址、子网掩码、下一跳地址。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-3847f9aa49369d22b4fdfc26cedada4d"
  },
  "doc-1959dab4eb3600f3898213e5023c1c88": {
    "content": "1.数据链路层使用的信道主要有两种： 1)点对点信道，使用一对一的通信方式。PPP 则是目前使用最广泛的点对点协议。 2)广播信道，这种信道上连接的主机很多，使用一对多的广播通信方式。采用共享广播信 道的有线局域网普遍使用CSMA/CD 协议，而无线局域网则使用CSMA/CA 协议。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-1959dab4eb3600f3898213e5023c1c88"
  },
  "doc-e51d5ea9f8f7fb96cca4b0ddd7154dc3": {
    "content": "2.数据链路层的功能： 数据链路层的主要任务是让帧在一段链路上或一个网络中传输。数据链路层协议有多种，但 有三个基本问题则是共同的，即封装成帧、透明传输和差错检测。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-e51d5ea9f8f7fb96cca4b0ddd7154dc3"
  },
  "doc-f1f3b50c9d92ca833a45c57b098f4840": {
    "content": "TCP连接管理 TCP 是面向连接的协议，因此每个 TCP 连接都有三个阶段：连接建立、数据传送和连接释 放。TCP 连接的管理就是使运输连接的建立和释放都能正常进行。 在TCP 连接建立的过程中，要解决以下三个问题： 1)要使每一方能够确知对方的存在。 2)要允许双方协商一些参数(如最大窗口值、是否使用窗口扩大选项、时间戳选项等)。 3)能够对运输实体资源(如缓存大小、连接表中的项目等)进行分配。 TCP把连接作为最基本的抽象，每条 TCP 连接有两个端点，TCP连接的端点不是主机，不是主机的IP地址，不是应用进程，也不是传输层的协议端口。TCP连接的端口即为套接字(Socket), 每一条 TCP连接唯一地被通信的两个端点(两个套接字)所确定。还应注意：同一个 IP 地址可 以有多个不同的TCP 连接，而同一个端口号也可以出现在多个不同的TCP 连接中。 TCP 连接的建立采用客户/服务器模式。主动发起连接建立的应用进程称为客户 (Client), 而 被动等待连接建立的应用进程称为服务器 (Server)。",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-f1f3b50c9d92ca833a45c57b098f4840"
  },
  "doc-bd4ce9d03fdbaa35af640be89cae47e3": {
    "content": "9.计算机网络协议、接口、服务的概念 1. 协议 要在网络中做到有条不紊地交换数据，就必须遵循一些事先约定好的规则，其规定了所交换 数据的格式及有关的同步问题。为了在网络中进行数据交换而建立的这些规则、标准或约定称为 网络协议 (Network Protocol),是控制在对等实体之间进行通信的规则的集合，是水平的。不对 等实体之间是没有协议的，如用TCP/IP 栈通信的两个节点A 和节点 B, 节点A 的传输层和节点 B的传输层之间存在协议，但节点A 的传输层和节点B 的网络层之间不存在协议。 协议由语法、语义和同步三部分组成。 1)语法。数据与控制信息的格式。例如，TCP 报文段格式就是由TCP 的语法定义的。 2)语义。即需要发出何种控制信息、完成何种动作及做出何种应答。例如，在建立TCP 连 接时每次握手所执行的操作就是由 TCP 的语义定义的。 3)同步(或时序)。执行各种操作的条件、时序关系等，即事件实现顺序的详细说明。例如， 建立TCP 连接的三次握手操作的时序关系就是由TCP 的同步定义的。 2. 接口 同一节点内相邻两层的实体交换信息的逻辑接口称为服务访问点 (Service Access Point,SAP)。每层只能在紧邻的层之间定义接口，而不能跨层定义接口。服务是通过 SAP 提供给上层使用的，第n 层的SAP 就是第n+1层可以访问第n 层服务的地方。 3. 服务 服务是指下层为紧邻的上层提供的功能调用，是垂直的。对等实体在协议的控制下，使得本层能为上层提供服务，但要实现本层协议，还需要使用下层提供的服务。 注意，协议和服务概念上是不一样的。首先，只有本层协议的实现才能保证向上一层提供服务。本层的服务用户只能看见服务而无法看见下面的协议，即下面的协议对上层的服务用户是透 明的。其次，协议是“水平的”,即协议是控制对等实体之间通信的规则。但是，服务是“垂直 的 ”,即服务是由下层通过层间接口向上层提供的。另外，并非在一层内完成的全部功能都称为 服务，只有那些能够被高一层实体“看得见”的功能才称为服务。？",
    "create_time": 1760356796,
    "update_time": 1760356796,
    "_id": "doc-bd4ce9d03fdbaa35af640be89cae47e3"
  }
}